gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
/*************************************************
版  权:正泰仪表智能终端部
文  件:ReadMeter_Task.c
作  者:苗晓楠
版  本:1.00
日  期:20170601
描  述:抄表任务文件
*************************************************/
/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "../MS/MS.h"
#include "../Hcsg/ProjectCSG.h"
#include "../QCSG_Head/QCSG_UpLinkProtocol.h"
#include "../QCSG_Head/QCSG_DLT645_Protocol.h"

#include "../QCSG_Head/ReadMeter_Task.h"
#include "../QCSG_Head/Chint_Type.h"
#include "../QCSG_Head/QCSG_PublicDefine.h"
#include "../QCSG_Head/QCSG_PublicFunc.h"
#include "../QCSG_Head/QCSG_Table.h"
#include "../QCSG_Head/QCSG_Hal.h"
#include "../QCSG_Data/QCSG_NandDataInterface.h"
#include "../Hcsg/ProjectCSG_3xx_USER30xx.h"
#include "../Hcsg/ERAMCSG.h"
#include "../Hcsg/ERAM_For_Mxn.h"
#include "../Hcsg/IRAM_TerminalSaveCSG.h"
#include "../Calculate/Calculate.h"
#include "../QCSG_Uart/TerminalQCSG_Uart_Manage.h"
#include "Terminal_Task.h"
#include "../STM32F4xx/STM32F4xx_UART.h"


#if ((Project/100)==3) || ((Project/100)==9)	//负控终端
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define JC_IN								1000
#define JC_UN								2200
#define RD_METER_TDC_SEM                    0x01
#define RD_METER_TDD_SEM                    0x02
#define RD_METER_TDM_SEM                    0x04
#define RD_METER_EVENT_SEM                  0x08
#define RD_RELAY_TASK_SEM                   0x10
#define RD_COMMON_TASK_SEM                  0x20
#define ALARM_START							0x01
#define ALARM_END							0x02
/* Private constants ---------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Public variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Public functions ----------------------------------------------------------*/
/* */
/*
 * TODO: 目前97协议电能表不支持告警数据产生
 */
 /**--------------------------------------------------------------------
*功    能:更新测量点波特率
*输入参数:u8PortBaudRate
*输出参数:pu32BpsCtrl
*返    回:无
--------------------------------------------------------------------**/
void RD_GetPn_Bps(u8 u8PortBaudRate,u8 u8PortParity,u8 u8PortDataBit,u8 u8PortStopBit,u32* pu32BpsCtrl)
{
	u32 u32Value = 0;
	
	(*pu32BpsCtrl) = 0;
	if((u8PortDataBit > 8) || (u8PortDataBit < 5))
	{
		u8PortDataBit = 8;
	}
	if(u8PortParity > 2)
	{
		u8PortParity = 1;
	}
	if(u8PortStopBit >= 3)
	{
		u8PortStopBit = 0;
	}
	if((u8PortBaudRate != 4) && (u8PortBaudRate != 8) && (u8PortBaudRate != 16) && (u8PortBaudRate != 32))
	{
		u8PortBaudRate = 8;
	}
	if(u8PortDataBit == 5)
	{
		//5位数据位
		u32Value = 0;
	}
	if(u8PortDataBit == 6)
	{
		//6位数据位
		u32Value = 1;
	}
	if(u8PortDataBit == 7)
	{
		//7位数据位
		u32Value = 2;
	}
	if(u8PortDataBit == 8)
	{
		//8位数据位
		u32Value = 3;
	}
	(*pu32BpsCtrl) = (*pu32BpsCtrl) | u32Value;
	u32Value = 0;
	if(u8PortParity == 1)
	{
		//偶校验
		u32Value = 0;
	}
	if(u8PortParity == 2)
	{
		//奇校验
		u32Value = 1;
	}
	u32Value = u32Value << 2;
	(*pu32BpsCtrl) = (*pu32BpsCtrl) | u32Value;
	u32Value = 0;
	if(u8PortParity == 0)
	{
		u32Value = 0;
	}
	else
	{
		u32Value = 1;
	}
	u32Value = u32Value << 3;
	(*pu32BpsCtrl) = (*pu32BpsCtrl) | u32Value;
	u32Value = 0;
	if((u8PortStopBit == 0) || (u8PortStopBit == 1))
	{
		//1位停止位
		u32Value = 0;
	}
	if(u8PortStopBit == 2)
	{
		//2位停止位
		u32Value = 1;
	}
	u32Value = u32Value << 4;
	(*pu32BpsCtrl) = (*pu32BpsCtrl) | u32Value;
	u32Value = 0;
	if(u8PortBaudRate <= 4)
	{
		//1200
		u32Value = 2;
	}
	if((u8PortBaudRate > 4) && (u8PortBaudRate <= 8))
	{
		//2400
		u32Value = 3;				
	}
	if((u8PortBaudRate > 8) && (u8PortBaudRate <= 16))
	{
		//4800
		u32Value = 4;				
	}
	if(u8PortBaudRate > 16)
	{
		//9600
		u32Value = 6;				
	}
	u32Value = u32Value << 5;
	(*pu32BpsCtrl) = (*pu32BpsCtrl) | u32Value;
}
 /**--------------------------------------------------------------------
*功    能:时间结构体转换
*输入参数:pstTime：时间
*输出参数:pstARD02Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Time_TO_YYTime(TIME_PARAM_S* pstTime,RealTimeYYStruct* pstYYTime)
{
	pstYYTime->YearH = 0x20;
	pstYYTime->YearL = pstTime->u8Year;
	pstYYTime->Month = pstTime->u8Month;
	pstYYTime->Day = pstTime->u8Day;
	pstYYTime->Hour = pstTime->u8Hour;
	pstYYTime->Minute = pstTime->u8Minute;
}
 /**--------------------------------------------------------------------
*功    能:任务上一次执行时间规整，主要用于任务上一次执行时间不合法的情况
*输入参数:pstRefTime,u8PeriodValue，u8PeriodUnit
*输出参数:pstLastTime
*返    回:无
--------------------------------------------------------------------**/
void RD_Task_LastTimeCalc(TIME_PARAM_S* pstLastTime,TIME_PARAM_S* pstCurrTime,TIME_PARAM_S* pstRefTime,u8 u8PeriodValue,u8 u8PeriodUnit)
{
//	u8 i = 0;
	u32 au32Result[4];
	u32 u32PeriodMin = 0,u32IntervalMin = 0,u32IntervalNum = 0,u32IntervalSec = 0;
	
	if(QCSG_TimerSub(pstCurrTime,pstRefTime,au32Result) <= 0)
    {
        //当前时间小于或等于参考时间，上一次上报时间不重新赋值
        return;
    }
	if((au32Result[0] == 0)&&(au32Result[1] == 0)&&(au32Result[2] == 0)&&(au32Result[3] == 0))
	{
		return;
	}
    if(u8PeriodUnit == 3)
	{//err20190528 解决任务/中继冻结数据全F问题
		//单位为月
//		for(i = 0;i < u8PeriodValue;i++)
//		{
//			QCSG_IncOneMonth(pstRefTime);
//			if(QCSG_TimerSub(pstCurrTime,pstRefTime,au32Result) <= 0)
//            {
//                //时间加过
//                break;
//            }
//		}
//		QCSG_DecOneMonth(pstRefTime);
//		MemCopy(pstLastTime,pstRefTime,sizeof(TIME_PARAM_S));
		MemCopy(pstLastTime,pstCurrTime,sizeof(TIME_PARAM_S));	

	}
    if(u8PeriodUnit == 2)
	{//err20190528 解决任务/中继冻结数据全F问题
		//单位为日
		//err20190523 日/月任务数据错误的问题
//		for(i = 0;i < u8PeriodValue;i++)
//		{
//			QCSG_IncOneDay(pstRefTime);
//			if(QCSG_TimerSub(pstCurrTime,pstRefTime,au32Result) <= 0)
//            {
//                //时间加过
//                break;
//            }
//		}
//		QCSG_DecOneDay(pstRefTime);
//		MemCopy(pstLastTime,pstRefTime,sizeof(TIME_PARAM_S));	
		MemCopy(pstLastTime,pstCurrTime,sizeof(TIME_PARAM_S));	

