gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	}
	if(u8PeriodUnit == 1)
	{
		//单位为小时
		u32PeriodMin = u8PeriodValue * 60;
		u32IntervalMin = au32Result[0] * 24 * 60 + au32Result[1] * 60 + au32Result[2];
		u32IntervalNum = u32IntervalMin	/ u32PeriodMin;
		u32IntervalSec = u32IntervalNum * u32PeriodMin * 60;
		QCSG_TimerAdd(pstRefTime,u32IntervalSec,pstLastTime);
	}
	if(u8PeriodUnit == 0)
	{
		//单位为分钟
		u32PeriodMin = u8PeriodValue;
		u32IntervalMin = au32Result[0] * 24 * 60 + au32Result[1] * 60 + au32Result[2];
		u32IntervalNum = u32IntervalMin	/ u32PeriodMin;
		u32IntervalSec = u32IntervalNum * u32PeriodMin * 60;
		QCSG_TimerAdd(pstRefTime,u32IntervalSec,pstLastTime);		
	}
}
/**--------------------------------------------------------------------
*功    能:ARD1数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD02Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD01_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,ARD01Struct* pstARD01Data)
{
	pstARD01Data->State = u8AlarmFlag;
	pstARD01Data->ReportState = 0;
	MemCopy(&pstARD01Data->Time,pstTime,sizeof(TIME_PARAM_S));
}
/**--------------------------------------------------------------------
*功    能:ARD2数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD02Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD02_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,QCSG_RAM_DATA_S* pstRam_Data,ARD02Struct* pstARD02Data)
{
	MemSet(pstARD02Data,0xFF,sizeof(ARD02Struct));//err20180911 ARD02结构提前清全F，防止无效位置出现错误数据
	pstARD02Data->State = u8AlarmFlag;
	pstARD02Data->ReportState = 0;
	MemCopy(&pstARD02Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD02Data->C_00010000[0],pstRam_Data->u8Data00010000,4);
	MemCopy(&pstARD02Data->C_00020000[0],pstRam_Data->u8Data00020000,4);
	MemCopy(&pstARD02Data->C_00030000[0],pstRam_Data->u8Data00030000,4);
	MemCopy(&pstARD02Data->C_00040000[0],pstRam_Data->u8Data00040000,4);	
	
	MemCopy(&pstARD02Data->C_0201FF00[0],&pstRam_Data->u8Data0201FF00,6);		
	MemCopy(&pstARD02Data->C_0202FF00[0],&pstRam_Data->u8Data0202FF00,9);	
	MemCopy(&pstARD02Data->C_0203FF00[0],&pstRam_Data->u8Data0203FF00,12);
	MemCopy(&pstARD02Data->C_0204FF00[0],&pstRam_Data->u8Data0204FF00,12);
	MemCopy(&pstARD02Data->C_0206FF00[0],&pstRam_Data->u8Data0206FF00,8);
}
/**--------------------------------------------------------------------
*功    能:ARD3数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD02Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD03_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,u32* u32LastValue,u32* u32CurrValue,QCSG_RAM_DATA_S* pstRam_Data,ARD03Struct* pstARD03Data)
{

	MemSet(pstARD03Data,0xFF,sizeof(ARD03Struct));//err20180911 ARD03结构提前清全F，防止无效位置出现错误数据。
	pstARD03Data->State = u8AlarmFlag;
	pstARD03Data->ReportState = 0;
	MemCopy(&pstARD03Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD03Data->B_00010000[0],&u32LastValue[0],4);
	MemCopy(&pstARD03Data->B_00020000[0],&u32LastValue[1],4);
	MemCopy(&pstARD03Data->B_00030000[0],pstRam_Data->u8Data00030000,4);
	MemCopy(&pstARD03Data->B_00040000[0],pstRam_Data->u8Data00040000,4);
	MemCopy(&pstARD03Data->B_0201FF00[0],pstRam_Data->u8Data0201FF00,6);
	MemCopy(&pstARD03Data->B_0202FF00[0],pstRam_Data->u8Data0202FF00,9);	
	MemCopy(&pstARD03Data->B_0203FF00[0],pstRam_Data->u8Data0203FF00,12);
	MemCopy(&pstARD03Data->B_0204FF00[0],pstRam_Data->u8Data0204FF00,12);	
	
	MemCopy(&pstARD03Data->A_00010000[0],&u32CurrValue[0],4);
	MemCopy(&pstARD03Data->A_00020000[0],&u32CurrValue[1],4);
	MemCopy(&pstARD03Data->A_00030000[0],pstRam_Data->u8Data00030000,4);
	MemCopy(&pstARD03Data->A_00040000[0],pstRam_Data->u8Data00040000,4);
	MemCopy(&pstARD03Data->A_0201FF00[0],pstRam_Data->u8Data0201FF00,6);
	MemCopy(&pstARD03Data->A_0202FF00[0],pstRam_Data->u8Data0202FF00,9);	
	MemCopy(&pstARD03Data->A_0203FF00[0],pstRam_Data->u8Data0203FF00,12);
	MemCopy(&pstARD03Data->A_0204FF00[0],pstRam_Data->u8Data0204FF00,12);		
}
/**--------------------------------------------------------------------
*功    能:ARD4数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD04Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD04_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,u32* pu32Value,QCSG_RAM_DATA_S* pstRam_Data,ARD04Struct* pstARD04Data)
{
	u8 temp[4];
	pstARD04Data->State = u8AlarmFlag;
	pstARD04Data->ReportState = 0;
	
	MemCopy(&pstARD04Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD04Data->C_00010000[0],pstRam_Data->u8Data00010000,4);
	MemCopy(&pstARD04Data->C_00020000[0],pstRam_Data->u8Data00020000,4);
	MemCopy(&pstARD04Data->C_00030000[0],pstRam_Data->u8Data00030000,4);
	MemCopy(&pstARD04Data->C_00040000[0],pstRam_Data->u8Data00040000,4);
	
	//MemCopy(&pstARD04Data->C_E1000008[0],pu32Value,sizeof(pstARD04Data->C_E1000008));//err201080911 填充剩余金额
	MemCopy(temp,pu32Value,sizeof(pstARD04Data->C_E1000008));
	pstARD04Data->C_E1000008[0]=temp[1];
	pstARD04Data->C_E1000008[1]=temp[2];
	pstARD04Data->C_E1000008[2]=temp[3];
	pstARD04Data->C_E1000008[3]=0;
	
}
/**--------------------------------------------------------------------
*功    能:ARD5数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD04Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD05_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,u16* pu16Value,QCSG_RAM_DATA_S* pstRam_Data,ARD05Struct* pstARD05Data)
{
	pstARD05Data->State = u8AlarmFlag;
	pstARD05Data->ReportState = 0;
	MemCopy(&pstARD05Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD05Data->B_00010000[0],pstRam_Data->u8Data00010000,4);
	MemCopy(&pstARD05Data->B_00020000[0],pstRam_Data->u8Data00020000,4);
	MemCopy(&pstARD05Data->B_00030000[0],pstRam_Data->u8Data00030000,4);
	MemCopy(&pstARD05Data->B_00040000[0],pstRam_Data->u8Data00040000,4);
	MemCopy(&pstARD05Data->B_E080000C,(u8*)&pu16Value[0],2);
	MemCopy(&pstARD05Data->B_E080000D,(u8*)&pu16Value[1],2);
	MemCopy(&pstARD05Data->A_E080000C,(u8*)&pu16Value[2],2);
	MemCopy(&pstARD05Data->A_E080000D,(u8*)&pu16Value[3],2);
}
/**--------------------------------------------------------------------
*功    能:ARD6数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD04Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD06_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,u32* pu32Value,QCSG_RAM_DATA_S* pstRam_Data,ARD06Struct* pstARD06Data)
{
	pstARD06Data->State = u8AlarmFlag;
	pstARD06Data->ReportState = 0;
	MemCopy(&pstARD06Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD06Data->B_00010000[0],pstRam_Data->u8Data00010000,4);
	MemCopy(&pstARD06Data->B_00020000[0],pstRam_Data->u8Data00020000,4);
	MemCopy(&pstARD06Data->B_00030000[0],pstRam_Data->u8Data00030000,4);
	MemCopy(&pstARD06Data->B_00040000[0],pstRam_Data->u8Data00040000,4);
	MemCopy(&pstARD06Data->B_E1000003,&pu32Value[0],3);
	MemCopy(&pstARD06Data->B_E1000004,&pu32Value[1],3);
	MemCopy(&pstARD06Data->A_E1000003,&pu32Value[2],3);
	MemCopy(&pstARD06Data->A_E1000004,&pu32Value[3],3);
}
/**--------------------------------------------------------------------
*功    能:ARD7数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD04Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD07_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,QCSG_RAM_DATA_S* pstRam_Data,ARD07Struct* pstARD07Data)
{
	pstARD07Data->State = u8AlarmFlag;
	pstARD07Data->ReportState = 0;
	MemCopy(&pstARD07Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD07Data->B_00010000[0],pstRam_Data->u8Data00010000,4);
	MemCopy(&pstARD07Data->B_00020000[0],pstRam_Data->u8Data00020000,4);
	MemCopy(&pstARD07Data->B_00030000[0],pstRam_Data->u8Data00030000,4);
	MemCopy(&pstARD07Data->B_00040000[0],pstRam_Data->u8Data00040000,4);
	MemCopy(&pstARD07Data->B_01010000[0],pstRam_Data->u8Data01010000,8);	
	MemCopy(&pstARD07Data->B_01020000[0],pstRam_Data->u8Data01020000,8);	
	MemCopy(&pstARD07Data->B_01030000[0],pstRam_Data->u8Data01030000,8);
	MemCopy(&pstARD07Data->B_01040000[0],pstRam_Data->u8Data01040000,8);
}
/**--------------------------------------------------------------------
*功    能:ARD7数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD04Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD11_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime, u8* pu8Data03300X00, u32* pu32Value, QCSG_RAM_DATA_S* pstRam_Data,ARD11Struct* pstARD11Data)
{
	pstARD11Data->State = u8AlarmFlag;
	pstARD11Data->ReportState = 0;
	MemCopy(&pstARD11Data->Time,pstTime,sizeof(TIME_PARAM_S));
	
