gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	MemCopy(&pstARD11Data->C_03300X00[0],pu8Data03300X00,3);//err20180925 添加端钮盖与表盖打开次数在上报告警数据
	
	//err20180925 添加开盖告警的发生前数据 
	MemCopy(&pstARD11Data->B_00010000[0],&pu32Value[0],4);
	MemCopy(&pstARD11Data->B_00020000[0],&pu32Value[1],4);
	MemCopy(&pstARD11Data->B_00050000[0],&pu32Value[2],4);	
	MemCopy(&pstARD11Data->B_00060000[0],&pu32Value[3],4);	
	MemCopy(&pstARD11Data->B_00070000[0],&pu32Value[4],4);
	MemCopy(&pstARD11Data->B_00080000[0],&pu32Value[5],4);

	//err20180925 添加发生后数据
	MemCopy(&pstARD11Data->A_00010000[0],pstRam_Data->u8Data00010000,4);
	MemCopy(&pstARD11Data->A_00020000[0],pstRam_Data->u8Data00020000,4);
	MemCopy(&pstARD11Data->A_00050000[0],pstRam_Data->u8Data00050000,4);	
	MemCopy(&pstARD11Data->A_00060000[0],pstRam_Data->u8Data00060000,4);	
	MemCopy(&pstARD11Data->A_00070000[0],pstRam_Data->u8Data00070000,4);
	MemCopy(&pstARD11Data->A_00080000[0],pstRam_Data->u8Data00080000,4);
}
/**--------------------------------------------------------------------
*功    能:ARD13数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD04Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD13_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,u8* pu8Data04000101,u8* pu8Data04000102,ARD13Struct* pstARD13Data)
{
	pstARD13Data->State = u8AlarmFlag;
	pstARD13Data->ReportState = 0;
	MemCopy(&pstARD13Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD13Data->C_04000101,pu8Data04000101,4);
	MemCopy(&pstARD13Data->C_04000102,pu8Data04000102,3);
	MemCopy(&pstARD13Data->C_E0000130,pstTime,6);
}
/**--------------------------------------------------------------------
*功    能:ARD14数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD04Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD14_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,ARD14Struct* pstARD14Data)
{
	MemSet(pstARD14Data,0xFF,sizeof(ARD14Struct));
	MemCopy(&pstARD14Data->Time,pstTime,sizeof(TIME_PARAM_S));
	pstARD14Data->State = u8AlarmFlag;
	pstARD14Data->ReportState = 0;
}
/**--------------------------------------------------------------------
*功    能:ARD18数据填充
*输入参数:u8AlarmFlag：事件产生标识，pstTime：时间，pstRam_Data：RAM中的数据
*输出参数:pstARD02Data：输出ARD2结构
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ARD18_Data(u8 u8AlarmFlag,TIME_PARAM_S* pstTime,u8* pu8Data03300000,ARD18Struct* pstARD18Data)
{
	pstARD18Data->State = u8AlarmFlag;
	pstARD18Data->ReportState = 0;
	MemCopy(&pstARD18Data->Time,pstTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstARD18Data->C_03300000[0],pu8Data03300000,3);
}
/**--------------------------------------------------------------------
*功    能:ERD3数据填充
*输入参数:pstEvent_Info
*输出参数:pstERD3Data
*返    回:无
--------------------------------------------------------------------**/
void RD_Write_ERD3_Data(QCSG_EVENT_ERD3_INFO_S* pstEvent_Info,ERD03Struct* pstERD3Data)
{
	u32 u32StartData = 0,u32EndData = 0,u32Data = 0;
	
	MemCopy(&pstERD3Data->StartTime,&pstEvent_Info->stStartTime,sizeof(TIME_PARAM_S));
	MemCopy(&pstERD3Data->EndTime,&pstEvent_Info->stEndTime,sizeof(TIME_PARAM_S));
	
	MemCopy(&u32StartData,pstEvent_Info->u8Start00010000,4);
	u32StartData = QCSG_BCD2HEX((u8)(u32StartData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32StartData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32StartData>>8)) * 100 + QCSG_BCD2HEX((u8)u32StartData);
	MemCopy(&u32EndData,pstEvent_Info->u8End00010000,4);
	u32EndData = QCSG_BCD2HEX((u8)(u32EndData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32EndData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32EndData>>8)) * 100 + QCSG_BCD2HEX((u8)u32EndData);
	if(u32EndData >=  u32StartData)
	{
		u32Data = u32EndData - u32StartData;
	}
	else
	{
		u32Data = 0;
	}
	u32Data = hex_bcd(u32Data);
	MemCopy(pstERD3Data->C_00010000,(u8*)&u32Data,4);
	
	MemCopy(&u32StartData,pstEvent_Info->u8Start00020000,4);
	u32StartData = QCSG_BCD2HEX((u8)(u32StartData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32StartData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32StartData>>8)) * 100 + QCSG_BCD2HEX((u8)u32StartData);
	MemCopy(&u32EndData,pstEvent_Info->u8End00020000,4);
	u32EndData = QCSG_BCD2HEX((u8)(u32EndData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32EndData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32EndData>>8)) * 100 + QCSG_BCD2HEX((u8)u32EndData);
	if(u32EndData >=  u32StartData)
	{
		u32Data = u32EndData - u32StartData;
	}
	else
	{
		u32Data = 0;
	}
	u32Data = hex_bcd(u32Data);
	MemCopy(pstERD3Data->C_00020000,(u8*)&u32Data,4);
	
	MemCopy(&u32StartData,pstEvent_Info->u8Start00030000,4);
	u32StartData = QCSG_BCD2HEX((u8)(u32StartData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32StartData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32StartData>>8)) * 100 + QCSG_BCD2HEX((u8)u32StartData);
	MemCopy(&u32EndData,pstEvent_Info->u8End00030000,4);
	u32EndData = QCSG_BCD2HEX((u8)(u32EndData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32EndData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32EndData>>8)) * 100 + QCSG_BCD2HEX((u8)u32EndData);
	if(u32EndData >=  u32StartData)
	{
		u32Data = u32EndData - u32StartData;
	}
	else
	{
		u32Data = 0;
	}
	u32Data = hex_bcd(u32Data);
	MemCopy(pstERD3Data->C_00030000,(u8*)&u32Data,4);

	MemCopy(&u32StartData,pstEvent_Info->u8Start00040000,4);
	u32StartData = QCSG_BCD2HEX((u8)(u32StartData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32StartData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32StartData>>8)) * 100 + QCSG_BCD2HEX((u8)u32StartData);
	MemCopy(&u32EndData,pstEvent_Info->u8End00040000,4);
	u32EndData = QCSG_BCD2HEX((u8)(u32EndData>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32EndData>>16)) * 10000 
				 + QCSG_BCD2HEX((u8)(u32EndData>>8)) * 100 + QCSG_BCD2HEX((u8)u32EndData);
	if(u32EndData >=  u32StartData)
	{
		u32Data = u32EndData - u32StartData;
	}
	else
	{
		u32Data = 0;
	}
	u32Data = hex_bcd(u32Data);
	MemCopy(pstERD3Data->C_00040000,(u8*)&u32Data,4);	
}
/**--------------------------------------------------------------------
*功    能:电压不平衡度计算，对称分量法计算
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:不平衡度
--------------------------------------------------------------------**/
float RD_Vol_UnbalanceCalc(float fUa,float fUb,float fUc,float fPha,float fPhb,float fPhc)
{
	float freal1,freal2,freal3;        
	float fimag1,fimag2,fimag3;
	float fA0 = 0.0,fA1 = 0.0,fA2 = 0.0;
	float fPI = 3.1415926536;
	float fe = 0.0;
	float fe0 = 0.0;

	fPha = fPha * fPI / 180;
	fPhb = fPhb * fPI / 180;
	fPhc = fPhc * fPI / 180;
	freal2  = fUa * QCSG_COS(fPha) + fUb * QCSG_COS(fPhb + fPI * 2/3) + fUc * QCSG_COS(fPhc + fPI * 4/3);
	fimag2  = fUa * QCSG_SIN(fPha) + fUb * QCSG_SIN(fPhb + fPI * 2/3) + fUc * QCSG_SIN(fPhc + fPI * 4/3);
	freal1  = fUa * QCSG_COS(fPha) + fUb * QCSG_COS(fPhb + fPI * 4/3) + fUc * QCSG_COS(fPhc + fPI * 2/3);
	fimag1  = fUa * QCSG_SIN(fPha) + fUb * QCSG_SIN(fPhb + fPI * 4/3) + fUc * QCSG_SIN(fPhc + fPI * 2/3);
	freal3  = fUa * QCSG_COS(fPha) + fUb * QCSG_COS(fPhb) + fUc * QCSG_COS(fPhc);
	fimag3  = fUa * QCSG_SIN(fPha) + fUb * QCSG_SIN(fPhb) + fUc * QCSG_SIN(fPhc);
	fA1 = QCSG_SQRT((freal1 * freal1) + (fimag1 * fimag1)) / 3.0;
	fA2 = QCSG_SQRT((freal2 * freal2) + (fimag2 * fimag2)) / 3.0;
	fA0 = QCSG_SQRT((freal3 * freal3) + (fimag3 * fimag3)) / 3.0;
	
	if(fA1 > 0.00000001)
	{
		if(fA2 < 0.00000001)
		{
			fe = 0.0;
		}
		else
		{
			fe = (fA2 / fA1)*100;
		}
		if(fA0 < 0.00000001)
		{
			fe0 = 0.0;
		}
		else
		{
			fe0 = (fA0 / fA1) * 100;
		}
	}
	else
	{
		fe = 99.9;
		fe0 = 99.9;
	}
	if(fe > 99.9)
	{
		fe = 99.9;
	}
	if(fe0 > 99.9)
	{
		fe0 = 99.9;
	}
	return fe;		
}

/**--------------------------------------------------------------------
*功    能:事件记录处理，电压逆相序,ARD2
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000003(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	* TODO:告警处理机制：
	* 此函数挂在0x14000100、0x04000507数据标识下，如果次数发生变化，则再根据电表运行状态字逆相序标识，判断事件是否发生；
	* 如果告警已经发生过，则根据电能表运行状态字事件标识是否存在，判断恢复。
	* 注意，事件gc_stQCSGAlarm_DLT645_Table表格中，两个数据标识的顺序不可调整！！！
	*/
	QCSG_ALARM_E2000003_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000003_LIST_S*)QCSG_ALARM_E2000003_LIST;
	QCSG_ALARM_E2000003_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	RealTimeYYStruct stYYTime;
	ARD02Struct stARD02Data;
	u8 u8PnNum = 0,i = 0,j = 0;
	u32 u32Ident = 0,u32MaxOccurTick = 0,u32MaxRestoreTick = 0,u32CurrTick = 0,u32ReadLen = 0;
	
