gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(QCSG_CheckAlarmConfig(0xE2000003) != TRUE)
	{
		return;
	}
	if(u16Pn != 0)
	{
		//电压逆相序为终端事件
		return;
	}
	//读取持续时间
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE0000184,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		u32MaxOccurTick = 15 * 60 * 100;
		u32MaxRestoreTick = 15 * 60 * 100;
	}
	else
	{
		if(QCSG_BCDCheck(&stThresholdPara.E0000184,1) != TRUE)
		{
			u32MaxOccurTick = 15 * 60 * 100;
		}
		else
		{
		#if (TEST_ON == 1)
			u32MaxOccurTick = QCSG_BCD2HEX(stThresholdPara.E0000184) * 60 * 100 - 3000;
		#else
			u32MaxOccurTick = QCSG_BCD2HEX(stThresholdPara.E0000184) * 60 * 100;
		#endif
		}
		if(QCSG_BCDCheck(&stThresholdPara.E0000185,1) != TRUE)
		{
			u32MaxRestoreTick = 15 * 60 * 100;
		}
		else
		{
			u32MaxRestoreTick = QCSG_BCD2HEX(stThresholdPara.E0000185) * 60 * 100;
		}

	}
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000003_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000003Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000003_LIST_S));		
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(j = 0;j < u8PnNum;j++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[j].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[j];
			break;
		}
	}	
	if(j >= u8PnNum)
	{
		return;
	}	
	u8PnNum = pstAlarm_List->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000003Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000003Data[i];
			break;
		}
	}
	MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);
	u32CurrTick = HAL_GetSystemTick();
	if(u32Ident == 0x04000507)
	{
		if(i >= u8PnNum)
		{
			//测量点之前未有记录，则添加到记录中,此次不做任何处理
			if(u8PnNum < MAX_PN_NUM2)
			{
				pstAlarm_Info = &pstAlarm_List->stE2000003Data[u8PnNum];
				pstAlarm_Info->u16Pn = u16Pn;
				MemCopy(pstAlarm_Info->u8Data04000507,&pstDlt645Frame_Info->u8RevBuf[14],2);
				MemSet(pstAlarm_Info->u8Data14000001,0xFF,3);
				pstAlarm_Info->u8AlarmFlag = 0xFF;
				pstAlarm_Info->u8OccurStep = ALARM_END;
				pstAlarm_Info->u8RestoreStep = ALARM_END;
				pstAlarm_Info->u32OccurTick = u32CurrTick;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
				pstAlarm_List->u8PnNum ++;
			}
			return;
		}
		MemCopy(pstAlarm_Info->u8Data04000507,&pstDlt645Frame_Info->u8RevBuf[14],2);
		if((pstAlarm_Info->u8Data04000507[0] & 0x01) == 0)
		{
			//未有电压逆相序状态，则判断是否需要产生恢复事件
			if(pstAlarm_Info->u8AlarmFlag == 1)
			{
				//当前事件处于发生状态
				if(pstAlarm_Info->u8RestoreStep == ALARM_END)
				{
					pstAlarm_Info->u8RestoreStep = ALARM_START;
					pstAlarm_Info->u32RestoreTick = u32CurrTick;
				}
				if((u32CurrTick - pstAlarm_Info->u32RestoreTick) >= u32MaxRestoreTick)
				{
					//产生恢复事件
					MemSet(&stYYTime,0,sizeof(stYYTime));
					RD_Time_TO_YYTime(pstTime,&stYYTime);
					RD_Write_ARD02_Data(0,pstTime,pstRam_Data,&stARD02Data);
					u32ReadLen = sizeof(stARD02Data);
					NAND_WriteAlarmRecord(pu8MeterId,0xE2000003,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
					TerminalSetLastAlarmDI(0xE2000003);
					if(QCSG_CheckAlarmReport(0xE2000003) == TRUE)
					{
						TerminalReportAlarmInc();
					}					
					pstAlarm_Info->u8RestoreStep = ALARM_END;
					pstAlarm_Info->u32RestoreTick = u32CurrTick;
					pstAlarm_Info->u8AlarmFlag = 0xFF;						
				}
			}
		}
		else
		{
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;	
		}
	}
	if(u32Ident == 0x14000001)
	{
		if(pstAlarm_Info->u8Data14000001[0] == 0xFF)
		{
			//第一次抄读到数据
			MemCopy(pstAlarm_Info->u8Data14000001,&pstDlt645Frame_Info->u8RevBuf[14],3);
			return;
		}
		if(memcmp(pstAlarm_Info->u8Data14000001,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
		{
			//两次抄读逆相序次数不一致，准备产生发生事件
			pstAlarm_Info->u8OccurStep = ALARM_START;
			pstAlarm_Info->u32OccurTick = u32CurrTick;				
		}
		if((pstAlarm_Info->u8OccurStep == ALARM_START)&&((pstAlarm_Info->u8Data04000507[0] & 0x01) == 1))
		{
			if((u32CurrTick - pstAlarm_Info->u32OccurTick) >= u32MaxOccurTick)
			{
				//产生发生事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD02_Data(1,pstTime,pstRam_Data,&stARD02Data);
				u32ReadLen = sizeof(stARD02Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000003,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000003);
				if(QCSG_CheckAlarmReport(0xE2000003) == TRUE)
				{
					TerminalReportAlarmInc();
				}
				pstAlarm_Info->u8OccurStep = ALARM_END;
				pstAlarm_Info->u8AlarmFlag = 1;
			}
		}
		else
		{
			pstAlarm_Info->u8OccurStep = ALARM_END;
		}
		MemCopy(pstAlarm_Info->u8Data14000001,&pstDlt645Frame_Info->u8RevBuf[14],3);
	}
	return;
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，电流不平衡,ARD2
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000004(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取电流数据块0x0202FF00中
	 */
	QCSG_ALARM_E2000004_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000004_LIST_S*)QCSG_ALARM_E2000004_LIST;
	QCSG_ALARM_E2000004_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
	RealTimeYYStruct stYYTime;
	ARD02Struct stARD02Data;	
	u8 u8PnNum = 0,u8Meterphase = 0x04,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0,u16CurrValue = 0;
	u32 u32MaxOccurTick = 0,u32MaxRestoreTick = 0,u32CurrTick = 0,u32ReadLen = 0;
	u32 u32Ia = 0,u32Ib = 0,u32Ic = 0,u32In = 0,u32Iaver = 0,u32Isub = 0,u32Ipmax = 0,u32Ipmin = 0;
	
	if(QCSG_CheckAlarmConfig(0xE2000004) != TRUE)
	{
		return;
	}
	if(u16Pn != 0)
	{
		//电流不平衡为终端事件
		return;
	}
	u32CurrTick = HAL_GetSystemTick();	
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000004_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000004Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}	
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000004_LIST_S));		
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000004Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000004Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000004Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) != TRUE)
	{
		return;
	}
	//读取持续时间
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE0000180,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		u32MaxOccurTick = 15 * 60 * 100;
		u32MaxRestoreTick = 15 * 60 * 100;
	}
	else
	{
		if(QCSG_BCDCheck(&stThresholdPara.E0000180,1) != TRUE)
		{
			u32MaxOccurTick = 15 * 60 * 100;
		}
		else
		{
			u32MaxOccurTick = QCSG_BCD2HEX(stThresholdPara.E0000180) * 60 * 100;			
		}
		if(QCSG_BCDCheck(&stThresholdPara.E0000181,1) != TRUE)
		{
			u32MaxRestoreTick = 15 * 60 * 100;	
		}
		else
		{			
			u32MaxRestoreTick = QCSG_BCD2HEX(stThresholdPara.E0000181) * 60 * 100;
		}
	}
	//读取测量点接线方式、读取额定电流
	u32ReadLen = sizeof(MeasurePointStruct);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800010,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u8Meterphase = 0x04;
		u32In = JC_IN;
	}
	else
	{
		u8Meterphase = stPnPara.ConnectionType;
		if(u8Meterphase > 0x04)
		{
			u8Meterphase = 0x04;
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
		{
			u32In = JC_IN;	
		}
		else
		{
			u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);	
		}
	}
	//读取越限阀值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE0800100,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		if(u8Meterphase != 0x04)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x30) * 100;
			u16LowLimitValue = QCSG_BCD2HEX(0x25) * 100;
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x50) * 100;
			u16LowLimitValue = QCSG_BCD2HEX(0x40) * 100;
		}
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800100,2) != TRUE)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x50) * 100;
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800100>>8)) * 100 + QCSG_BCD2HEX((u8)u16UpLimitValue);
		}
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800101,2) != TRUE)
		{
			u16LowLimitValue = QCSG_BCD2HEX(0x40) * 100;
		}
		else
		{
			u16LowLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800101>>8)) * 100 + QCSG_BCD2HEX((u8)u16LowLimitValue);	
		}
	}
	MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
	MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
	MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
	u32Ia = u32Ia & 0x007FFFFF;
	u32Ib = u32Ib & 0x007FFFFF;
	u32Ic = u32Ic & 0x007FFFFF;
	u32Ia = QCSG_BCD2HEX((u8)(u32Ia>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ia>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ia);
	u32Ib = QCSG_BCD2HEX((u8)(u32Ib>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ib>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ib);
	u32Ic = QCSG_BCD2HEX((u8)(u32Ic>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ic>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ic);

//计算出电流最大的那一相
	u32Ipmax = u32Ia;
	if(u8Meterphase == 0x04)
	{
		if(u32Ib > u32Ipmax)
		{
			u32Ipmax = u32Ib;
		}
	}
	if(u32Ic > u32Ipmax)
	{
		u32Ipmax = u32Ic;
	}

//计算出电流最小的那一相

	u32Ipmin = u32Ia;
	if(u8Meterphase == 0x04)
	{
		if(u32Ipmin > u32Ib)
		{
			u32Ipmin = u32Ib;
		}
	}
	if(u32Ipmin > u32Ic)
	{
		u32Ipmin = u32Ic;
	}	


//计算三相电流平均值	
	if(u8Meterphase == 0x04)
	{
		u32Iaver = (u32Ia + u32Ib + u32Ic)/3;
	}
	else
	{
		u32Iaver = (u32Ia + u32Ic)/2;
	}

	
	if((u32Iaver - u32Ipmin) >= (u32Ipmax - u32Iaver))
	{
		u32Isub = u32Iaver - u32Ipmin;
	}
	else
	{
		u32Isub = u32Ipmax - u32Iaver;
	}
	if((u32Iaver * 100) < (20 * u32In))
	{
		return ;
	}
	if(u32Iaver == 0)
	{
		return ;
	}
	u16CurrValue = (u32Isub * 10000)/u32Iaver;
	if(pstAlarm_Info->u8AlarmFlag == 0xFF)
	{
		//无任何事件产生的时候只判断事件是否发生
		if(u16CurrValue > u16UpLimitValue)
		{
			//不平衡度大于上限，准备产生事件
			if(pstAlarm_Info->u8OccurStep != ALARM_START)
			{
				pstAlarm_Info->u8OccurStep = ALARM_START;
				pstAlarm_Info->u32OccurTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32OccurTick) >= u32MaxOccurTick)
			{
				//产生发生事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD02_Data(1,pstTime,pstRam_Data,&stARD02Data);
				u32ReadLen = sizeof(stARD02Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000004,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000004);
				if(QCSG_CheckAlarmReport(0xE2000004) == TRUE)
				{
					TerminalReportAlarmInc();
				}				
				pstAlarm_Info->u8OccurStep = ALARM_END;
				pstAlarm_Info->u8AlarmFlag = 1;
			}
		}
		else
		{
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;	
			pstAlarm_Info->u8AlarmFlag = 0xFF;					
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 1)
	{
		if(u16CurrValue < u16LowLimitValue)
		{
			//不平衡度小于下限，准备产生恢复事件
			if(pstAlarm_Info->u8RestoreStep != ALARM_START)
			{
				pstAlarm_Info->u8RestoreStep = ALARM_START;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32RestoreTick) >= u32MaxRestoreTick)
			{
				//产生恢复事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD02_Data(0,pstTime,pstRam_Data,&stARD02Data);
				u32ReadLen = sizeof(stARD02Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000004,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000004);
				if(QCSG_CheckAlarmReport(0xE2000004) == TRUE)
				{
					TerminalReportAlarmInc();
				}				
				pstAlarm_Info->u8RestoreStep = ALARM_END;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
				pstAlarm_Info->u8AlarmFlag = 0xFF;						
			}
		}
		else
		{
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;				
		}
	}	
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，电压不平衡,ARD2
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000005(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:对称分量法，函数挂在读取电流数据块0x0201FF00中
	 */
	QCSG_ALARM_E2000005_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000005_LIST_S*)QCSG_ALARM_E2000005_LIST;
	QCSG_ALARM_E2000005_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
	RealTimeYYStruct stYYTime;
	ARD02Struct stARD02Data;	
	u8 u8PnNum = 0,u8Meterphase = 0x04,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0;
	u16 u16Ua = 0,u16Ub = 0,u16Uc = 0,u16Pha = 0,u16Phb = 0,u16Phc = 0;	
	u32 u32MaxOccurTick = 0,u32MaxRestoreTick = 0,u32CurrTick = 0,u32ReadLen = 0;
	float fUa = 0.0,fUb = 0.0,fUc = 0.0,fPha = 0.0,fPhb = 0.0,fPhc = 0.0,fUpLimitValue = 0.0,fLowLimitValue = 0.0,fCurrValue = 0.0;
	
	if(QCSG_CheckAlarmConfig(0xE2000005) != TRUE)
	{
		return;
	}

	if(u16Pn != 0)
	{
		//电压不平衡为终端事件
		return;
	}
	u32CurrTick = HAL_GetSystemTick();	
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000005_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000005Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}	
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000005_LIST_S));		
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000005Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000005Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000005Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],6) != TRUE)
	{
		return;
	}
	if(QCSG_BCDCheck(pstRam_Data->u8Data0207FF00,6) != TRUE)
	{
		return;
	}
	MemCopy(&u16Ua,&pstDlt645Frame_Info->u8RevBuf[14],2);
	MemCopy(&u16Ub,&pstDlt645Frame_Info->u8RevBuf[16],2);
	MemCopy(&u16Uc,&pstDlt645Frame_Info->u8RevBuf[18],2);
	MemCopy(&u16Pha,(u8*)ADDR_ANGLE_UA,2);
	MemCopy(&u16Phb,(u8*)ADDR_ANGLE_UB,2);
	MemCopy(&u16Phc,(u8*)ADDR_ANGLE_UC,2);
	u16Ua = QCSG_BCD2HEX((u8)(u16Ua>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ua);
	u16Ub = QCSG_BCD2HEX((u8)(u16Ub>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ub);
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	u16Pha = QCSG_BCD2HEX((u8)(u16Pha>>8)) * 100 + QCSG_BCD2HEX((u8)u16Pha);
	u16Phb = QCSG_BCD2HEX((u8)(u16Phb>>8)) * 100 + QCSG_BCD2HEX((u8)u16Phb);
	u16Phc = QCSG_BCD2HEX((u8)(u16Phc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Phc);
	if((u16Pha == 0)&&(u16Phb == 0)&&(u16Phc == 0))
	{
		return;
	}
	fUa = u16Ua;
	fUa /= 10;
	
