gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if((QCSG_CheckAlarmConfig(0xE2000023) != TRUE))
	{
		return;
	}
	if(u16Pn != 0)
	{
		return;
	}
	u32CurrTick = HAL_GetSystemTick();
	u8PnNum = pstAlarm_List->u8PnNum;	
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000023_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000023Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000023_LIST_S));		
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000023Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000023Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000023Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	//读取测量点接线方式、额定电压、额定电流
	u32ReadLen = sizeof(MeasurePointStruct);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800010,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u32In = JC_IN;
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
		{
			u32In = JC_IN;
		}
		else
		{
			u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);		
		}			
	}
	MemCopy(&u32Ia,&pstRam_Data->u8Data0202FF00[0],3);
	u32Ia &= 0x7FFFFF;
	u32Ia = QCSG_BCD2HEX((u8)(u32Ia>>16))* 10000 + QCSG_BCD2HEX((u8)(u32Ia>>8))* 100 + QCSG_BCD2HEX((u8)u32Ia);
	//测试零序电流偏大时，A相电流为1.6A时，会误报A相电流畸变，增加大电流不产生告警的补丁
	if(((u32Ia * 100) < (20 * u32In)) || (u32Ia > 1300))
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],2) != TRUE)
	{
		return;
	}
	MemCopy(&u16Value,&pstDlt645Frame_Info->u8RevBuf[14],2);
	u16Value = QCSG_BCD2HEX((u8)(u16Value>>8)) * 100 + QCSG_BCD2HEX((u8)u16Value);
	//读取持续时间	
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE0000180,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		u32MaxOccurTick = 15 * 60 * 100;
		u32MaxRestoreTick = 15 * 60 * 100;
	}
	else
	{
		if(QCSG_BCDCheck(&stThresholdPara.E0000180,1) != TRUE)
		{
			u32MaxOccurTick = 15 * 60 * 100;	
		}
		else
		{
			u32MaxOccurTick = QCSG_BCD2HEX(stThresholdPara.E0000180) * 60 * 100;			
		}
		if(QCSG_BCDCheck(&stThresholdPara.E0000181,1) != TRUE)
		{
			u32MaxRestoreTick = 15 * 60 * 100;		
		}
		else
		{
			u32MaxRestoreTick = QCSG_BCD2HEX(stThresholdPara.E0000181) * 60 * 100;			
		}	
	}
	//读取越限阀值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE0800201,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		u16UpLimitValue = QCSG_BCD2HEX(0x05) * 100;
		u16LowLimitValue = QCSG_BCD2HEX(0x03) * 100;
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800201,2) != TRUE)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x05) * 100;	
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800201>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800201);
		}
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800203,2) != TRUE)
		{
			u16LowLimitValue = QCSG_BCD2HEX(0x03) * 100;
		}
		else
		{
			u16LowLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800203>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800203);
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 0xFF)
	{
		//无任何事件产生的时候只判断事件是否发生
		if(u16Value > u16UpLimitValue)
		{
			if(pstAlarm_Info->u8OccurStep != ALARM_START)
			{
				pstAlarm_Info->u8OccurStep = ALARM_START;
				pstAlarm_Info->u32OccurTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32OccurTick) >= u32MaxOccurTick)
			{
				//产生发生事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD14_Data(1,pstTime,&stARD14Data);
				u32ReadLen = sizeof(stARD14Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000023,&stYYTime,(u8*)&stARD14Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000023);
				if(QCSG_CheckAlarmReport(0xE2000023) == TRUE)
				{
					TerminalReportAlarmInc();
				}								
				pstAlarm_Info->u8OccurStep = ALARM_END;
				pstAlarm_Info->u8AlarmFlag = 1;
			}
		}
		else
		{
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;	
			pstAlarm_Info->u8AlarmFlag = 0xFF;					
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 1)
	{
		if(u16Value < u16LowLimitValue)
		{
			if(pstAlarm_Info->u8RestoreStep != ALARM_START)
			{
				pstAlarm_Info->u8RestoreStep = ALARM_START;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32RestoreTick) >= u32MaxRestoreTick)
			{
				//产生恢复事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD14_Data(0,pstTime,&stARD14Data);
				u32ReadLen = sizeof(stARD14Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000023,&stYYTime,(u8*)&stARD14Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000023);
				if(QCSG_CheckAlarmReport(0xE2000023) == TRUE)
				{
					TerminalReportAlarmInc();
				}								
				pstAlarm_Info->u8RestoreStep = ALARM_END;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
				pstAlarm_Info->u8AlarmFlag = 0xFF;						
			}
		}
		else
		{
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;				
		}		
	}	
}
/**--------------------------------------------------------------------
*功    能:事件记录处理,B相电流畸变,ARD14
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000024(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取B相电流失真度0x02090200中
	 */
	QCSG_ALARM_E2000024_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000024_LIST_S*)QCSG_ALARM_E2000024_LIST;
	QCSG_ALARM_E2000024_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	PowerQualityParaStruct stPowerQualityPara;
	MeasurePointStruct stPnPara;
	RealTimeYYStruct stYYTime;
	ARD14Struct stARD14Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0,u16Value = 0;
	u32 u32MaxOccurTick = 0,u32MaxRestoreTick = 0,u32CurrTick = 0,u32ReadLen = 0,u32Ib = 0,u32In = 0;	

	if((QCSG_CheckAlarmConfig(0xE2000024) != TRUE))
	{
		return;
	}
	if(u16Pn != 0)
	{
		return;
	}
	u32CurrTick = HAL_GetSystemTick();
	u8PnNum = pstAlarm_List->u8PnNum;	
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000024_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000024Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000024_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000024Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000024Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000024Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	//读取测量点接线方式、额定电压、额定电流
	u32ReadLen = sizeof(MeasurePointStruct);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800010,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u32In = JC_IN;
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
		{
			u32In = JC_IN;
		}
		else
		{
			u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);		
		}			
	}
	MemCopy(&u32Ib,&pstRam_Data->u8Data0202FF00[3],3);
	u32Ib &= 0x7FFFFF;
	u32Ib = QCSG_BCD2HEX((u8)(u32Ib>>16))* 10000 + QCSG_BCD2HEX((u8)(u32Ib>>8))* 100 + QCSG_BCD2HEX((u8)u32Ib);		
	//测试零序电流偏大时，A相电流为1.6A时，会误报A相电流畸变，增加大电流不产生告警的补丁
	if(((u32Ib * 100) < (20 * u32In)) || (u32Ib > 1300))
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],2) != TRUE)
	{
		return;
	}
	MemCopy(&u16Value,&pstDlt645Frame_Info->u8RevBuf[14],2);
	u16Value = QCSG_BCD2HEX((u8)(u16Value>>8)) * 100 + QCSG_BCD2HEX((u8)u16Value);
	//读取持续时间	
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE0000180,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		u32MaxOccurTick = 15 * 60 * 100;
		u32MaxRestoreTick = 15 * 60 * 100;
	}
	else
	{
		if(QCSG_BCDCheck(&stThresholdPara.E0000180,1) != TRUE)
		{
			u32MaxOccurTick = 15 * 60 * 100;	
		}
		else
		{
			u32MaxOccurTick = QCSG_BCD2HEX(stThresholdPara.E0000180) * 60 * 100;			
		}
		if(QCSG_BCDCheck(&stThresholdPara.E0000181,1) != TRUE)
		{
			u32MaxRestoreTick = 15 * 60 * 100;		
		}
		else
		{
			u32MaxRestoreTick = QCSG_BCD2HEX(stThresholdPara.E0000181) * 60 * 100;			
		}	
	}
	//读取越限阀值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE0800201,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		u16UpLimitValue = QCSG_BCD2HEX(0x05) * 100;
		u16LowLimitValue = QCSG_BCD2HEX(0x03) * 100;
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800201,2) != TRUE)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x05) * 100;	
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800201>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800201);
		}
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800203,2) != TRUE)
		{
			u16LowLimitValue = QCSG_BCD2HEX(0x03) * 100;
		}
		else
		{
			u16LowLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800203>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800203);
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 0xFF)
	{
		//无任何事件产生的时候只判断事件是否发生
		if(u16Value > u16UpLimitValue)
		{
			if(pstAlarm_Info->u8OccurStep != ALARM_START)
			{
				pstAlarm_Info->u8OccurStep = ALARM_START;
				pstAlarm_Info->u32OccurTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32OccurTick) >= u32MaxOccurTick)
			{
				//产生发生事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD14_Data(1,pstTime,&stARD14Data);
				u32ReadLen = sizeof(stARD14Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000024,&stYYTime,(u8*)&stARD14Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000024);				
				if(QCSG_CheckAlarmReport(0xE2000024) == TRUE)
				{
					TerminalReportAlarmInc();
				}								
				pstAlarm_Info->u8OccurStep = ALARM_END;
				pstAlarm_Info->u8AlarmFlag = 1;
			}
		}
		else
		{
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;	
			pstAlarm_Info->u8AlarmFlag = 0xFF;					
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 1)
	{
		if(u16Value < u16LowLimitValue)
		{
			if(pstAlarm_Info->u8RestoreStep != ALARM_START)
			{
				pstAlarm_Info->u8RestoreStep = ALARM_START;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32RestoreTick) >= u32MaxRestoreTick)
			{
				//产生恢复事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD14_Data(0,pstTime,&stARD14Data);
				u32ReadLen = sizeof(stARD14Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000024,&stYYTime,(u8*)&stARD14Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000024);				
				if(QCSG_CheckAlarmReport(0xE2000024) == TRUE)
				{
					TerminalReportAlarmInc();
				}								
				pstAlarm_Info->u8RestoreStep = ALARM_END;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
				pstAlarm_Info->u8AlarmFlag = 0xFF;						
			}
		}
		else
		{
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;				
		}		
	}		
}
/**--------------------------------------------------------------------
*功    能:事件记录处理,C相电流畸变,ARD14
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000025(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取C相电流失真度0x02090300中
	 */
	QCSG_ALARM_E2000025_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000025_LIST_S*)QCSG_ALARM_E2000025_LIST;
	QCSG_ALARM_E2000025_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	PowerQualityParaStruct stPowerQualityPara;
	MeasurePointStruct stPnPara;
	RealTimeYYStruct stYYTime;
	ARD14Struct stARD14Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0,u16Value = 0;
	u32 u32MaxOccurTick = 0,u32MaxRestoreTick = 0,u32CurrTick = 0,u32ReadLen = 0,u32Ic = 0,u32In = 0;	

	if((QCSG_CheckAlarmConfig(0xE2000025) != TRUE))
	{
		return;
	}
	if(u16Pn != 0)
	{
		return;
	}
	u32CurrTick = HAL_GetSystemTick();
	u8PnNum = pstAlarm_List->u8PnNum;	
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000025_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000025Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000025_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000025Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000025Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000025Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	//读取测量点接线方式、额定电压、额定电流
	u32ReadLen = sizeof(MeasurePointStruct);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800010,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u32In = JC_IN;
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
		{
			u32In = JC_IN;
		}
		else
		{
			u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);		
		}			
	}
	MemCopy(&u32Ic,&pstRam_Data->u8Data0202FF00[6],3);
	u32Ic &= 0x7FFFFF;
	u32Ic = QCSG_BCD2HEX((u8)(u32Ic>>16))* 10000 + QCSG_BCD2HEX((u8)(u32Ic>>8))* 100 + QCSG_BCD2HEX((u8)u32Ic);		
	if(((u32Ic * 100) < (20 * u32In)) || (u32Ic > 1300))
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],2) != TRUE)
	{
		return;
	}
	MemCopy(&u16Value,&pstDlt645Frame_Info->u8RevBuf[14],2);
	u16Value = QCSG_BCD2HEX((u8)(u16Value>>8)) * 100 + QCSG_BCD2HEX((u8)u16Value);
	//读取持续时间	
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE0000180,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		u32MaxOccurTick = 15 * 60 * 100;
		u32MaxRestoreTick = 15 * 60 * 100;
	}
	else
	{
		if(QCSG_BCDCheck(&stThresholdPara.E0000180,1) != TRUE)
		{
			u32MaxOccurTick = 15 * 60 * 100;	
		}
		else
		{
			u32MaxOccurTick = QCSG_BCD2HEX(stThresholdPara.E0000180) * 60 * 100;			
		}
		if(QCSG_BCDCheck(&stThresholdPara.E0000181,1) != TRUE)
		{
			u32MaxRestoreTick = 15 * 60 * 100;		
		}
		else
		{
			u32MaxRestoreTick = QCSG_BCD2HEX(stThresholdPara.E0000181) * 60 * 100;			
		}	
	}
	//读取越限阀值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE0800201,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		u16UpLimitValue = QCSG_BCD2HEX(0x05) * 100;
		u16LowLimitValue = QCSG_BCD2HEX(0x03) * 100;
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800201,2) != TRUE)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x05) * 100;	
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800201>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800201);
		}
		if(QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800203,2) != TRUE)
		{
			u16LowLimitValue = QCSG_BCD2HEX(0x03) * 100;
		}
		else
		{
			u16LowLimitValue = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800203>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800203);
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 0xFF)
	{
		//无任何事件产生的时候只判断事件是否发生
		if(u16Value > u16UpLimitValue)
		{
			if(pstAlarm_Info->u8OccurStep != ALARM_START)
			{
				pstAlarm_Info->u8OccurStep = ALARM_START;
				pstAlarm_Info->u32OccurTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32OccurTick) >= u32MaxOccurTick)
			{
				//产生发生事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD14_Data(1,pstTime,&stARD14Data);
				u32ReadLen = sizeof(stARD14Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000025,&stYYTime,(u8*)&stARD14Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000025);
				if(QCSG_CheckAlarmReport(0xE2000025) == TRUE)
				{
					TerminalReportAlarmInc();
				}								
				pstAlarm_Info->u8OccurStep = ALARM_END;
				pstAlarm_Info->u8AlarmFlag = 1;
			}
		}
		else
		{
			pstAlarm_Info->u8OccurStep = ALARM_END;
			pstAlarm_Info->u32OccurTick = u32CurrTick;	
			pstAlarm_Info->u8AlarmFlag = 0xFF;					
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 1)
	{
		if(u16Value < u16LowLimitValue)
		{
			if(pstAlarm_Info->u8RestoreStep != ALARM_START)
			{
				pstAlarm_Info->u8RestoreStep = ALARM_START;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
			}
			if((u32CurrTick - pstAlarm_Info->u32RestoreTick) >= u32MaxRestoreTick)
			{
				//产生恢复事件
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD14_Data(0,pstTime,&stARD14Data);
				u32ReadLen = sizeof(stARD14Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000025,&stYYTime,(u8*)&stARD14Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000025);				
				if(QCSG_CheckAlarmReport(0xE2000025) == TRUE)
				{
					TerminalReportAlarmInc();
				}								
				pstAlarm_Info->u8RestoreStep = ALARM_END;
				pstAlarm_Info->u32RestoreTick = u32CurrTick;
				pstAlarm_Info->u8AlarmFlag = 0xFF;						
			}
		}
		else
		{
			pstAlarm_Info->u8RestoreStep = ALARM_END;
			pstAlarm_Info->u32RestoreTick = u32CurrTick;				
		}		
	}		
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，无功过补偿,ARD2
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000026(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取功率因数0x0206FF00中
	 */
	QCSG_ALARM_E2000026_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000026_LIST_S*)QCSG_ALARM_E2000026_LIST;
	QCSG_ALARM_E2000026_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
	RealTimeYYStruct stYYTime;
	ARD02Struct stARD02Data;		
	u8 u8PnNum = 0,u8Meterphase = 0x04,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0;
	u32 u32MaxOccurTick = 0,u32MaxRestoreTick = 0,u32CurrTick = 0,u32ReadLen = 0;
	u32 u32Ia = 0,u32Ib = 0,u32Ic = 0, u32In= 0,u32Iaver = 0;
	u32 u32Pkw = 0,u32Pkvar = 0,u32Pfactor = 0;
	
