gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200002B) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],4) != TRUE)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200002B_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE200002BData[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200002B_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200002BData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002BData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002BData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE000018B,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		stThresholdPara.E000018B = 0x2000;
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stThresholdPara.E000018B,2) != TRUE)
		{
			stThresholdPara.E000018B = 0x2000;
		}
	}
	MemCopy(&u32Value,&pstDlt645Frame_Info->u8RevBuf[14],4);
	if(pstAlarm_Info->u8AlarmFlag == 0xFF)
	{
		if(u32Value < stThresholdPara.E000018B)
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD04_Data(1,pstTime,&u32Value,pstRam_Data,&stARD04Data);//err201080911 填充剩余金额
			u32ReadLen = sizeof(stARD04Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE200002B,&stYYTime,(u8*)&stARD04Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE200002B);
			if(QCSG_CheckAlarmReport(0xE200002B) == TRUE)
			{
				TerminalReportAlarmInc();
			}
			pstAlarm_Info->u8AlarmFlag = 1;			
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 0x01)
	{
		if(u32Value > stThresholdPara.E000018B)
		{
			//产生恢复事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD04_Data(0,pstTime,&u32Value,pstRam_Data,&stARD04Data);//err201080911 填充剩余金额
			u32ReadLen = sizeof(stARD04Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE200002B,&stYYTime,(u8*)&stARD04Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE200002B);
			if(QCSG_CheckAlarmReport(0xE200002B) == TRUE)
			{
				TerminalReportAlarmInc();
			}
			pstAlarm_Info->u8AlarmFlag = 0xFF;			
		}
	}
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，示数下降,ARD03
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E200002C(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取正反向有功电能0x0001FF00、0x0002FF00
	 */
	QCSG_ALARM_E200002C_LIST_S* pstAlarm_List = (QCSG_ALARM_E200002C_LIST_S*)QCSG_ALARM_E200002C_LIST;
	QCSG_ALARM_E200002C_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ARD03Struct stARD03Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32Ident = 0,u32LastValue = 0,u32CurrValue = 0,u32ReadLen = 0;
	u32 u32LastValueList[2],u32CurrValueList[2];
	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200002C) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],4) != TRUE)
	{
		return;
	}
	MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);
	u8PnNum = pstAlarm_List->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200002CData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002CData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002CData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			if(u32Ident == 0x0001FF00)
			{
				MemCopy(pstAlarm_Info->u8Data00010000,&pstDlt645Frame_Info->u8RevBuf[14],4);
				MemSet(pstAlarm_Info->u8Data00020000,0xFF,4);

				pstAlarm_List->u8PnNum ++;
			}
		}
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	if(u32Ident == 0x0002FF00)
	{
		if(pstAlarm_Info->u8Data00020000[0] == 0xFF)
		{
			MemCopy(pstAlarm_Info->u8Data00020000,&pstDlt645Frame_Info->u8RevBuf[14],4);	
			return;
		}
	}
	if(u32Ident == 0x0001FF00)
	{
		MemCopy(&u32LastValue,pstAlarm_Info->u8Data00010000,4);
		MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[14],4);
		u32CurrValueList[0] = u32CurrValue;
		MemCopy(&u32CurrValueList[1],pstAlarm_Info->u8Data00020000,4);
		MemCopy(&u32LastValueList[0],pstAlarm_Info->u8Data00010000,4);
		MemCopy(&u32LastValueList[1],pstAlarm_Info->u8Data00020000,4);
		if(u32CurrValue < u32LastValue)
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD03_Data(1,pstTime,u32LastValueList,u32CurrValueList,pstRam_Data,&stARD03Data);
			u32ReadLen = sizeof(stARD03Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE200002C,&stYYTime,(u8*)&stARD03Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE200002C);
			if(QCSG_CheckAlarmReport(0xE200002C) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
		}
		MemCopy(pstAlarm_Info->u8Data00010000,&pstDlt645Frame_Info->u8RevBuf[14],4);	
	}
	if(u32Ident == 0x0002FF00)
	{
		MemCopy(&u32LastValue,pstAlarm_Info->u8Data00020000,4);
		MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[14],4);
		u32CurrValueList[1] = u32CurrValue;
		MemCopy(&u32CurrValueList[0],pstAlarm_Info->u8Data00010000,4);
		MemCopy(&u32LastValueList[0],pstAlarm_Info->u8Data00010000,4);
		MemCopy(&u32LastValueList[1],pstAlarm_Info->u8Data00020000,4);		
		if(u32CurrValue < u32LastValue)
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD03_Data(1,pstTime,u32LastValueList,u32CurrValueList,pstRam_Data,&stARD03Data);
			u32ReadLen = sizeof(stARD03Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE200002C,&stYYTime,(u8*)&stARD03Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE200002C);
			if(QCSG_CheckAlarmReport(0xE200002C) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
		}
		MemCopy(pstAlarm_Info->u8Data00020000,&pstDlt645Frame_Info->u8RevBuf[14],4);	
	}	
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，飞走
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E200002D(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取总有功功率0x0203FF00中
	 */
	QCSG_ALARM_E200002D_LIST_S* pstAlarm_List = (QCSG_ALARM_E200002D_LIST_S*)QCSG_ALARM_E200002D_LIST;
	QCSG_ALARM_E200002D_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	RealTimeYYStruct stYYTime;
	ARD03Struct stARD03Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,u8Value = 0,i = 0;
	u16 u16Tmin = 0;
	u32 u32CalcEkwh = 0,u32ReadEkwh = 0,u32LastPEkwh = 0,u32LastNEkwh = 0,u32CurrPEkwh = 0,u32CurrNEkwh = 0,u32Pkw = 0,u32TimeSubRes[4],u32ReadLen = 0;
	u32 u32LastValueList[2],u32CurrValueList[2];

