gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	//err20180823 飞走告警 数据内容中发生前后数据填写相同 增加一个临时变量存储上一次电量数据
	u32 u32Temp_LastData00010000,u32Temp_LastData00020000;
	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200002D) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	MemCopy(&u32Pkw,&pstDlt645Frame_Info->u8RevBuf[14],3);
	u32Pkw &= 0x7FFFFF;
	u32Pkw = QCSG_BCD2HEX((u8)(u32Pkw>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pkw>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pkw);
	u8PnNum = pstPn_Ram_Data->u8PnNum;	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	if(QCSG_BCDCheck(pstRam_Data->u8Data00010000,4) != TRUE)
	{
		return;
	}
	if(QCSG_BCDCheck(pstRam_Data->u8Data00020000,4) != TRUE)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200002DData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002DData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002DData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			MemCopy(&pstAlarm_Info->stStartTime,pstTime,sizeof(TIME_PARAM_S));
			MemCopy(pstAlarm_Info->u8LastData00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstAlarm_Info->u8LastData00020000,pstRam_Data->u8Data00020000,4);
			pstAlarm_Info->u32CalcEkwh = 0;
			pstAlarm_Info->u32ReadEkwh = 0;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}	
	MemCopy(&u32LastPEkwh,pstAlarm_Info->u8LastData00010000,4);
	MemCopy(&u32LastNEkwh,pstAlarm_Info->u8LastData00020000,4);
	MemCopy(&u32CurrPEkwh,pstRam_Data->u8Data00010000,4);
	MemCopy(&u32CurrNEkwh,pstRam_Data->u8Data00020000,4);
	u32LastPEkwh = QCSG_BCD2HEX((u8)(u32LastPEkwh>>24)) * 1000000 +  QCSG_BCD2HEX((u8)(u32LastPEkwh>>16)) * 10000 
					+ QCSG_BCD2HEX((u8)(u32LastPEkwh>>8)) * 100 + QCSG_BCD2HEX((u8)u32LastPEkwh);
	u32LastNEkwh = QCSG_BCD2HEX((u8)(u32LastNEkwh>>24)) * 1000000 +  QCSG_BCD2HEX((u8)(u32LastNEkwh>>16)) * 10000 
					+ QCSG_BCD2HEX((u8)(u32LastNEkwh>>8)) * 100 + QCSG_BCD2HEX((u8)u32LastNEkwh);
	u32CurrPEkwh = QCSG_BCD2HEX((u8)(u32CurrPEkwh>>24)) * 1000000 +  QCSG_BCD2HEX((u8)(u32CurrPEkwh>>16)) * 10000 
					+ QCSG_BCD2HEX((u8)(u32CurrPEkwh>>8)) * 100 + QCSG_BCD2HEX((u8)u32CurrPEkwh);
	u32CurrNEkwh = QCSG_BCD2HEX((u8)(u32CurrNEkwh>>24)) * 1000000 +  QCSG_BCD2HEX((u8)(u32CurrNEkwh>>16)) * 10000 
					+ QCSG_BCD2HEX((u8)(u32CurrNEkwh>>8)) * 100 + QCSG_BCD2HEX((u8)u32CurrNEkwh);
	//刷新记录的上一次电能示值
	//err20180823 电能表飞走告警 数据内容中发生前后数据填写相同 添加临时变量存放上一次电量值			
	MemCopy(&u32Temp_LastData00010000,pstAlarm_Info->u8LastData00010000,4);//
	MemCopy(&u32Temp_LastData00020000,pstAlarm_Info->u8LastData00020000,4);//

	MemCopy(pstAlarm_Info->u8LastData00010000,pstRam_Data->u8Data00010000,4);
	MemCopy(pstAlarm_Info->u8LastData00020000,pstRam_Data->u8Data00020000,4);
	if((u32CurrPEkwh < u32LastPEkwh)||(u32CurrNEkwh < u32LastNEkwh))
	{
		return;
	}
	u32ReadEkwh = (u32CurrPEkwh - u32LastPEkwh) + (u32CurrNEkwh - u32LastNEkwh);
	pstAlarm_Info->u32ReadEkwh += u32ReadEkwh;
	
	if(QCSG_TimerSub(pstTime,&pstAlarm_Info->stStartTime,u32TimeSubRes) < 0)
	{
		//刷新上一次示值记录的时间
		MemCopy(&pstAlarm_Info->stStartTime,pstTime,sizeof(TIME_PARAM_S));
		return;
	}
	//刷新上一次示值记录的时间
	MemCopy(&pstAlarm_Info->stStartTime,pstTime,sizeof(TIME_PARAM_S));
	if(u32TimeSubRes[0] != 0)
	{
		return;
	}
	u16Tmin = u32TimeSubRes[1] * 60 + u32TimeSubRes[2];
	//u32Pkw扩大10000倍，示值是扩大100倍，这里再除以100，保持跟u32ReadEkwh量纲一致
	u32CalcEkwh = u32Pkw * u16Tmin/(60 * 100);	
	pstAlarm_Info->u32CalcEkwh += u32CalcEkwh;	
	if(pstAlarm_Info->u32CalcEkwh < 10)
	{
		return;
	}
	//读取越限阀值	
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE0800189,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		u8Value = 10;
	}
	else
	{
		u8Value = QCSG_BCD2HEX(stThresholdPara.E0000189);
	}
	if(pstAlarm_Info->u8AlarmFlag == 0xFF)
	{
		if(pstAlarm_Info->u32ReadEkwh > (pstAlarm_Info->u32CalcEkwh * u8Value))
		{
			//产生发生事件
			MemCopy(&u32CurrValueList[0],pstRam_Data->u8Data00010000,4);
			MemCopy(&u32CurrValueList[1],pstRam_Data->u8Data00020000,4);
			
			//err20180823 电能表飞走告警 数据内容中发生前后数据填写相同 添加临时变量存放上一次电量值
			MemCopy(&u32LastValueList[0],&u32Temp_LastData00010000,4);
			MemCopy(&u32LastValueList[1],&u32Temp_LastData00020000,4);
			//MemCopy(&u32LastValueList[0],pstAlarm_Info->u8LastData00010000,4);
			//MemCopy(&u32LastValueList[1],pstAlarm_Info->u8LastData00020000,4);	
			
			MemSet(&stYYTime,0,sizeof(stYYTime));			
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD03_Data(1,pstTime,u32LastValueList,u32CurrValueList,pstRam_Data,&stARD03Data);
			u32ReadLen = sizeof(stARD03Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE200002D,&stYYTime,(u8*)&stARD03Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE200002D);
			if(QCSG_CheckAlarmReport(0xE200002D) == TRUE)
			{
				TerminalReportAlarmInc();
			}							
			pstAlarm_Info->u8AlarmFlag = 0x01;
		}	
	}
	if(pstAlarm_Info->u8AlarmFlag == 0x01)
	{
		if(pstAlarm_Info->u32ReadEkwh < (pstAlarm_Info->u32CalcEkwh * u8Value))
		{
			pstAlarm_Info->u8AlarmFlag = 0xFF;
		}	
	}
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，停走,ARD2
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E200002E(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在0x0203FF00
	 */
	QCSG_ALARM_E200002E_LIST_S* pstAlarm_List = (QCSG_ALARM_E200002E_LIST_S*)QCSG_ALARM_E200002E_LIST;
	QCSG_ALARM_E200002E_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ThresholdParaStruct stThresholdPara;
	RealTimeYYStruct stYYTime;
	ARD02Struct stARD02Data;	
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u16 u16Value = 0;
	u32 u32CurrTick = 0,u32P = 0,u32ReadLen = 0;
	u32 u32Start_PE = 0,u32Start_NE = 0,u32Curr_PE = 0,u32Curr_NE = 0;
	
