gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200002E) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u32CurrTick = HAL_GetSystemTick();
	u8PnNum = pstPn_Ram_Data->u8PnNum;	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200002EData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002EData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002EData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			MemCopy(pstAlarm_Info->u8Data00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);
			pstAlarm_Info->u32E_Quantity = 0;
			pstAlarm_Info->u32LastTick = u32CurrTick;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}	
	//读取越限阀值	
	u32ReadLen = sizeof(ThresholdParaStruct);
	if(NAND_ReadPara(PARA_Threshold,0,0xE080018A,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
	{
		u16Value = QCSG_BCD2HEX(0x10);
	}
	else
	{
		if(QCSG_BCDCheck((u8*)&stThresholdPara.E000018A,2) != TRUE)
		{
			u16Value = QCSG_BCD2HEX(0x10);
		}
		else
		{
			u16Value = QCSG_BCD2HEX((u8)(stThresholdPara.E000018A>>8)) * 100 + QCSG_BCD2HEX((u8)(stThresholdPara.E000018A));
		}
	}
	MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);
	u32P &= 0x007FFFFF;
	u32P = QCSG_BCD2HEX((u8)(u32P>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32P>>8)) * 100 + QCSG_BCD2HEX((u8)u32P);
	pstAlarm_Info->u32E_Quantity += (u32CurrTick - pstAlarm_Info->u32LastTick) * u32P/(3600 * 100);
	if(pstAlarm_Info->u32E_Quantity < u16Value * 100)
	{
		pstAlarm_Info->u32LastTick = u32CurrTick;
		return;
	}
	MemCopy(&u32Start_PE,pstAlarm_Info->u8Data00010000,4);
	MemCopy(&u32Start_NE,pstAlarm_Info->u8Data00020000,4);
	u32Start_PE	= QCSG_BCD2HEX((u8)(u32Start_PE>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32Start_PE>>16)) * 10000 + 
				  QCSG_BCD2HEX((u8)(u32Start_PE>>8)) * 100 + QCSG_BCD2HEX((u8)u32Start_PE);
	u32Start_NE	= QCSG_BCD2HEX((u8)(u32Start_NE>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32Start_NE>>16)) * 10000 + 
				  QCSG_BCD2HEX((u8)(u32Start_NE>>8)) * 100 + QCSG_BCD2HEX((u8)u32Start_NE);
	MemCopy(&u32Curr_PE,pstRam_Data->u8Data00010000,4);
	MemCopy(&u32Curr_NE,pstRam_Data->u8Data00020000,4);
	u32Curr_PE	= QCSG_BCD2HEX((u8)(u32Curr_PE>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32Curr_PE>>16)) * 10000 + 
				  QCSG_BCD2HEX((u8)(u32Curr_PE>>8)) * 100 + QCSG_BCD2HEX((u8)u32Curr_PE);
	u32Curr_NE	= QCSG_BCD2HEX((u8)(u32Curr_NE>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32Curr_NE>>16)) * 10000 + 
				  QCSG_BCD2HEX((u8)(u32Curr_NE>>8)) * 100 + QCSG_BCD2HEX((u8)u32Curr_NE);	
	if((u32Start_PE + u32Start_NE) == (u32Curr_PE + u32Curr_NE))
	{
		if(pstAlarm_Info->u8AlarmFlag == 0xFF)
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));			
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD02_Data(1,pstTime,pstRam_Data,&stARD02Data);
			u32ReadLen = sizeof(stARD02Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE200002E,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE200002E);			
			if(QCSG_CheckAlarmReport(0xE200002E) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
		}
		pstAlarm_Info->u8AlarmFlag = 1;
	}
	else
	{
		pstAlarm_Info->u16Pn = u16Pn;
		pstAlarm_Info->u8AlarmFlag = 0xFF;
		MemCopy(pstAlarm_Info->u8Data00010000,pstRam_Data->u8Data00010000,4);
		MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);
		pstAlarm_Info->u32E_Quantity = 0;
		pstAlarm_Info->u32LastTick = u32CurrTick;		
	}
}
/**--------------------------------------------------------------------
*功    能:通信失败,ARD1
*输入参数:u8FailFlag:成功失败标识，pstTime：抄表时间，u16Pn：测量点号
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E200002F(u8 u8FailFlag,TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId)
{
	QCSG_ALARM_E200002F_LIST_S* pstAlarm_List = (QCSG_ALARM_E200002F_LIST_S*)QCSG_ALARM_E200002F_LIST;
	QCSG_ALARM_E200002F_INFO_S* pstAlarm_Info = NULL;
	RealTimeYYStruct stYYTime;
	ARD01Struct stARD01Data;		
	u8 u8PnNum = 0,i = 0;
	u32 u32ReadLen = 0;
	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200002F) != TRUE)
	{
		return;
	}	
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200002F_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE200002FData[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200002F_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200002FData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002FData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200002FData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_Info->u8FailTimes = 0;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}
	if(u8FailFlag == TRUE)
	{
		//抄表成功
		if(pstAlarm_Info->u8AlarmFlag == 0x01)
		{
			//产生恢复事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD01_Data(0,pstTime,&stARD01Data);
			u32ReadLen = sizeof(stARD01Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE200002F,&stYYTime,(u8*)&stARD01Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE200002F);
			if(QCSG_CheckAlarmReport(0xE200002F) == TRUE)
			{
				TerminalReportAlarmInc();
			}
			pstAlarm_Info->u8FailTimes = 0;
			pstAlarm_Info->u8AlarmFlag = 0xFF;			
		}
	}
	if(u8FailFlag == FALSE)
	{
		//抄表失败
		pstAlarm_Info->u8FailTimes++;
		if(pstAlarm_Info->u8FailTimes >= 3)
		{
			//产生发生事件
			if(pstAlarm_Info->u8AlarmFlag != 0x01)
			{
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD01_Data(1,pstTime,&stARD01Data);
				u32ReadLen = sizeof(stARD01Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE200002F,&stYYTime,(u8*)&stARD01Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE200002F);
				if(QCSG_CheckAlarmReport(0xE200002F) == TRUE)
				{
					TerminalReportAlarmInc();
				}				
			}
			pstAlarm_Info->u8AlarmFlag = 0x01;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，差动告警
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000030(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在0x0001FF00,只完成电能量差动功能
	 */
	QCSG_ALARM_E2000030_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000030_LIST_S*)QCSG_ALARM_E2000030_LIST;
	QCSG_ALARM_E2000030_INFO_S* pstAlarm_Info = NULL;
	QCSG_DAY_ENERGY_LIST_S* pst_Day_Energy_List = (QCSG_DAY_ENERGY_LIST_S*)QCSG_DAY_ENERGY_LIST_LCD;
	QCSG_ENERGY_S* pstEnergy_Data = NULL;	
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;	
	DiffCaculationParaStruct* pstDiffPara = NULL;
	ms_Type* pMS_Info = NULL;	
	RealTimeYYStruct stYYTime;
	ARD03Struct stARD03Data;
	u8 u8PnNum = 0,i = 0,j = 0,k = 0,u8CtrlCode = 0,u8TotalDiffNum = 0,u8ValidDiffNum = 0,u8ValidDiffList[MAX_DIFF_CACU_NUM];
	u16 u16Pnref = 0,u16Pndiff = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0,u16CurrValue = 0;
	u32 u32MaxMallocSize = 0,u32ReadLen = 0,u32DiffIdent = 0;
	u32 u32PnrefDataEnergy = 0,u32PndifDataEnergy = 0,u32MinDiffValue = 0;	
	u32 u32PnrefStartEnergy = 0,u32PndifStartEnergy = 0;
	u32 u32PnrefUp = 0,u32PndiffUp = 0,u32CurrData00010000 = 0;
	u32 u32LastValueList[2],u32CurrValueList[2];
	
