gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(u16Pn == 0)
	{
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE2000030) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],4) != TRUE)
	{
		return;
	}
	MemCopy(&u32CurrData00010000,&pstDlt645Frame_Info->u8RevBuf[14],4);

	
	pMS_Info = Get_ms();
	u32MaxMallocSize = pMS_Info->ms_malloc_sizemax();
	if(u32MaxMallocSize < sizeof(DiffCaculationParaStruct))
	{
		//动态内存分配不够用，直接返回，此函数无法执行了 
		return;
	}

	
	pstDiffPara = pMS_Info->ms_malloc(sizeof(DiffCaculationParaStruct));
	u32ReadLen = sizeof(DiffCaculationParaStruct);
	if(NAND_ReadPara(PARA_Caculation,0,0xE0000800,(u8*)pstDiffPara,&u32ReadLen) != NO_ERROR)
	{
		pMS_Info->ms_free(pstDiffPara);
		return;
	}
	u8TotalDiffNum = pstDiffPara->DiffNum;
	if((u8TotalDiffNum > MAX_DIFF_CACU_NUM) || (u8TotalDiffNum == 0))
	{
		MemSet((u8*)QCSG_ALARM_E2000030_LIST,0,512);		
		pMS_Info->ms_free(pstDiffPara);
		return;		
	}
	for(i = 0;i<u8TotalDiffNum;i++)
	{
		if((pstDiffPara->DiffStateMark[0] & (1 << i)) != 0)
		{
			u8ValidDiffList[u8ValidDiffNum] = i;	//各有效规则的编号
			u8ValidDiffNum++;
		}
	}
	if(u8ValidDiffNum == 0)
	{
		MemSet((u8*)QCSG_ALARM_E2000030_LIST,0,512);
		pMS_Info->ms_free(pstDiffPara);
		return;				
	}
	for(i = 0;i < u8ValidDiffNum;i++)
	{
		k = u8ValidDiffList[i];
		//差动规则遍历
		MemCopy(&u32DiffIdent,&pstDiffPara->DiffID[k][0],4);
		if(u32DiffIdent != 0x00010000)
		{
			//只做电能量差动
			continue;
		}
		MemCopy(&u16Pndiff,&pstDiffPara->DiffID[k][6],2);//	被比较测量点号
		u16Pndiff = (u16)SwitchNumToPn(u16Pndiff);
		if(u16Pndiff != u16Pn)
		{
			//进入测量点不属于差动配置范围
			continue;
		}
		MemCopy(&u16Pnref,&pstDiffPara->DiffID[k][4],2);	//比较测量点号即参考测量点
		if(u16Pnref != 0)
		{
			//参考测量点只能是终端
			continue;
		}


		//取参考点数据
		u8PnNum = pst_Day_Energy_List->u8PnNum;
		for(j = 0;j < u8PnNum;j++)
		{
			//寻找内存中记录的被比较测量点的数据信息
			if(0 == pst_Day_Energy_List->stPn_Ram_Data[j].u16Pn)
			{
				pstEnergy_Data = &pst_Day_Energy_List->stPn_Ram_Data[j];
				break;
			}
		}	
		if(j >= u8PnNum)
		{
			pMS_Info->ms_free(pstDiffPara);
			return;
		}
		if(QCSG_BCDCheck((u8*)&pstEnergy_Data->u32Energy00010000,4) != TRUE)
		{
			pMS_Info->ms_free(pstDiffPara);
			return;
		}			
		MemCopy(&u32PnrefDataEnergy,&pstEnergy_Data->u32Energy00010000,4);


//取要比较的点的数据
		
		for(j = 0;j < u8PnNum;j++)
		{
			//寻找内存中记录的比较测量点数据信息
			if(u16Pn == pst_Day_Energy_List->stPn_Ram_Data[j].u16Pn)
			{
				pstEnergy_Data = &pst_Day_Energy_List->stPn_Ram_Data[j];
				break;
			}
		}	
		if(j >= u8PnNum)
		{
			pMS_Info->ms_free(pstDiffPara);
			return;
		}
		MemCopy(&u32PndifDataEnergy,&pstEnergy_Data->u32Energy00010000,4);

		
		for(j = 0;j < u8PnNum;j++)
		{
			//寻找内存中记录的比较测量点数据信息
			if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[j].u16Pn)
			{
				pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[j];
				break;
			}
		}	
		if(j >= u8PnNum)
		{
			pMS_Info->ms_free(pstDiffPara);
			return;
		}		


		//取要比较的点的告警信息
		u8PnNum = pstAlarm_List->u8PnNum;
		for(j = 0;j < u8PnNum;j++)
		{
			//寻找内存中记录的测量点事件信息
			if(u16Pn == pstAlarm_List->stE2000030Data[j].u16Pn)
			{
				pstAlarm_Info = &pstAlarm_List->stE2000030Data[j];
				break;
			}
		}
		if(j >= u8PnNum)
		{
			//测量点之前未有记录，则添加到记录中,此次不做任何处理
			if(u8PnNum < MAX_PN_NUM2)
			{
				pstAlarm_Info = &pstAlarm_List->stE2000030Data[u8PnNum];
				pstAlarm_Info->u16Pn = u16Pn;
				pstAlarm_Info->u8AlarmFlag = 0xFF;
				MemCopy(&pstAlarm_Info->u32PnrefStartEnergy,&u32PnrefDataEnergy,4);
				MemCopy(&pstAlarm_Info->u32PndifStartEnergy,&u32PndifDataEnergy,4);
				MemCopy(&pstAlarm_Info->u32PndifData00010000,&pstDlt645Frame_Info->u8RevBuf[14],4);
				MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);//err20180925 差动 增加发生前数据	
				pstAlarm_Info->u32PnrefEnergy = 0;
				pstAlarm_Info->u32PndifEnergy = 0;
				pstAlarm_List->u8PnNum ++;
			}
			else
			{
				pMS_Info->ms_free(pstDiffPara);
				return;				
			}
		}
		if(u32CurrData00010000 < pstAlarm_Info->u32PndifData00010000)
		{
			//台体测试该告警恢复时，会下调虚拟表示值，此处作为台体恢复的一个测试标记
			MemCopy(&pstAlarm_Info->u32PnrefStartEnergy,&u32PnrefDataEnergy,4);
			MemCopy(&pstAlarm_Info->u32PndifStartEnergy,&u32PndifDataEnergy,4);
			MemCopy(&pstAlarm_Info->u32PndifData00010000,&pstDlt645Frame_Info->u8RevBuf[14],4);
			MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);//err20180925 差动 增加发生前数据
			pstAlarm_Info->u32PnrefEnergy = 0;
			pstAlarm_Info->u32PndifEnergy = 0;			
		}				
		MemCopy(&u32MinDiffValue,&pstDiffPara->DiffID[k][8],3);//　采用差动比率报警的最小绝对差值
		u32MinDiffValue = QCSG_BCD2HEX((u8)(u32MinDiffValue>>16)) * 10000 + 
						  QCSG_BCD2HEX((u8)(u32MinDiffValue>>8)) * 100 +	//err20180716 台体差动告警不合格 *10 -> *100
						  QCSG_BCD2HEX((u8)(u32MinDiffValue));
		u32PndifDataEnergy = QCSG_BCD2HEX((u8)(u32PndifDataEnergy>>24)) * 1000000 + 
								QCSG_BCD2HEX((u8)(u32PndifDataEnergy>>16)) * 10000 + 
								QCSG_BCD2HEX((u8)(u32PndifDataEnergy>>8)) * 100 +
								QCSG_BCD2HEX((u8)(u32PndifDataEnergy));
		u32PndifStartEnergy = QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PndifStartEnergy>>24)) * 1000000 + 
								 QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PndifStartEnergy>>16)) * 10000 + 
								 QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PndifStartEnergy>>8)) * 100 + 
								 QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PndifStartEnergy));
		u32PnrefDataEnergy = QCSG_BCD2HEX((u8)(u32PnrefDataEnergy>>24)) * 1000000 + 
							   QCSG_BCD2HEX((u8)(u32PnrefDataEnergy>>16)) * 10000 + 
							   QCSG_BCD2HEX((u8)(u32PnrefDataEnergy>>8)) * 100 +
							   QCSG_BCD2HEX((u8)(u32PnrefDataEnergy));		
		u32PnrefStartEnergy = QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PnrefStartEnergy>>24)) * 1000000 + 
								QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PnrefStartEnergy>>16)) * 10000 + 
								QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PnrefStartEnergy>>8)) * 100 +
								QCSG_BCD2HEX((u8)(pstAlarm_Info->u32PnrefStartEnergy));
		if((u32PndifDataEnergy - u32PndifStartEnergy) < u32MinDiffValue)
		{
			continue;
		}
		//程序运行至此，可以判断差动告警
		u32PndiffUp = u32PndifDataEnergy - u32PndifStartEnergy;
		u32PnrefUp = u32PnrefDataEnergy - u32PnrefStartEnergy;
		pstAlarm_Info->u32PnrefEnergy += u32PnrefUp;
		pstAlarm_Info->u32PndifEnergy += u32PndiffUp;
		u32PnrefUp = pstAlarm_Info->u32PnrefEnergy;
		MemCopy(&u16UpLimitValue,&pstDiffPara->DiffID[k][11],2);	//差动比率报警阈值(%)
		MemCopy(&u16LowLimitValue,&pstDiffPara->DiffID[k][13],2);	//差动比率报警恢复阈值(%)
		u16UpLimitValue = QCSG_BCD2HEX((u8)(u16UpLimitValue>>8)) * 100 +
						  QCSG_BCD2HEX((u8)(u16UpLimitValue));	
		u16LowLimitValue = QCSG_BCD2HEX((u8)(u16LowLimitValue>>8)) * 100 +
						  QCSG_BCD2HEX((u8)(u16LowLimitValue));	
		if(u32PnrefUp == 0)
		{
			continue;
		}
		if(pstAlarm_Info->u32PndifEnergy >= pstAlarm_Info->u32PnrefEnergy)
		{
			u16CurrValue = pstAlarm_Info->u32PndifEnergy - pstAlarm_Info->u32PnrefEnergy;
		}
		else
		{
			u16CurrValue = pstAlarm_Info->u32PnrefEnergy - pstAlarm_Info->u32PndifEnergy;
		}
		if(pstAlarm_Info->u8AlarmFlag == 0xFF)
		{
			if((u16CurrValue * 10000 /  u32PnrefUp) > u16UpLimitValue)
			{
				//产生发生事件
				//MemCopy(&u32LastValueList[0],pstRam_Data->u8Data00010000,4);
				//MemCopy(&u32LastValueList[1],pstRam_Data->u8Data00020000,4);
				MemCopy(&u32LastValueList[0],&pstAlarm_Info->u32PndifData00010000,4);
				MemCopy(&u32LastValueList[1],pstAlarm_Info->u8Data00020000,4);//err20180925 差动 增加发生前数据
				
				MemCopy(&u32CurrValueList[0],pstRam_Data->u8Data00010000,4);
				MemCopy(&u32CurrValueList[1],pstRam_Data->u8Data00020000,4);
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD03_Data(1,pstTime,u32LastValueList,u32CurrValueList,pstRam_Data,&stARD03Data);
				u32ReadLen = sizeof(stARD03Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000030,&stYYTime,(u8*)&stARD03Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000030);
				if(QCSG_CheckAlarmReport(0xE2000030) == TRUE)
				{
					TerminalReportAlarmInc();
				}	
				pstAlarm_Info->u8AlarmFlag = 0x01;				
			}
			pstAlarm_Info->u32PndifStartEnergy = hex_bcd(u32PndifDataEnergy);
			pstAlarm_Info->u32PnrefStartEnergy = hex_bcd(u32PnrefDataEnergy);			
		}
		if(pstAlarm_Info->u8AlarmFlag == 0x01)
		{
			if((u16CurrValue * 10000 /  u32PnrefUp) < u16LowLimitValue)
			{
				//产生恢复事件
				//MemCopy(&u32LastValueList[0],pstRam_Data->u8Data00010000,4);
				//MemCopy(&u32LastValueList[1],pstRam_Data->u8Data00020000,4);
				MemCopy(&u32LastValueList[0],&pstAlarm_Info->u32PndifData00010000,4);
				MemCopy(&u32LastValueList[1],pstAlarm_Info->u8Data00020000,4);//err20180925 差动 增加发生前数据
				
				MemCopy(&u32CurrValueList[0],pstRam_Data->u8Data00010000,4);
				MemCopy(&u32CurrValueList[1],pstRam_Data->u8Data00020000,4);
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD03_Data(0,pstTime,u32LastValueList,u32CurrValueList,pstRam_Data,&stARD03Data);
				u32ReadLen = sizeof(stARD03Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE2000030,&stYYTime,(u8*)&stARD03Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE2000030);				
				if(QCSG_CheckAlarmReport(0xE2000030) == TRUE)
				{
					TerminalReportAlarmInc();
				}					
				pstAlarm_Info->u8AlarmFlag = 0xFF;	
				pstAlarm_Info->u32PndifStartEnergy = hex_bcd(u32PndifDataEnergy);
				pstAlarm_Info->u32PnrefStartEnergy = hex_bcd(u32PnrefDataEnergy);				
			}			
		}			
	}
	pMS_Info->ms_free(pstDiffPara);
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，最大需量清零记录,ARD7
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000031(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取需量清零次数0x03300200中
	 */
	QCSG_ALARM_E2000031_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000031_LIST_S*)QCSG_ALARM_E2000031_LIST;
	QCSG_ALARM_E2000031_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ARD07Struct stARD07Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;
	if(QCSG_CheckAlarmConfig(0xE2000031) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000031_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000031Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000031_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000031Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000031Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000031Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			MemCopy(pstAlarm_Info->u8Data03300200,&pstDlt645Frame_Info->u8RevBuf[14],3);
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	if(memcmp(pstAlarm_Info->u8Data03300200,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
	{
		//产生发生事件
		MemSet(&stYYTime,0,sizeof(stYYTime));
		RD_Time_TO_YYTime(pstTime,&stYYTime);
		RD_Write_ARD07_Data(1,pstTime,pstRam_Data,&stARD07Data);
		u32ReadLen = sizeof(stARD07Data);
		NAND_WriteAlarmRecord(pu8MeterId,0xE2000031,&stYYTime,(u8*)&stARD07Data,&u32ReadLen);
		TerminalSetLastAlarmDI(0xE2000031);
		if(QCSG_CheckAlarmReport(0xE2000031) == TRUE)
		{
			TerminalReportAlarmInc();
		}			
	}
	MemCopy(pstAlarm_Info->u8Data03300200,&pstDlt645Frame_Info->u8RevBuf[14],3);		
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，电能表时钟电池电压过低,ARD1
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000032(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取电能表运行状态字0x04000501中
	 */
	QCSG_ALARM_E2000032_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000032_LIST_S*)QCSG_ALARM_E2000032_LIST;
	QCSG_ALARM_E2000032_INFO_S* pstAlarm_Info = NULL;
	RealTimeYYStruct stYYTime;
	ARD01Struct stARD01Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;
	
