gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(QCSG_CheckAlarmConfig(0xE2000032) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],1) != TRUE)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000032_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000032Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000032_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000032Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000032Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000032Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}	
	if(pstAlarm_Info->u8AlarmFlag == 0xFF)
	{
		if((pstDlt645Frame_Info->u8RevBuf[14] & 0x04) != 0)//状态字bit2:时钟电池是否欠压
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD01_Data(1,pstTime,&stARD01Data);
			u32ReadLen = sizeof(stARD01Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000032,&stYYTime,(u8*)&stARD01Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000032);
			if(QCSG_CheckAlarmReport(0xE2000032) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
			pstAlarm_Info->u8AlarmFlag = 0x01;//err20180619 事件发生后，需置标志位，以防每次抄表都产生事件
		}
	}
	if(pstAlarm_Info->u8AlarmFlag == 0x01)
	{
		if((pstDlt645Frame_Info->u8RevBuf[14] & 0x04) == 0)
		{
			//恢复为告警初始状态，台体测试不产生恢复事件
			pstAlarm_Info->u8AlarmFlag = 0xFF;			
		}
	}	
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，电能表编程时间更改、ARD2
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000035(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取编程次数0x03300000中
	 */
	QCSG_ALARM_E2000035_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000035_LIST_S*)QCSG_ALARM_E2000035_LIST;
	QCSG_ALARM_E2000035_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ARD02Struct stARD02Data;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000035_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000035Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000035_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000035Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000035Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000035Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			MemCopy(pstAlarm_Info->u8Data03300000,&pstDlt645Frame_Info->u8RevBuf[14],3);
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	if(memcmp(pstAlarm_Info->u8Data03300000,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
	{
		if(QCSG_CheckAlarmConfig(0xE2000035) == TRUE)
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD02_Data(1,pstTime,pstRam_Data,&stARD02Data);
			u32ReadLen = sizeof(stARD02Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000035,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000035);
			if(QCSG_CheckAlarmReport(0xE2000035) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
		}
	}
	MemCopy(pstAlarm_Info->u8Data03300000,&pstDlt645Frame_Info->u8RevBuf[14],3);
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，电能表费率时段更改,ARD1
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000036(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致
	 */
	QCSG_ALARM_E2000036_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000036_LIST_S*)QCSG_ALARM_E2000036_LIST;
	QCSG_ALARM_E2000036_INFO_S* pstAlarm_Info = NULL;
	RealTimeYYStruct stYYTime;
	ARD01Struct stARD01Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;
	
	u32 u32Ident = 0;//err20181101 增加第二套第一日时段表数据告警判断
	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE2000036) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4); //err20181101 增加第二套第一日时段表数据告警判断
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000036_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000036Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000036_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000036Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000036Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000036Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			if(u32Ident == 0x04010001)	//err20181101 增加第二套第一日时段表数据告警判断
			{
				MemCopy(pstAlarm_Info->u8Data04010001,&pstDlt645Frame_Info->u8RevBuf[14],42);
				MemSet(pstAlarm_Info->u8Data04020001,0xFF,42);
				pstAlarm_List->u8PnNum ++;
			}
		}
		return;
	}
	if(u32Ident == 0x04020001)//err20181101 增加第二套第一日时段表数据告警判断
	{
		if(pstAlarm_Info->u8Data04020001[0] == 0xFF)//若之前未有记录，则添加到记录中,此次不做任何处理
		{
			MemCopy(pstAlarm_Info->u8Data04020001,&pstDlt645Frame_Info->u8RevBuf[14],42);	
			return;
		}
	}

	if(u32Ident == 0x04010001)	//err20181101 增加第二套第一日时段表数据告警判断
	{
		if(memcmp(pstAlarm_Info->u8Data04010001,&pstDlt645Frame_Info->u8RevBuf[14],42) != 0)
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD01_Data(1,pstTime,&stARD01Data);
			u32ReadLen = sizeof(stARD01Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000036,&stYYTime,(u8*)&stARD01Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000036);
			if(QCSG_CheckAlarmReport(0xE2000036) == TRUE)
			{
				TerminalReportAlarmInc();
			}			
		}
		MemCopy(pstAlarm_Info->u8Data04010001,&pstDlt645Frame_Info->u8RevBuf[14],42);	
	}

	if(u32Ident == 0x04020001)	//err20181101 增加第二套第一日时段表数据告警判断
	{
		if(memcmp(pstAlarm_Info->u8Data04020001,&pstDlt645Frame_Info->u8RevBuf[14],42) != 0)
		{
			//产生发生事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD01_Data(1,pstTime,&stARD01Data);
			u32ReadLen = sizeof(stARD01Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000036,&stYYTime,(u8*)&stARD01Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000036);
			if(QCSG_CheckAlarmReport(0xE2000036) == TRUE)
			{
				TerminalReportAlarmInc();
			}			
		}
		MemCopy(pstAlarm_Info->u8Data04020001,&pstDlt645Frame_Info->u8RevBuf[14],42);	
	}
	
	
