gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，电能表脉冲常数更改,ARD6
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000037(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取有无功脉冲常数0x04000409、0x0400040A中
	 */
	QCSG_ALARM_E2000037_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000037_LIST_S*)QCSG_ALARM_E2000037_LIST;
	QCSG_ALARM_E2000037_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ARD06Struct stARD06Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32Ident = 0,u32ReadLen = 0,u32ValueList[4];
	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE2000037) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);
	
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000037_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000037Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000037_LIST_S));		
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000037Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000037Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000037Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			if(u32Ident == 0x04000409)//电表有功常数
			{
				MemCopy(pstAlarm_Info->u8Data04000409,&pstDlt645Frame_Info->u8RevBuf[14],3);
				MemSet(pstAlarm_Info->u8Data0400040A,0xFF,3);
				pstAlarm_List->u8PnNum ++;
			}
		}
		return;
	}
	if(u32Ident == 0x0400040A)//电表无功常数
	{
		if(pstAlarm_Info->u8Data0400040A[0] == 0xFF)
		{
			MemCopy(pstAlarm_Info->u8Data0400040A,&pstDlt645Frame_Info->u8RevBuf[14],3);	
			return;
		}
	}
	MemCopy(&u32ValueList[0],pstAlarm_Info->u8Data04000409,3);
	MemCopy(&u32ValueList[1],pstAlarm_Info->u8Data0400040A,3);	
	if(u32Ident == 0x04000409)
	{
		if(memcmp(pstAlarm_Info->u8Data04000409,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
		{
			//产生发生事件
			MemCopy(&u32ValueList[2],&pstDlt645Frame_Info->u8RevBuf[14],3);
			MemCopy(&u32ValueList[3],pstAlarm_Info->u8Data0400040A,3);
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD06_Data(1,pstTime,u32ValueList,pstRam_Data,&stARD06Data);
			u32ReadLen = sizeof(stARD06Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000037,&stYYTime,(u8*)&stARD06Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000037);
			if(QCSG_CheckAlarmReport(0xE2000037) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
		}
		MemCopy(pstAlarm_Info->u8Data04000409,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	}
	if(u32Ident == 0x0400040A)
	{
		if(memcmp(pstAlarm_Info->u8Data0400040A,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
		{
			//产生发生事件
			MemCopy(&u32ValueList[2],pstAlarm_Info->u8Data04000409,3);
			MemCopy(&u32ValueList[3],&pstDlt645Frame_Info->u8RevBuf[14],3);
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD06_Data(1,pstTime,u32ValueList,pstRam_Data,&stARD06Data);
			u32ReadLen = sizeof(stARD06Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000037,&stYYTime,(u8*)&stARD06Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000037);
			if(QCSG_CheckAlarmReport(0xE2000037) == TRUE)
			{
				TerminalReportAlarmInc();
			}	
		}
		MemCopy(pstAlarm_Info->u8Data0400040A,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	}
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，终端互感器倍率更改,ARD5
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E2000038_PN(void)
{
	QCSG_ALARM_E2000038_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000038_LIST_S*)QCSG_ALARM_E2000038_LIST;
	QCSG_ALARM_E2000038_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	MeasurePointStruct stPnPara;
	TIME_PARAM_S stTime;
	RealTimeYYStruct stYYTime;
	ARD05Struct stARD05Data;
	u8 i = 0,u8PnNum = 0,j = 0;
	u16 u16LastPt = 0,u16LastCt = 0,u16CurrPt = 0,u16CurrCt = 0,u16Pn = 0,u16ValueList[4];
	u32 u32ReadLen = 0;
	
	if(QCSG_CheckAlarmConfig(0xE2000038) != TRUE)
	{
		return;
	}
	//err20180920 计量互感器倍率更改只有终端 去掉电能表	
	//err20181115 由于台体需要测试电能表告警，所以加回电能表告警部分
	for(j = 0;j < MAX_PN_NUM2;j++)
	{
		u16Pn = (u16)SwitchNumToPn(j);
	
		//u16Pn = (u16)SwitchNumToPn(0);
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			continue;
		}
		if(stPnPara.State == 0)
		{
			continue;
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.CT,2) != TRUE)
		{
			continue;
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.PT,2) != TRUE)
		{
			continue;
		}
		u16CurrPt = stPnPara.PT;
		u16CurrCt = stPnPara.CT;
		u8PnNum = pstAlarm_List->u8PnNum;	
		for(i = 0;i < u8PnNum;i++)
		{
			//寻找内存中记录的测量点事件信息
			if(u16Pn == pstAlarm_List->stE2000038Data[i].u16Pn)
			{
				pstAlarm_Info = &pstAlarm_List->stE2000038Data[i];
				break;
			}
		}
		if(i >= u8PnNum)
		{
			//测量点之前未有记录，则添加到记录中,此次不做任何处理
			if(u8PnNum < MAX_PN_NUM2)
			{
				pstAlarm_Info = &pstAlarm_List->stE2000038Data[u8PnNum];
				pstAlarm_Info->u16Pn = u16Pn;
				pstAlarm_Info->u16Ct = u16CurrCt;		
				pstAlarm_Info->u16Pt = u16CurrPt;				
				pstAlarm_List->u8PnNum ++;
			}
			continue;
		}
		u8PnNum = pstPn_Ram_Data->u8PnNum;		
		for(i = 0;i < u8PnNum;i++)
		{
			//寻找内存中记录的测量点数据信息
			if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
			{
				pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
				break;
			}
		}	
		if(i >= u8PnNum)
		{
			continue;
		}
		u16LastCt = pstAlarm_Info->u16Ct;
		u16LastPt = pstAlarm_Info->u16Pt;
		u16ValueList[0] = u16LastCt;
		u16ValueList[1] = u16LastPt;		
		if((u16CurrCt != u16LastCt) || (u16CurrPt != u16LastPt))
		{
			//产生发生事件
			HAL_GetSystemTime(&stTime);
			u16ValueList[2] = u16CurrCt;
			u16ValueList[3] = u16CurrPt;
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(&stTime,&stYYTime);
			RD_Write_ARD05_Data(1,&stTime,u16ValueList,pstRam_Data,&stARD05Data);
			u32ReadLen = sizeof(stARD05Data);
			NAND_WriteAlarmRecord(stPnPara.Addr,0xE2000038,&stYYTime,(u8*)&stARD05Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000038);
			if(QCSG_CheckAlarmReport(0xE2000038) == TRUE)
			{
				TerminalReportAlarmInc();
			}		
		}
		pstAlarm_Info->u16Ct = u16CurrCt;
		pstAlarm_Info->u16Pt = u16CurrPt;		
	} //err20180920 计量互感器倍率更改只有终端 去掉电能表			
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，电能表互感器倍率更改,ARD5
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
#if 0
void RD_Alarm_E2000038(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取电压、电流互感器倍率0x04000306、0x04000307中
	 */
	QCSG_ALARM_E2000038_LIST_S* pstAlarm_List = (QCSG_ALARM_E2000038_LIST_S*)QCSG_ALARM_E2000038_LIST;
	QCSG_ALARM_E2000038_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ARD05Struct stARD05Data;	
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32Ident = 0,u32ReadLen = 0,u32ValueList[4];
	
