gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE2000038) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000038_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE2000038Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E2000038_LIST_S));		
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	u8PnNum = pstAlarm_List->u8PnNum;	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE2000038Data[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000038Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE2000038Data[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			if(u32Ident == 0x04000306)
			{
				MemCopy(pstAlarm_Info->u8Data04000306,&pstDlt645Frame_Info->u8RevBuf[14],3);
				MemSet(pstAlarm_Info->u8Data04000307,0xFF,3);
				pstAlarm_List->u8PnNum ++;
			}
		}
		return;
	}
	if(u32Ident == 0x04000307)
	{
		if(pstAlarm_Info->u8Data04000307[0] == 0xFF)
		{
			MemCopy(pstAlarm_Info->u8Data04000307,&pstDlt645Frame_Info->u8RevBuf[14],3);	
			return;
		}
	}
	MemCopy(&u32ValueList[0],pstAlarm_Info->u8Data04000306,3);
	MemCopy(&u32ValueList[1],pstAlarm_Info->u8Data04000307,3);		
	if(u32Ident == 0x04000306)
	{
		if(memcmp(pstAlarm_Info->u8Data04000306,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
		{
			//产生发生事件
			MemCopy(&u32ValueList[2],&pstDlt645Frame_Info->u8RevBuf[14],3);
			MemCopy(&u32ValueList[3],pstAlarm_Info->u8Data04000307,3);
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD05_Data(1,pstTime,u32ValueList,pstRam_Data,&stARD05Data);
			u32ReadLen = sizeof(stARD05Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000038,&stYYTime,(u8*)&stARD05Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000038);
			if(QCSG_CheckAlarmReport(0xE2000038) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
		}
		MemCopy(pstAlarm_Info->u8Data04000306,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	}
	if(u32Ident == 0x04000307)
	{
		if(memcmp(pstAlarm_Info->u8Data04000307,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
		{
			//产生发生事件
			MemCopy(&u32ValueList[2],pstAlarm_Info->u8Data04000306,3);
			MemCopy(&u32ValueList[3],&pstDlt645Frame_Info->u8RevBuf[14],3);
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ARD05_Data(1,pstTime,u32ValueList,pstRam_Data,&stARD05Data);
			u32ReadLen = sizeof(stARD05Data);
			NAND_WriteAlarmRecord(pu8MeterId,0xE2000038,&stYYTime,(u8*)&stARD05Data,&u32ReadLen);
			TerminalSetLastAlarmDI(0xE2000038);
			if(QCSG_CheckAlarmReport(0xE2000038) == TRUE)
			{
				TerminalReportAlarmInc();
			}				
		}
		MemCopy(pstAlarm_Info->u8Data04000307,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	}	
}
#endif
/**--------------------------------------------------------------------
*功    能:事件记录处理，时钟异常,ARD13
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E200003E(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在0x04000102
	 */
	QCSG_ALARM_E200003E_LIST_S* pstAlarm_List = (QCSG_ALARM_E200003E_LIST_S*)QCSG_ALARM_E200003E_LIST;
	QCSG_ALARM_E200003E_INFO_S* pstAlarm_Info = NULL;
	TIME_PARAM_S stT_Time,stM_Time;
	ThresholdParaStruct stThresholdPara;	
	RealTimeYYStruct stYYTime;
	ARD13Struct stARD13Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0,u8Value = 0;
	u32 u32Ident = 0,u32ReadLen = 0,u32Res[4];
	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200003E) != TRUE)
	{
		return;
	}
	if(HAL_GetSystemTime(&stT_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}	
	MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);
	if(u32Ident == 0x04000101)
	{
		if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],4) != TRUE)
		{
			return;
		}		
	}
	if(u32Ident == 0x04000102)
	{
		if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
		{
			return;
		}		
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200003E_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE200003EData[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200003E_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200003EData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200003EData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200003EData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			pstAlarm_Info->u8AlarmFlag = 0xFF;
			pstAlarm_List->u8PnNum ++;
		}
	}
	if(u32Ident == 0x04000101)
	{
		MemCopy(pstAlarm_Info->u8Data04000101,&pstDlt645Frame_Info->u8RevBuf[14],4);
		return;
	}
	if(u32Ident == 0x04000102)
	{
		MemCopy(pstAlarm_Info->u8Data04000102,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		//读取越限阀值	
		u32ReadLen = 1;
		if(NAND_ReadPara(PARA_Threshold,0,0xE0800188,(u8*)&stThresholdPara,&u32ReadLen) != NO_ERROR)
		{
			u8Value = QCSG_BCD2HEX(0x10);
		}
		else
		{
			if(QCSG_BCDCheck((u8*)&stThresholdPara.E0000188,1) != TRUE)
			{
				u8Value = QCSG_BCD2HEX(0x10);
			}
			else
			{
				u8Value = QCSG_BCD2HEX(stThresholdPara.E0000188);
			}
		}		
		stM_Time.u8Year = pstAlarm_Info->u8Data04000101[3];
		stM_Time.u8Month = pstAlarm_Info->u8Data04000101[2];
		stM_Time.u8Day = pstAlarm_Info->u8Data04000101[1];
		stM_Time.u8Hour = pstAlarm_Info->u8Data04000102[2];
		stM_Time.u8Minute = pstAlarm_Info->u8Data04000102[1];
		stM_Time.u8Second  = pstAlarm_Info->u8Data04000102[0];
		QCSG_TimerSub(&stT_Time,&stM_Time,u32Res);
		if((u32Res[0] != 0) || (u32Res[1] != 0) || (u32Res[2] > u8Value))
		{
			//产生发生事件
			if(pstAlarm_Info->u8AlarmFlag == 0xFF)
			{
				MemSet(&stYYTime,0,sizeof(stYYTime));
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ARD13_Data(1,pstTime,pstAlarm_Info->u8Data04000101,
									pstAlarm_Info->u8Data04000102,&stARD13Data);
				u32ReadLen = sizeof(stARD13Data);
				NAND_WriteAlarmRecord(pu8MeterId,0xE200003E,&stYYTime,(u8*)&stARD13Data,&u32ReadLen);
				TerminalSetLastAlarmDI(0xE200003E);
				if(QCSG_CheckAlarmReport(0xE200003E) == TRUE)
				{
					TerminalReportAlarmInc();
				}
				pstAlarm_Info->u8AlarmFlag = 1;
			}			
		}
		else
		{
			pstAlarm_Info->u8AlarmFlag = 0xFF;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，端钮盒开盖告警,ARD11
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E200004D(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取端钮盒开盖次数0x03300E00中
	 */
	QCSG_ALARM_E200004D_LIST_S* pstAlarm_List = (QCSG_ALARM_E200004D_LIST_S*)QCSG_ALARM_E200004D_LIST;
	QCSG_ALARM_E200004D_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ARD11Struct stARD11Data;		
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;
	
	u32 u32ValueList[6];//err20180925 添加开盖告警的发生前数据 
	u8 u8NewData03300E00[3];//err20180925 添加端钮盖与表盖打开次数在上报告警数据
	
