gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200004D) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200004D_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE200004DData[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200004D_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200004DData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200004DData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200004DData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			MemCopy(pstAlarm_Info->u8Data03300E00,&pstDlt645Frame_Info->u8RevBuf[14],3);
			//err20180925 添加开盖告警的发生前数据 
			MemCopy(pstAlarm_Info->u8Data00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);
			MemCopy(pstAlarm_Info->u8Data00050000,pstRam_Data->u8Data00050000,4);
			MemCopy(pstAlarm_Info->u8Data00060000,pstRam_Data->u8Data00060000,4);
			MemCopy(pstAlarm_Info->u8Data00070000,pstRam_Data->u8Data00070000,4);
			MemCopy(pstAlarm_Info->u8Data00080000,pstRam_Data->u8Data00080000,4);
			
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}	
	if(memcmp(pstAlarm_Info->u8Data03300E00,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
	{

		MemCopy(u8NewData03300E00,&pstDlt645Frame_Info->u8RevBuf[14],3);//err20180925 添加端钮盖与表盖打开次数在上报告警数据
		MemCopy(&u32ValueList[0],pstAlarm_Info->u8Data00010000,4);//err20180925 添加开盖告警的发生前数据 
		MemCopy(&u32ValueList[1],pstAlarm_Info->u8Data00020000,4);
		MemCopy(&u32ValueList[2],pstAlarm_Info->u8Data00050000,4);
		MemCopy(&u32ValueList[3],pstAlarm_Info->u8Data00060000,4);
		MemCopy(&u32ValueList[4],pstAlarm_Info->u8Data00070000,4);
		MemCopy(&u32ValueList[5],pstAlarm_Info->u8Data00080000,4);
		//产生发生事件
		MemSet(&stYYTime,0,sizeof(stYYTime));
		RD_Time_TO_YYTime(pstTime,&stYYTime);
		RD_Write_ARD11_Data(1,pstTime,u8NewData03300E00,u32ValueList,pstRam_Data,&stARD11Data);//err20180925 添加端钮盖与表盖打开次数在上报告警数据 //err20180925 添加开盖告警的发生前数据 
		u32ReadLen = sizeof(stARD11Data);
		NAND_WriteAlarmRecord(pu8MeterId,0xE200004D,&stYYTime,(u8*)&stARD11Data,&u32ReadLen);
		TerminalSetLastAlarmDI(0xE200004D);
		if(QCSG_CheckAlarmReport(0xE200004D) == TRUE)
		{
			TerminalReportAlarmInc();
		}			
	}
	MemCopy(pstAlarm_Info->u8Data03300E00,&pstDlt645Frame_Info->u8RevBuf[14],3);
	//err20180925 添加开盖告警的发生前数据 
	MemCopy(pstAlarm_Info->u8Data00010000,pstRam_Data->u8Data00010000,4);
	MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);
	MemCopy(pstAlarm_Info->u8Data00050000,pstRam_Data->u8Data00050000,4);
	MemCopy(pstAlarm_Info->u8Data00060000,pstRam_Data->u8Data00060000,4);
	MemCopy(pstAlarm_Info->u8Data00070000,pstRam_Data->u8Data00070000,4);
	MemCopy(pstAlarm_Info->u8Data00080000,pstRam_Data->u8Data00080000,4);
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，表盖开启告警,ARD11
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Alarm_E200004E(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取表盖开启次数0x03300D00中
	 */
	QCSG_ALARM_E200004E_LIST_S* pstAlarm_List = (QCSG_ALARM_E200004E_LIST_S*)QCSG_ALARM_E200004E_LIST;
	QCSG_ALARM_E200004E_INFO_S* pstAlarm_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ARD11Struct stARD11Data;	
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;

	u32 u32ValueList[6];//err20180925 添加开盖告警的发生前数据 
	u8 u8NewData03300D00[3];//err20180925 添加端钮盖与表盖打开次数在上报告警数据

	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckAlarmConfig(0xE200004E) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pstAlarm_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200004E_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstAlarm_List->stE200004EData[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstAlarm_List,0,sizeof(QCSG_ALARM_E200004E_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstAlarm_List->stE200004EData[i].u16Pn)
		{
			pstAlarm_Info = &pstAlarm_List->stE200004EData[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstAlarm_Info = &pstAlarm_List->stE200004EData[u8PnNum];
			pstAlarm_Info->u16Pn = u16Pn;
			MemCopy(pstAlarm_Info->u8Data03300D00,&pstDlt645Frame_Info->u8RevBuf[14],3);
			//err20180925 添加开盖告警的发生前数据 
			MemCopy(pstAlarm_Info->u8Data00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);
			MemCopy(pstAlarm_Info->u8Data00050000,pstRam_Data->u8Data00050000,4);
			MemCopy(pstAlarm_Info->u8Data00060000,pstRam_Data->u8Data00060000,4);
			MemCopy(pstAlarm_Info->u8Data00070000,pstRam_Data->u8Data00070000,4);
			MemCopy(pstAlarm_Info->u8Data00080000,pstRam_Data->u8Data00080000,4);
			
			pstAlarm_List->u8PnNum ++;
		}
		return;
	}	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	if(memcmp(pstAlarm_Info->u8Data03300D00,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
	{
		MemCopy(u8NewData03300D00,&pstDlt645Frame_Info->u8RevBuf[14],3);//err20180925 添加端钮盖与表盖打开次数在上报告警数据
		MemCopy(&u32ValueList[0],pstAlarm_Info->u8Data00010000,4);//err20180925 添加开盖告警的发生前数据 
		MemCopy(&u32ValueList[1],pstAlarm_Info->u8Data00020000,4);
		MemCopy(&u32ValueList[2],pstAlarm_Info->u8Data00050000,4);
		MemCopy(&u32ValueList[3],pstAlarm_Info->u8Data00060000,4);
		MemCopy(&u32ValueList[4],pstAlarm_Info->u8Data00070000,4);
		MemCopy(&u32ValueList[5],pstAlarm_Info->u8Data00080000,4);
		//产生发生事件
		MemSet(&stYYTime,0,sizeof(stYYTime));
		RD_Time_TO_YYTime(pstTime,&stYYTime);
		RD_Write_ARD11_Data(1,pstTime,u8NewData03300D00,u32ValueList,pstRam_Data,&stARD11Data);//err20180925 添加端钮盖与表盖打开次数在上报告警数据
		u32ReadLen = sizeof(stARD11Data);
		NAND_WriteAlarmRecord(pu8MeterId,0xE200004E,&stYYTime,(u8*)&stARD11Data,&u32ReadLen);
		TerminalSetLastAlarmDI(0xE200004E);
		if(QCSG_CheckAlarmReport(0xE200004E) == TRUE)
		{
			TerminalReportAlarmInc();
		}			
	}
	MemCopy(pstAlarm_Info->u8Data03300D00,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	//err20180925 添加开盖告警的发生前数据 
	MemCopy(pstAlarm_Info->u8Data00010000,pstRam_Data->u8Data00010000,4);
	MemCopy(pstAlarm_Info->u8Data00020000,pstRam_Data->u8Data00020000,4);
	MemCopy(pstAlarm_Info->u8Data00050000,pstRam_Data->u8Data00050000,4);
	MemCopy(pstAlarm_Info->u8Data00060000,pstRam_Data->u8Data00060000,4);
	MemCopy(pstAlarm_Info->u8Data00070000,pstRam_Data->u8Data00070000,4);
	MemCopy(pstAlarm_Info->u8Data00080000,pstRam_Data->u8Data00080000,4);
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，失压记录,ERD3
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Event_E2010004(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_EVENT_E2010004_06_LIST_S* pstEvent_List = (QCSG_EVENT_E2010004_06_LIST_S*)QCSG_EVENT_E2010004_LIST;
	QCSG_EVENT_ERD3_INFO_S* pstEvent_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
	RealTimeYYStruct stYYTime;
	ERD03Struct stERD03Data;
	u8 u8PnNum = 0,u8Meterphase = 0x04,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0;
	u32 u32Ia = 0,u32In = 0,u32Ua = 0,u32Un = 0,u32ReadLen = 0;	

	if(QCSG_CheckEventMask(0xE2010004) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) != TRUE)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstRam_Data->u8Data0201FF00[0],6) != TRUE)
	{
		return;
	}	
	u8PnNum = pstEvent_List->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		if(u16Pn == pstEvent_List->stERD3Data[i].u16Pn)
		{
			pstEvent_Info = &pstEvent_List->stERD3Data[i];
			break;
		}						
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEvent_Info = &pstEvent_List->stERD3Data[u8PnNum];
			pstEvent_Info->u16Pn = u16Pn;
			pstEvent_Info->u8EventFlag = 0xFF;
			pstEvent_List->u8PnNum++;
		}
		else
		{
			return;
		}
	}
	//读取越限阀值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE080010C,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		u16UpLimitValue = QCSG_BCD2HEX(0x78) * 100;
		u16LowLimitValue = QCSG_BCD2HEX(0x85) * 100;
	}
	else
	{
		MemCopy(&u16UpLimitValue,&stPowerQualityPara.E080010C[0],2);
		MemCopy(&u16LowLimitValue,&stPowerQualityPara.E080010C[1],2);
		if(QCSG_BCDCheck((u8*)&u16UpLimitValue,2) != TRUE)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x78) * 100;
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX((u8)(u16UpLimitValue>>8)) * 100 + QCSG_BCD2HEX((u8)u16UpLimitValue);
		}
		if(QCSG_BCDCheck((u8*)&u16LowLimitValue,2) != TRUE)
		{
			u16LowLimitValue = QCSG_BCD2HEX(0x85) * 100;
		}
		else
		{
			u16LowLimitValue = QCSG_BCD2HEX((u8)(u16LowLimitValue>>8)) * 100 + QCSG_BCD2HEX((u8)u16LowLimitValue);
		}
	}
	//读取测量点接线方式、额定电压、额定电流
	u32ReadLen = sizeof(MeasurePointStruct);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800010,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u8Meterphase = 0x04;
		u32In = JC_IN;
		u32Un = JC_UN;
	}
	else
	{
		u8Meterphase = stPnPara.ConnectionType;
		if(u8Meterphase > 0x04)
		{
			u8Meterphase = 0x04;
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
		{
			u32In = JC_IN;
		}
		else
		{
			u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);		
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
		{
			u32Un = JC_UN;
		}
		else
		{
			u32Un = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);
		}	
	}
	MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
	u32Ia = u32Ia & 0x007FFFFF;
	u32Ia = QCSG_BCD2HEX((u8)(u32Ia>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ia>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ia);
	MemCopy(&u32Ua,&pstRam_Data->u8Data0201FF00[0],2);	
	u32Ua = QCSG_BCD2HEX((u8)(u32Ua>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ua);
	if((u32Ia * 1000) < (5 * u32In))
	{
		return;
	}
	if(pstEvent_Info->u8EventFlag == 0xFF)
	{
		if((u32Ua * 10000) < (u32Un * u16UpLimitValue))	
		{
			MemCopy(&pstEvent_Info->stStartTime,pstTime,sizeof(TIME_PARAM_S));
			MemCopy(pstEvent_Info->u8Start00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstEvent_Info->u8Start00020000,pstRam_Data->u8Data00020000,4);
			MemCopy(pstEvent_Info->u8Start00030000,pstRam_Data->u8Data00030000,4);
			MemCopy(pstEvent_Info->u8Start00040000,pstRam_Data->u8Data00040000,4);	
			pstEvent_Info->u8EventFlag = 0x01;			
		}
	}
	if(pstEvent_Info->u8EventFlag == 0x01)
	{
		if((u32Ua * 10000) > (u32Un * u16LowLimitValue))
		{
			u8PnNum = pstEvent_List->u8PnNum;
			for(i = 0;i < u8PnNum;i++)
			{
				if(u16Pn == pstEvent_List->stERD3Data[i].u16Pn)
				{
					pstEvent_Info = &pstEvent_List->stERD3Data[i];
					break;
				}						
			}
			if(i < u8PnNum)
			{
				MemCopy(&pstEvent_Info->stEndTime,pstTime,sizeof(TIME_PARAM_S));
				MemCopy(pstEvent_Info->u8End00010000,pstRam_Data->u8Data00010000,4);
				MemCopy(pstEvent_Info->u8End00020000,pstRam_Data->u8Data00020000,4);
				MemCopy(pstEvent_Info->u8End00030000,pstRam_Data->u8Data00030000,4);
				MemCopy(pstEvent_Info->u8End00040000,pstRam_Data->u8Data00040000,4);
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ERD3_Data(pstEvent_Info,&stERD03Data);
				u32ReadLen = sizeof(stERD03Data);
				NAND_WriteEventRecord(pu8MeterId,0xE2010004,&stYYTime,(u8*)&stERD03Data,&u32ReadLen);
				pstEvent_Info->u8EventFlag = 0xFF;
			}	
		}		
	}
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，失压记录,ERD3
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Event_E2010005(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_EVENT_E2010004_06_LIST_S* pstEvent_List = (QCSG_EVENT_E2010004_06_LIST_S*)QCSG_EVENT_E2010005_LIST;
	QCSG_EVENT_ERD3_INFO_S* pstEvent_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
	RealTimeYYStruct stYYTime;
	ERD03Struct stERD03Data;
	u8 u8PnNum = 0,u8Meterphase = 0x04,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0;
	u32 u32Ib = 0,u32In = 0,u32Ub = 0,u32Un = 0,u32ReadLen = 0;	

	if(QCSG_CheckEventMask(0xE2010005) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) != TRUE)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstRam_Data->u8Data0201FF00[0],6) != TRUE)
	{
		return;
	}	
	u8PnNum = pstEvent_List->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		if(u16Pn == pstEvent_List->stERD3Data[i].u16Pn)
		{
			pstEvent_Info = &pstEvent_List->stERD3Data[i];
			break;
		}						
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEvent_Info = &pstEvent_List->stERD3Data[u8PnNum];
			pstEvent_Info->u16Pn = u16Pn;
			pstEvent_Info->u8EventFlag = 0xFF;
			pstEvent_List->u8PnNum++;
		}
		else
		{
			return;
		}
	}
	//读取越限阀值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE080010C,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		u16UpLimitValue = QCSG_BCD2HEX(0x78) * 100;
		u16LowLimitValue = QCSG_BCD2HEX(0x85) * 100;
	}
	else
	{
		MemCopy(&u16UpLimitValue,&stPowerQualityPara.E080010C[0],2);
		MemCopy(&u16LowLimitValue,&stPowerQualityPara.E080010C[1],2);
		if(QCSG_BCDCheck((u8*)&u16UpLimitValue,2) != TRUE)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x78) * 100;
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX((u8)(u16UpLimitValue>>8)) * 100 + QCSG_BCD2HEX((u8)u16UpLimitValue);
		}
		if(QCSG_BCDCheck((u8*)&u16LowLimitValue,2) != TRUE)
		{
			u16LowLimitValue = QCSG_BCD2HEX(0x85) * 100;
		}
		else
		{
			u16LowLimitValue = QCSG_BCD2HEX((u8)(u16LowLimitValue>>8)) * 100 + QCSG_BCD2HEX((u8)u16LowLimitValue);
		}
	}
	//读取测量点接线方式、额定电压、额定电流
	u32ReadLen = sizeof(MeasurePointStruct);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800010,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u8Meterphase = 0x04;
		u32In = JC_IN;
		u32Un = JC_UN;
	}
	else
	{
		u8Meterphase = stPnPara.ConnectionType;
		if(u8Meterphase > 0x04)
		{
			u8Meterphase = 0x04;
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
		{
			u32In = JC_IN;
		}
		else
		{
			u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);		
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
		{
			u32Un = JC_UN;
		}
		else
		{
			u32Un = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);
		}	
	}
	MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
	u32Ib = u32Ib & 0x007FFFFF;
	u32Ib = QCSG_BCD2HEX((u8)(u32Ib>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ib>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ib);
	MemCopy(&u32Ub,&pstRam_Data->u8Data0201FF00[2],2);	
	u32Ub = QCSG_BCD2HEX((u8)(u32Ub>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ub);
	if((u32Ib * 1000) < (5 * u32In))
	{
		return;
	}
	if(pstEvent_Info->u8EventFlag == 0xFF)
	{
		if((u32Ub * 10000) < (u32Un * u16UpLimitValue))	
		{
			MemCopy(&pstEvent_Info->stStartTime,pstTime,sizeof(TIME_PARAM_S));
			MemCopy(pstEvent_Info->u8Start00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstEvent_Info->u8Start00020000,pstRam_Data->u8Data00020000,4);
			MemCopy(pstEvent_Info->u8Start00030000,pstRam_Data->u8Data00030000,4);
			MemCopy(pstEvent_Info->u8Start00040000,pstRam_Data->u8Data00040000,4);	
			pstEvent_Info->u8EventFlag = 0x01;			
		}
	}
	if(pstEvent_Info->u8EventFlag == 0x01)
	{
		if((u32Ub * 10000) > (u32Un * u16LowLimitValue))
		{
			u8PnNum = pstEvent_List->u8PnNum;
			for(i = 0;i < u8PnNum;i++)
			{
				if(u16Pn == pstEvent_List->stERD3Data[i].u16Pn)
				{
					pstEvent_Info = &pstEvent_List->stERD3Data[i];
					break;
				}						
			}
			if(i < u8PnNum)
			{
				MemCopy(&pstEvent_Info->stEndTime,pstTime,sizeof(TIME_PARAM_S));
				MemCopy(pstEvent_Info->u8End00010000,pstRam_Data->u8Data00010000,4);
				MemCopy(pstEvent_Info->u8End00020000,pstRam_Data->u8Data00020000,4);
				MemCopy(pstEvent_Info->u8End00030000,pstRam_Data->u8Data00030000,4);
				MemCopy(pstEvent_Info->u8End00040000,pstRam_Data->u8Data00040000,4);
				RD_Time_TO_YYTime(pstTime,&stYYTime);
				RD_Write_ERD3_Data(pstEvent_Info,&stERD03Data);
				u32ReadLen = sizeof(stERD03Data);
				NAND_WriteEventRecord(pu8MeterId,0xE2010005,&stYYTime,(u8*)&stERD03Data,&u32ReadLen);
				pstEvent_Info->u8EventFlag = 0xFF;
			}	
		}		
	}
}
/**--------------------------------------------------------------------
*功    能:事件记录处理，失压记录,ERD3
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Event_E2010006(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_EVENT_E2010004_06_LIST_S* pstEvent_List = (QCSG_EVENT_E2010004_06_LIST_S*)QCSG_EVENT_E2010006_LIST;
	QCSG_EVENT_ERD3_INFO_S* pstEvent_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
	RealTimeYYStruct stYYTime;
	ERD03Struct stERD03Data;
	u8 u8PnNum = 0,u8Meterphase = 0x04,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0;
	u32 u32Ic = 0,u32In = 0,u32Uc = 0,u32Un = 0,u32ReadLen = 0;	

