gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	}	
	if(pstEvent_Info->u8EventFlag == 0x01)
	{
		if((u32Ub * 10000) > (u32Un * u16LowLimitValue)) //判断事件恢复
		{
			//此时记录事件结束时 时间与电量数据
			MemCopy(&pstEvent_Info->stEndTime,pstTime,sizeof(TIME_PARAM_S));
			MemCopy(pstEvent_Info->u8End00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstEvent_Info->u8End00020000,pstRam_Data->u8Data00020000,4);
			MemCopy(pstEvent_Info->u8End00030000,pstRam_Data->u8Data00030000,4);
			MemCopy(pstEvent_Info->u8End00040000,pstRam_Data->u8Data00040000,4);

			//记录事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ERD3_Data(pstEvent_Info,&stERD03Data);
			u32ReadLen = sizeof(stERD03Data);
			NAND_WriteEventRecord(pu8MeterId,0xE201000C,&stYYTime,(u8*)&stERD03Data,&u32ReadLen);
			pstEvent_Info->u8EventFlag = 0xFF;
		}	
	}	
}

//err20181105 增加断相事件
/**--------------------------------------------------------------------
*功    能:事件记录处理，C相断相记录,ERD3
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Event_E201000D(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取电流数据块0x0202FF00中
	 */
	QCSG_EVENT_E201000B_0D_LIST_S* pstEvent_List = (QCSG_EVENT_E201000B_0D_LIST_S*)QCSG_EVENT_E201000D_LIST;
	QCSG_EVENT_ERD3_INFO_S* pstEvent_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	//ThresholdParaStruct stThresholdPara;
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
	RealTimeYYStruct stYYTime;
	ERD03Struct stERD03Data;
	u8 u8PnNum = 0,u8Meterphase = 0x04,u8CtrlCode = 0,i = 0;
	u16 u16UpLimitValue = 0,u16LowLimitValue = 0;
	u32 u32ReadLen = 0;
	u32 u32Ic = 0,u32In = 0,u32Uc = 0,u32Un = 0;
	
	if((QCSG_CheckEventMask(0xE201000D) != TRUE))
	{
		return;
	}
	//u32CurrTick = HAL_GetSystemTick();
	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) != TRUE)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstRam_Data->u8Data0201FF00[0],6) != TRUE)
	{
		return;
	}


	u8PnNum = pstEvent_List->u8PnNum; 
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E201000B_0D_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstEvent_List->stERD3Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}	
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E201000B_0D_LIST_S)); 	
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstEvent_List->stERD3Data[i].u16Pn)
		{
			pstEvent_Info = &pstEvent_List->stERD3Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEvent_Info = &pstEvent_List->stERD3Data[u8PnNum];
			pstEvent_Info->u16Pn = u16Pn;
			pstEvent_Info->u8EventFlag = 0xFF;
			pstEvent_List->u8PnNum ++;
		}
		return;
	}
	

	//读取越限阀值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE080010C,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		u16UpLimitValue = QCSG_BCD2HEX(0x78) * 100;
		u16LowLimitValue = QCSG_BCD2HEX(0x85) * 100;
	}
	else
	{
		MemCopy(&u16UpLimitValue,&stPowerQualityPara.E080010C[0],2);
		MemCopy(&u16LowLimitValue,&stPowerQualityPara.E080010C[1],2);
		if(QCSG_BCDCheck((u8*)&u16UpLimitValue,2) != TRUE)
		{
			u16UpLimitValue = QCSG_BCD2HEX(0x78) * 100;
		}
		else
		{
			u16UpLimitValue = QCSG_BCD2HEX((u8)(u16UpLimitValue>>8)) * 100 + QCSG_BCD2HEX((u8)u16UpLimitValue);
		}
		if(QCSG_BCDCheck((u8*)&u16LowLimitValue,2) != TRUE)
		{
			u16LowLimitValue = QCSG_BCD2HEX(0x85) * 100;
		}
		else
		{
			u16LowLimitValue = QCSG_BCD2HEX((u8)(u16LowLimitValue>>8)) * 100 + QCSG_BCD2HEX((u8)u16LowLimitValue);
		}
	}
	//读取测量点接线方式、额定电压、额定电流
	u32ReadLen = sizeof(MeasurePointStruct);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800010,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u8Meterphase = 0x04;
		u32In = JC_IN;
		u32Un = JC_UN;
	}
	else
	{
		u8Meterphase = stPnPara.ConnectionType;
		if(u8Meterphase > 0x04)
		{
			u8Meterphase = 0x04;
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
		{
			u32In = JC_IN;
		}
		else
		{
			u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);		
		}
		if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
		{
			u32Un = JC_UN;
		}
		else
		{
			u32Un = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);
		}			
	}
	MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
	u32Ic = u32Ic & 0x007FFFFF;
	u32Ic = QCSG_BCD2HEX((u8)(u32Ic>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ic>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ic);
	MemCopy(&u32Uc,&pstRam_Data->u8Data0201FF00[4],2);
	u32Uc = QCSG_BCD2HEX((u8)(u32Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u32Uc);

	if(pstEvent_Info->u8EventFlag == 0xFF)
	{
		if((u32Ic * 1000) > (5 * u32In))
		{
			return;
		}
		if((u32Uc * 10000) < (u32Un * u16UpLimitValue)) //判断事件发生
		{
			//此时不记录事件，只是记录事件发生时 时间与电量数据
			MemCopy(&pstEvent_Info->stStartTime,pstTime,sizeof(TIME_PARAM_S));
			MemCopy(pstEvent_Info->u8Start00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstEvent_Info->u8Start00020000,pstRam_Data->u8Data00020000,4);
			MemCopy(pstEvent_Info->u8Start00030000,pstRam_Data->u8Data00030000,4);
			MemCopy(pstEvent_Info->u8Start00040000,pstRam_Data->u8Data00040000,4);	
			pstEvent_Info->u8EventFlag = 0x01;	
		}		
		
	}	
	if(pstEvent_Info->u8EventFlag == 0x01)
	{
		if((u32Uc * 10000) > (u32Un * u16LowLimitValue)) //判断事件恢复
		{
			//此时记录事件结束时 时间与电量数据
			MemCopy(&pstEvent_Info->stEndTime,pstTime,sizeof(TIME_PARAM_S));
			MemCopy(pstEvent_Info->u8End00010000,pstRam_Data->u8Data00010000,4);
			MemCopy(pstEvent_Info->u8End00020000,pstRam_Data->u8Data00020000,4);
			MemCopy(pstEvent_Info->u8End00030000,pstRam_Data->u8Data00030000,4);
			MemCopy(pstEvent_Info->u8End00040000,pstRam_Data->u8Data00040000,4);

