gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
			//记录事件
			MemSet(&stYYTime,0,sizeof(stYYTime));
			RD_Time_TO_YYTime(pstTime,&stYYTime);
			RD_Write_ERD3_Data(pstEvent_Info,&stERD03Data);
			u32ReadLen = sizeof(stERD03Data);
			NAND_WriteEventRecord(pu8MeterId,0xE201000D,&stYYTime,(u8*)&stERD03Data,&u32ReadLen);
			pstEvent_Info->u8EventFlag = 0xFF;
		}	
	}	
}

//err20181107 增加事件 校时记录
/**--------------------------------------------------------------------
*功    能:事件记录处理，校时记录事件,ERD9
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Event_E2010010(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取校时总次数0x03300400中
	 */
	QCSG_EVENT_E2010010_LIST_S* pstEvent_List = (QCSG_EVENT_E2010010_LIST_S*)QCSG_EVENT_E2010010_LIST;
	QCSG_EVENT_E2010010_INFO_S* pstEvent_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	ERD09Struct stERD09Data;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;

	//QCSG_EVENT_ERD3_INFO_S pstEvent_Info_ERD3;

	//国网上位机直接对交采校时，交采的校时总次数会+1，可以产生告警。
	//若直接用南网上位机对终端校时，则交采的时间会与终端同步，但是交采总次数不变。
	//故将终端校时的事件记录放在AFN04的函数中产生。
	//if(u16Pn == 0)
	//{
		//终端自身不产生该事件
	//	return;
	//}
	if(QCSG_CheckEventMask(0xE2010010) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	u8PnNum = pstEvent_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E2010010_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstEvent_List->stE2010010Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E2010010_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstEvent_List->stE2010010Data[i].u16Pn)
		{
			pstEvent_Info = &pstEvent_List->stE2010010Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEvent_Info = &pstEvent_List->stE2010010Data[u8PnNum];
			pstEvent_Info->u16Pn = u16Pn;
			MemCopy(pstEvent_Info->u8Data03300400,&pstDlt645Frame_Info->u8RevBuf[14],3);
			pstEvent_List->u8PnNum ++;
		}
		return;
	}	
	if(memcmp(pstEvent_Info->u8Data03300400,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
	{
		//记录事件发生时 时间与电量数据
		MemCopy(&stERD09Data.Time,pstTime,sizeof(TIME_PARAM_S));
		MemCopy(stERD09Data.C_00010000,pstRam_Data->u8Data00010000,4);
		MemCopy(stERD09Data.C_00020000,pstRam_Data->u8Data00020000,4);
		
		//记录事件
		MemSet(&stYYTime,0,sizeof(stYYTime));
		RD_Time_TO_YYTime(pstTime,&stYYTime);
		u32ReadLen = sizeof(stERD09Data);
		NAND_WriteEventRecord(pu8MeterId,0xE2010010,&stYYTime,(u8*)&stERD09Data,&u32ReadLen);
	}
	MemCopy(pstEvent_Info->u8Data03300400,&pstDlt645Frame_Info->u8RevBuf[14],3);

}




//err20181106 增加事件 表端钮盒开启记录
/**--------------------------------------------------------------------
*功    能:事件记录处理，端钮盒开盖事件,ERD3
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Event_E2010011(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 * TODO:与技术规范一致，函数挂在读取端钮盒开盖次数0x03300E00中
	 * err20190509 由于事件后数据需要，增加抄读上一次端钮盒开启事件记录0x03300E01.
	 * 所以将端钮盒开启次数抄读并存储，在表内事件记录抄读完成后再判断产生事件
	 */
	QCSG_EVENT_E2010011_LIST_S* pstEvent_List = (QCSG_EVENT_E2010011_LIST_S*)QCSG_EVENT_E2010011_LIST;
	QCSG_EVENT_E2010011_INFO_S* pstEvent_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	//ARD11Struct stARD11Data;	
	ERD03Struct stERD03Data;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;

	QCSG_EVENT_ERD3_INFO_S pstEvent_Info_ERD3;
	//u32 u32ValueList[6];//err20180925 添加开盖告警的发生前数据 
	//u8 u8NewData03300E00[3];//err20180925 添加端钮盖与表盖打开次数在上报告警数据
	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckEventMask(0xE2010011) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	u8PnNum = pstEvent_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E2010011_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstEvent_List->stE2010011Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E2010011_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstEvent_List->stE2010011Data[i].u16Pn)
		{
			pstEvent_Info = &pstEvent_List->stE2010011Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEvent_Info = &pstEvent_List->stE2010011Data[u8PnNum];
			pstEvent_Info->u16Pn = u16Pn;
			MemCopy(pstEvent_Info->u8Data03300E00,&pstDlt645Frame_Info->u8RevBuf[14],3);
			pstEvent_List->u8PnNum ++;
		}
		return;
	}	
	if(memcmp(pstEvent_Info->u8Data03300E00,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
	{
		//记录事件发生时 时间与电量数据
		MemCopy(&pstEvent_Info_ERD3.stStartTime,pstTime,sizeof(TIME_PARAM_S));
		MemCopy(pstEvent_Info_ERD3.u8Start00010000,pstRam_Data->u8Data00010000,4);
		MemCopy(pstEvent_Info_ERD3.u8Start00020000,pstRam_Data->u8Data00020000,4);
		MemCopy(pstEvent_Info_ERD3.u8Start00030000,pstRam_Data->u8Data00030000,4);
		MemCopy(pstEvent_Info_ERD3.u8Start00040000,pstRam_Data->u8Data00040000,4);	

		//此时记录事件结束时 时间与电量数据
		MemCopy(&pstEvent_Info_ERD3.stEndTime,pstTime,sizeof(TIME_PARAM_S));
		MemCopy(pstEvent_Info_ERD3.u8End00010000,pstRam_Data->u8Data00010000,4);
		MemCopy(pstEvent_Info_ERD3.u8End00020000,pstRam_Data->u8Data00020000,4);
		MemCopy(pstEvent_Info_ERD3.u8End00030000,pstRam_Data->u8Data00030000,4);
		MemCopy(pstEvent_Info_ERD3.u8End00040000,pstRam_Data->u8Data00040000,4);
		
