gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
		//记录事件
		MemSet(&stYYTime,0,sizeof(stYYTime));
		RD_Time_TO_YYTime(pstTime,&stYYTime);
		RD_Write_ERD3_Data(&pstEvent_Info_ERD3,&stERD03Data);
		u32ReadLen = sizeof(stERD03Data);
		NAND_WriteEventRecord(pu8MeterId,0xE2010011,&stYYTime,(u8*)&stERD03Data,&u32ReadLen);
	}
	MemCopy(pstEvent_Info->u8Data03300E00,&pstDlt645Frame_Info->u8RevBuf[14],3);

}

//err20181107 增加事件 表盖开启记录
/**--------------------------------------------------------------------
*功    能:事件记录处理，表盖开启记录事件,ERD3
*输入参数:pstTime，u16Pn，pu8MeterId，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Event_E2010012(TIME_PARAM_S* pstTime,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	/*
	 *	TODO:与技术规范一致，函数挂在读取表盖开启次数0x03300D00中
	 */
	QCSG_EVENT_E2010012_LIST_S* pstEvent_List = (QCSG_EVENT_E2010012_LIST_S*)QCSG_EVENT_E2010012_LIST;
	QCSG_EVENT_E2010012_INFO_S* pstEvent_Info = NULL;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	RealTimeYYStruct stYYTime;
	//ARD11Struct stARD11Data;	
	ERD03Struct stERD03Data;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32ReadLen = 0;

	QCSG_EVENT_ERD3_INFO_S pstEvent_Info_ERD3;

	
	if(u16Pn == 0)
	{
		//终端自身不产生该事件
		return;
	}
	if(QCSG_CheckEventMask(0xE2010012) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	u8PnNum = pstEvent_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E2010012_LIST_S));
	}
	for(i = 0; i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstEvent_List->stE2010012Data[i].u16Pn,1) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstEvent_List,0,sizeof(QCSG_EVENT_E2010012_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstEvent_List->stE2010012Data[i].u16Pn)
		{
			pstEvent_Info = &pstEvent_List->stE2010012Data[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEvent_Info = &pstEvent_List->stE2010012Data[u8PnNum];
			pstEvent_Info->u16Pn = u16Pn;
			MemCopy(pstEvent_Info->u8Data03300D00,&pstDlt645Frame_Info->u8RevBuf[14],3);
			pstEvent_List->u8PnNum ++;
		}
		return;
	}	
	if(memcmp(pstEvent_Info->u8Data03300D00,&pstDlt645Frame_Info->u8RevBuf[14],3) != 0)
	{
		//记录事件发生时 时间与电量数据
		MemCopy(&pstEvent_Info_ERD3.stStartTime,pstTime,sizeof(TIME_PARAM_S));
		MemCopy(pstEvent_Info_ERD3.u8Start00010000,pstRam_Data->u8Data00010000,4);
		MemCopy(pstEvent_Info_ERD3.u8Start00020000,pstRam_Data->u8Data00020000,4);
		MemCopy(pstEvent_Info_ERD3.u8Start00030000,pstRam_Data->u8Data00030000,4);
		MemCopy(pstEvent_Info_ERD3.u8Start00040000,pstRam_Data->u8Data00040000,4);	

		//此时记录事件结束时 时间与电量数据
		MemCopy(&pstEvent_Info_ERD3.stEndTime,pstTime,sizeof(TIME_PARAM_S));
		MemCopy(pstEvent_Info_ERD3.u8End00010000,pstRam_Data->u8Data00010000,4);
		MemCopy(pstEvent_Info_ERD3.u8End00020000,pstRam_Data->u8Data00020000,4);
		MemCopy(pstEvent_Info_ERD3.u8End00030000,pstRam_Data->u8Data00030000,4);
		MemCopy(pstEvent_Info_ERD3.u8End00040000,pstRam_Data->u8Data00040000,4);
		
		//记录事件
		MemSet(&stYYTime,0,sizeof(stYYTime));
		RD_Time_TO_YYTime(pstTime,&stYYTime);
		RD_Write_ERD3_Data(&pstEvent_Info_ERD3,&stERD03Data);
		u32ReadLen = sizeof(stERD03Data);
		NAND_WriteEventRecord(pu8MeterId,0xE2010012,&stYYTime,(u8*)&stERD03Data,&u32ReadLen);
	}
	MemCopy(pstEvent_Info->u8Data03300D00,&pstDlt645Frame_Info->u8RevBuf[14],3);

}


/**--------------------------------------------------------------------
*功    能:统计数据，停电统计，终端支持
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000020_21_CL3200(u8 u8Cycle,u16 u16Pn,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	TIME_PARAM_S stCurr_Time;
	MeasurePointStruct stPnPara;
	u8 u8CtrlCode = 0;
	u16 u16Ua = 0,u16Ub = 0,u16Uc = 0,u16RatedVoltage = 0;	
	u32 u32ReadLen = 0,u32PowerDownNum_Day = 0,u32PowerDownTime_Day = 0,u32PowerDownNum_Month = 0,u32PowerDownTime_Month = 0;
	u32* pu32PowerDownNum_Day = (u32*)QCSG_POWER_DOWN_NUM_DAY;
	u32* pu32PowerDownTime_Day = (u32*)QCSG_POWER_DOWN_TIME_DAY;
	u32* pu32PowerDownNum_Month = (u32*)QCSG_POWER_DOWN_NUM_MONTH;
	u32* pu32PowerDownTime_Month = (u32*)QCSG_POWER_DOWN_TIME_MONTH;
	u32* pu32Flag_Day = (u32*)QCSG_POWER_DOWN_DAY_FLAG;
	u32* pu32Flag_Month = (u32*)QCSG_POWER_DOWN_MONTH_FLAG;
	
	if(u8Cycle == 0)
	{
		return;
	}
	if(u16Pn != 0)
	{
		return;
	}
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],6) != TRUE)
	{
		return;
	}
	MemCopy(&u16Ua,&pstDlt645Frame_Info->u8RevBuf[14],2);
	MemCopy(&u16Ub,&pstDlt645Frame_Info->u8RevBuf[16],2);
	MemCopy(&u16Uc,&pstDlt645Frame_Info->u8RevBuf[18],2);	
	u16Ua = QCSG_BCD2HEX((u8)(u16Ua>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ua);
	u16Ub = QCSG_BCD2HEX((u8)(u16Ub>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ub);
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	u16RatedVoltage = stPnPara.RatedVoltage;
	u16RatedVoltage = QCSG_BCD2HEX((u8)(u16RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)u16RatedVoltage);
	if((u16Ua * 100 < u16RatedVoltage * 60)&&(u16Ub * 100 < u16RatedVoltage * 60)&&(u16Uc * 100 < u16RatedVoltage * 60))
	{
		u32PowerDownTime_Day = *pu32PowerDownTime_Day;
		u32PowerDownTime_Month = *pu32PowerDownTime_Month;	
		u32PowerDownTime_Day &= 0xFFFFFF;
		u32PowerDownTime_Month &= 0xFFFFFF;
		u32PowerDownTime_Day += u8Cycle;
		u32PowerDownTime_Month += u8Cycle;	
		(*pu32PowerDownTime_Day) = u32PowerDownTime_Day;		
		(*pu32PowerDownTime_Month) = u32PowerDownTime_Month;	
		if((*pu32Flag_Day) == 0x00)
		{
			(*pu32Flag_Day) = 1;
			u32PowerDownNum_Day	= *pu32PowerDownNum_Day;
			u32PowerDownNum_Day &= 0xFFFFFF;
			u32PowerDownNum_Day ++;
			(*pu32PowerDownNum_Day) = u32PowerDownNum_Day;	
		}
		if((*pu32Flag_Month) == 0x00)
		{
			(*pu32Flag_Month) = 1;
			u32PowerDownNum_Month = *pu32PowerDownNum_Month;
			u32PowerDownNum_Month &= 0xFFFFFF;
			u32PowerDownNum_Month ++;		
			(*pu32PowerDownNum_Month) = u32PowerDownNum_Month;		
		}
	}
	else
	{
		(*pu32Flag_Day) = 0;
		(*pu32Flag_Month) = 0;		
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据，停电统计，终端支持
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000020_21(u8 u8Cycle,u16 u16Pn,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	TIME_PARAM_S stCurr_Time;
	MeasurePointStruct stPnPara;
	u8 u8CtrlCode = 0,u8PnNum = 0,i = 0;
	u16 u16Ua = 0,u16Ub = 0,u16Uc = 0,u16Un = 0;	
	u32 u32Ia = 0,u32Ib = 0,u32Ic = 0,u32In = 0;
	u32 u32ReadLen = 0,u32PowerDownNum_Day = 0,u32PowerDownTime_Day = 0,u32PowerDownNum_Month = 0,u32PowerDownTime_Month = 0;
	u32* pu32PowerDownNum_Day = (u32*)QCSG_POWER_DOWN_NUM_DAY;
	u32* pu32PowerDownTime_Day = (u32*)QCSG_POWER_DOWN_TIME_DAY;
	u32* pu32PowerDownNum_Month = (u32*)QCSG_POWER_DOWN_NUM_MONTH;
	u32* pu32PowerDownTime_Month = (u32*)QCSG_POWER_DOWN_TIME_MONTH;
	u32* pu32Flag_Day = (u32*)QCSG_POWER_DOWN_DAY_FLAG;
	u32* pu32Flag_Month = (u32*)QCSG_POWER_DOWN_MONTH_FLAG;
	
	if(u8Cycle == 0)
	{
		return;
	}
	if(u16Pn != 0)
	{
		return;
	}
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) != TRUE)
	{
		return;
	}
	MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
	MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
	MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);	
	u32Ia = u32Ia & 0x007FFFFF;
	u32Ia = QCSG_BCD2HEX((u8)(u32Ia>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ia>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ia);
	u32Ib = u32Ib & 0x007FFFFF;
	u32Ib = QCSG_BCD2HEX((u8)(u32Ib>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ib>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ib);	
	u32Ic = u32Ic & 0x007FFFFF;
	u32Ic = QCSG_BCD2HEX((u8)(u32Ic>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ic>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ic);
	MemCopy(&u16Ua,&pstRam_Data->u8Data0201FF00[0],2);
	MemCopy(&u16Ub,&pstRam_Data->u8Data0201FF00[2],2);
	MemCopy(&u16Uc,&pstRam_Data->u8Data0201FF00[4],2);	
	u16Ua = QCSG_BCD2HEX((u8)(u16Ua>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ua);
	u16Ub = QCSG_BCD2HEX((u8)(u16Ub>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ub);
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		u32In = JC_IN;
		u16Un = JC_UN;
	}
	if(QCSG_BCDCheck((u8*)&stPnPara.RatedCurrent,3) != TRUE)
	{
		u32In = JC_IN;
	}
	else
	{
		u32In = QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>16))* 10000 + QCSG_BCD2HEX((u8)(stPnPara.RatedCurrent>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedCurrent);	
	}
	if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
	{
		u16Un = JC_UN;
	}
	else
	{			
		u16Un = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8))* 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);
	}
	if((u16Ua * 100 < u16Un * 60)&&(u16Ub * 100 < u16Un * 60)&&(u16Uc * 100 < u16Un * 60)
	 &&(u32Ia * 1000 < u32In * 5)&&(u32Ib * 1000 < u32In * 5)&&(u32Ic * 1000 < u32In * 5))
	{
		u32PowerDownTime_Day = *pu32PowerDownTime_Day;
		u32PowerDownTime_Month = *pu32PowerDownTime_Month;	
		u32PowerDownTime_Day &= 0xFFFFFF;
		u32PowerDownTime_Month &= 0xFFFFFF;
		u32PowerDownTime_Day += u8Cycle;
		u32PowerDownTime_Month += u8Cycle;	
		(*pu32PowerDownTime_Day) = u32PowerDownTime_Day;		
		(*pu32PowerDownTime_Month) = u32PowerDownTime_Month;	
		if((*pu32Flag_Day) == 0x00)
		{
			(*pu32Flag_Day) = 1;
			u32PowerDownNum_Day	= *pu32PowerDownNum_Day;
			u32PowerDownNum_Day &= 0xFFFFFF;
			u32PowerDownNum_Day ++;
			(*pu32PowerDownNum_Day) = u32PowerDownNum_Day;	
		}
		if((*pu32Flag_Month) == 0x00)
		{
			(*pu32Flag_Month) = 1;
			u32PowerDownNum_Month = *pu32PowerDownNum_Month;
			u32PowerDownNum_Month &= 0xFFFFFF;
			u32PowerDownNum_Month ++;		
			(*pu32PowerDownNum_Month) = u32PowerDownNum_Month;		
		}
	}
	else
	{
		(*pu32Flag_Day) = 0;
		(*pu32Flag_Month) = 0;
	}
}
#if (DLT500_REPORT == 0)
/**--------------------------------------------------------------------
*功    能:统计数据，本日电压合格率统计数据，终端及电能表支持
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000010_97(u8 u8Cycle,u16 u16UpLimit,u16 u16LowLimit,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	QCSG_LCD_RAMDATA_LIST_S* pstPn_Ram_Data = (QCSG_LCD_RAMDATA_LIST_S*)QCSG_LCD_RAM_LIST;
	QCSG_LCD_RAMDATA_S* pstRam_Data = NULL;	
	TIME_PARAM_S stCurr_Time;
	MeasurePointStruct stPnPara;
	u8 u8PnNum = 0,i = 0,u8MaxFlag = 0,u8MinFlag = 0,u8MeterType = 0,u8MonitorFlag = TRUE;
	u16 u16Ua = 0,u16Ub = 0,u16Uc = 0,u16Umax = 0,u16Umin = 0,u16RatedVoltage = 0;
	u32 u32MonitorTime = 0,u32PassRateTime = 0,u32PassRate = 0,u32Overrrun = 0,u32UpLimitTime = 0,u32LowLimitTime = 0,u32ReadLen = 0;
	
	if(u8Cycle == 0)
	{
		return;
	}
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));
		return;
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPnLcdRamData[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPnLcdRamData[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}		
	if(QCSG_BCDCheck(pstRam_Data->u8Data0201FF00,6) == TRUE)
	{
		//三相数据都是BCD，则说明是三相表，这里只做个简单判断，不再读取测量点参数
		u8MeterType = 3;
	}
	else if((QCSG_BCDCheck(pstRam_Data->u8Data0201FF00,6) != TRUE) && ((QCSG_BCDCheck(pstRam_Data->u8Data0201FF00,2) == TRUE)))
	{
		//单相表
		u8MeterType = 1;
	}
	else
	{
		return;
	}
	u8PnNum = pstPassRate_List->u8PnNum;
	//数据合法性校验
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPassRate_List->stPassRate[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstPassRate_List->stPassRate[i].u8MonitorTime,sizeof(QCSG_VOLTAGE_PASSRATE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));		
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[u8PnNum];
			MemSet(pstPassRate_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstPassRate_info->u16Pn = u16Pn;
			pstPassRate_List->u8PnNum ++;
		}
	}
	MemCopy(&u32MonitorTime,pstPassRate_info->u8MonitorTime,3);
	MemCopy(&u32PassRateTime,pstPassRate_info->u8PassRateTime,3);
	MemCopy(&u32UpLimitTime,pstPassRate_info->u8UpLimitTime,3);
	MemCopy(&u32LowLimitTime,pstPassRate_info->u8LowLimitTime,3);
	u32MonitorTime = QCSG_BCD2HEX((u8)(u32MonitorTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32MonitorTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32MonitorTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32MonitorTime);
	u32PassRateTime = QCSG_BCD2HEX((u8)(u32PassRateTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32PassRateTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32PassRateTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32PassRateTime);
	u32UpLimitTime = QCSG_BCD2HEX((u8)(u32UpLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32UpLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32UpLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32UpLimitTime);
	u32LowLimitTime = QCSG_BCD2HEX((u8)(u32LowLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32LowLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32LowLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32LowLimitTime);
	MemCopy(&u16Umax,pstPassRate_info->u8MaxVoltage,2);
	MemCopy(&u16Umin,pstPassRate_info->u8MinVoltage,2);
	if(u16Umin == 0x0000)
	{
		u16Umin = 0x9999;
	}	
	u16Umax = QCSG_BCD2HEX((u8)(u16Umax>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umax);
	u16Umin = QCSG_BCD2HEX((u8)(u16Umin>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umin);
	MemCopy(&u16Ua,&pstRam_Data->u8Data0201FF00[0],2);
	MemCopy(&u16Ub,&pstRam_Data->u8Data0201FF00[2],2);
	MemCopy(&u16Uc,&pstRam_Data->u8Data0201FF00[4],2);
	u16Ua = QCSG_BCD2HEX((u8)(u16Ua>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ua);
	u16Ub = QCSG_BCD2HEX((u8)(u16Ub>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ub);
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	u16RatedVoltage = stPnPara.RatedVoltage;
	u16RatedVoltage = QCSG_BCD2HEX((u8)(u16RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)u16RatedVoltage);
	if(u8MeterType == 3)
	{
		if((u16Ua * 100 < u16RatedVoltage * 78) || (u16Ub * 100 < u16RatedVoltage * 78) || (u16Uc * 100 < u16RatedVoltage * 78))
		{
			u8MonitorFlag = FALSE;
		}
		if((u16Ua * 100 > u16RatedVoltage * 130) || (u16Ub * 100 > u16RatedVoltage * 130) || (u16Uc * 100 > u16RatedVoltage * 130))
		{
			u8MonitorFlag = FALSE;
		}
	}
	if(u8MeterType == 1)
	{
		if(u16Ua * 100 < u16RatedVoltage * 78)
		{
			u8MonitorFlag = FALSE;
		}
		if(u16Ua * 100 > u16RatedVoltage * 130)
		{
			u8MonitorFlag = FALSE;
		}		
	}
	if(u8MonitorFlag == TRUE)
	{
		u32MonitorTime += u8Cycle;
	}
	if(u8MeterType == 3)
	{
		if(((u16Ua < u16UpLimit) && (u16Ua > u16LowLimit)) && ((u16Ub < u16UpLimit) && (u16Ub > u16LowLimit)) && ((u16Uc < u16UpLimit) && (u16Uc > u16LowLimit)))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32PassRateTime += u8Cycle;
			}
		}
		if((u16Ua < u16LowLimit) || (u16Ub < u16LowLimit) || (u16Uc < u16LowLimit))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32LowLimitTime += u8Cycle;
			}
		}
		if((u16Ua > u16UpLimit) || (u16Ub > u16UpLimit) || (u16Uc > u16UpLimit))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32UpLimitTime += u8Cycle;
			}
		}
		if(u16Ua > u16Umax)
		{
			u16Umax = u16Ua;
			u8MaxFlag = 1;
		}
		if(u16Ub > u16Umax)
		{
			u16Umax = u16Ub;
			u8MaxFlag = 1;
		}
		if(u16Uc > u16Umax)
		{
			u16Umax = u16Uc;
			u8MaxFlag = 1;
		}
		if(u16Ua < u16Umin)
		{
			u16Umin = u16Ua;
			u8MinFlag = 1;
		}
		if(u16Ub < u16Umin)
		{
			u16Umin = u16Ub;
			u8MinFlag = 1;
		}	
		if(u16Uc < u16Umin)
		{
			u16Umin = u16Uc;
			u8MinFlag = 1;
		}	
	}
	if(u8MeterType == 1)
	{
		if((u16Ua < u16UpLimit) && (u16Ua > u16LowLimit))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32PassRateTime += u8Cycle;
			}
		}
		if(u16Ua < u16LowLimit)
		{
			if(u8MonitorFlag == TRUE)
			{
				u32LowLimitTime += u8Cycle;
			}
		}
		if(u16Ua > u16UpLimit)
		{
			if(u8MonitorFlag == TRUE)
			{
				u32UpLimitTime += u8Cycle;
			}
		}
		if(u16Ua > u16Umax)
		{
			u16Umax = u16Ua;
			u8MaxFlag = 1;
		}
		if(u16Ua < u16Umin)
		{
			u16Umin = u16Ua;
			u8MinFlag = 1;
		}
	}	
	u16Umax = (u16)hex_bcd(u16Umax);	
	u16Umin = (u16)hex_bcd(u16Umin);	
	MemCopy(pstPassRate_info->u8MaxVoltage,&u16Umax,2);
	MemCopy(pstPassRate_info->u8MinVoltage,&u16Umin,2);
	if(u8MaxFlag == 1)
	{
		pstPassRate_info->u8MaxVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MaxVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MaxVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MaxVoltageTime[3] = stCurr_Time.u8Month;
	}
	if(u8MinFlag == 1)
	{
		pstPassRate_info->u8MinVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MinVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MinVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MinVoltageTime[3] = stCurr_Time.u8Month; 
	}
	u32PassRate = u32PassRateTime * 10000/u32MonitorTime;
	u32PassRate = hex_bcd(u32PassRate);
	u32Overrrun = (u32MonitorTime - u32PassRateTime) * 10000/u32MonitorTime;
	u32Overrrun = hex_bcd(u32Overrrun);
	u32UpLimitTime = hex_bcd(u32UpLimitTime);
	u32LowLimitTime = hex_bcd(u32LowLimitTime);
	u32MonitorTime = hex_bcd(u32MonitorTime);
	u32PassRateTime = hex_bcd(u32PassRateTime);
	MemCopy(pstPassRate_info->u8PassRate,&u32PassRate,3);
	MemCopy(pstPassRate_info->u8Overrrun,&u32Overrrun,3);
	MemCopy(pstPassRate_info->u8MonitorTime,&u32MonitorTime,3);
	MemCopy(pstPassRate_info->u8PassRateTime,&u32PassRateTime,3);
	MemCopy(pstPassRate_info->u8LowLimitTime,&u32LowLimitTime,3);
	MemCopy(pstPassRate_info->u8UpLimitTime,&u32UpLimitTime,3);
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日电压合格率统计数据，终端及电能表支持
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000010(u8 u8Cycle,u16 u16UpLimit,u16 u16LowLimit,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	TIME_PARAM_S stCurr_Time;
	MeasurePointStruct stPnPara;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0,u8MaxFlag = 0,u8MinFlag = 0,u8MeterType = 0,u8MonitorFlag = TRUE;
	u16 u16Ua = 0,u16Ub = 0,u16Uc = 0,u16Umax = 0,u16Umin = 0,u16RatedVoltage = 0;
	u32 u32MonitorTime = 0,u32PassRateTime = 0,u32PassRate = 0,u32Overrrun = 0,u32UpLimitTime = 0,u32LowLimitTime = 0,u32ReadLen = 0;
	
