gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(u8Cycle == 0)
	{
		return;
	}	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if((u8CtrlCode != 0x91) && (u8CtrlCode != 0x81))
	{
		return;
	}			
	if(u8ProtocolType == METER_DLT645_07)
	{
		if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[18],2) != TRUE)
		{
			return;
		}
	}
	else
	{
		if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[12],2) != TRUE)
		{
			return;
		}		
	}
	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPassRate_List->stPassRate[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstPassRate_List->stPassRate[i].u8MonitorTime,sizeof(QCSG_VOLTAGE_PASSRATE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[u8PnNum];
			MemSet(pstPassRate_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstPassRate_info->u16Pn = u16Pn;
			pstPassRate_List->u8PnNum ++;
		}
	}
	MemCopy(&u32MonitorTime,pstPassRate_info->u8MonitorTime,3);
	MemCopy(&u32PassRateTime,pstPassRate_info->u8PassRateTime,3);
	MemCopy(&u32UpLimitTime,pstPassRate_info->u8UpLimitTime,3);
	MemCopy(&u32LowLimitTime,pstPassRate_info->u8LowLimitTime,3);
	u32MonitorTime = QCSG_BCD2HEX((u8)(u32MonitorTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32MonitorTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32MonitorTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32MonitorTime);
	u32PassRateTime = QCSG_BCD2HEX((u8)(u32PassRateTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32PassRateTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32PassRateTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32PassRateTime);
	u32UpLimitTime = QCSG_BCD2HEX((u8)(u32UpLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32UpLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32UpLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32UpLimitTime);
	u32LowLimitTime = QCSG_BCD2HEX((u8)(u32LowLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32LowLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32LowLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32LowLimitTime);
	MemCopy(&u16Umax,pstPassRate_info->u8MaxVoltage,2);
	MemCopy(&u16Umin,pstPassRate_info->u8MinVoltage,2);
	if(u16Umin == 0x0000)
	{
		u16Umin = 0x9999;
	}	
	u16Umax = QCSG_BCD2HEX((u8)(u16Umax>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umax);
	u16Umin = QCSG_BCD2HEX((u8)(u16Umin>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umin);
	if(u8ProtocolType == METER_DLT645_07)
	{
		MemCopy(&u16Uc,&pstDlt645Frame_Info->u8RevBuf[18],2);
	}
	else
	{
		MemCopy(&u16Uc,&pstDlt645Frame_Info->u8RevBuf[12],2);
		u16Uc = (u16Uc << 4) & 0xFFF0;
	}
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	u16RatedVoltage = stPnPara.RatedVoltage;
	if(QCSG_BCDCheck((u8*)&u16RatedVoltage,2) != TRUE)
	{
		u16RatedVoltage = JC_UN;
	}
	else
	{
		u16RatedVoltage = QCSG_BCD2HEX((u8)(u16RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)u16RatedVoltage);
	}
	if(u16Uc * 100 < u16RatedVoltage * 78)
	{
		u8MonitorFlag = FALSE;
	}
	if(u16Uc * 100 > u16RatedVoltage * 130)
	{
		u8MonitorFlag = FALSE;
	}
	if(u8MonitorFlag == FALSE)
	{	
		return;
	}
	u32MonitorTime += u8Cycle;
	if((u16Uc < u16UpLimit) && (u16Uc > u16LowLimit))
	{
		u32PassRateTime += u8Cycle;
	}
	if(u16Uc < u16LowLimit)
	{
		u32LowLimitTime += u8Cycle;
	}
	if(u16Uc > u16UpLimit)
	{
		u32UpLimitTime += u8Cycle;
	}
	if(u16Uc > u16Umax)
	{
		u16Umax = u16Uc;
		u8MaxFlag = 1;
	}
	if(u16Uc < u16Umin)
	{
		u16Umin = u16Uc;
		u8MinFlag = 1;
	}
	u16Umax = (u16)hex_bcd(u16Umax);	
	u16Umin = (u16)hex_bcd(u16Umin);		
	MemCopy(pstPassRate_info->u8MaxVoltage,&u16Umax,2);
	MemCopy(pstPassRate_info->u8MinVoltage,&u16Umin,2);
	if(u8MaxFlag == 1)
	{
		pstPassRate_info->u8MaxVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MaxVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MaxVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MaxVoltageTime[3] = stCurr_Time.u8Month;
	}
	if(u8MinFlag == 1)
	{
		pstPassRate_info->u8MinVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MinVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MinVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MinVoltageTime[3] = stCurr_Time.u8Month; 
	}
	u32PassRate = u32PassRateTime * 10000/u32MonitorTime;
	u32PassRate = hex_bcd(u32PassRate);
	u32Overrrun = (u32MonitorTime - u32PassRateTime) * 10000/u32MonitorTime;
	u32Overrrun = hex_bcd(u32Overrrun);
	u32UpLimitTime = hex_bcd(u32UpLimitTime);
	u32LowLimitTime = hex_bcd(u32LowLimitTime);
	u32MonitorTime = hex_bcd(u32MonitorTime);
	u32PassRateTime = hex_bcd(u32PassRateTime);
	MemCopy(pstPassRate_info->u8PassRate,&u32PassRate,3);
	MemCopy(pstPassRate_info->u8Overrrun,&u32Overrrun,3);
	MemCopy(pstPassRate_info->u8MonitorTime,&u32MonitorTime,3);
	MemCopy(pstPassRate_info->u8PassRateTime,&u32PassRateTime,3);
	MemCopy(pstPassRate_info->u8LowLimitTime,&u32LowLimitTime,3);
	MemCopy(pstPassRate_info->u8UpLimitTime,&u32UpLimitTime,3);
}
#else
/**--------------------------------------------------------------------
*功    能:统计数据，本日电压合格率统计数据，终端及电能表支持
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000010_97(u8 u8Cycle,u16 u16UpLimit,u16 u16LowLimit,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	QCSG_LCD_RAMDATA_LIST_S* pstPn_Ram_Data = (QCSG_LCD_RAMDATA_LIST_S*)QCSG_LCD_RAM_LIST;
	QCSG_LCD_RAMDATA_S* pstRam_Data = NULL;	
	TIME_PARAM_S stCurr_Time;
	MeasurePointStruct stPnPara;
	u8 u8PnNum = 0,i = 0,u8MaxFlag = 0,u8MinFlag = 0,u8MeterType = 0,u8MonitorFlag = TRUE;
	u16 u16Ua = 0,u16Ub = 0,u16Uc = 0,u16Umax = 0,u16Umin = 0,u16RatedVoltage = 0;
	u32 u32MonitorTime = 0,u32PassRateTime = 0,u32PassRate = 0,u32UpLimitRate = 0,u32UpLimitTime = 0,u32LowLimitRate = 0,u32LowLimitTime = 0,u32ReadLen = 0;
	
	if(u8Cycle == 0)
	{
		return;
	}
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));
		return;
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPnLcdRamData[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPnLcdRamData[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}		
	if(QCSG_BCDCheck(pstRam_Data->u8Data0201FF00,6) == TRUE)
	{
		//三相数据都是BCD，则说明是三相表，这里只做个简单判断，不再读取测量点参数
		u8MeterType = 3;
	}
	else if((QCSG_BCDCheck(pstRam_Data->u8Data0201FF00,6) != TRUE) && ((QCSG_BCDCheck(pstRam_Data->u8Data0201FF00,2) == TRUE)))
	{
		//单相表
		u8MeterType = 1;
	}
	else
	{
		return;
	}
	u8PnNum = pstPassRate_List->u8PnNum;
	//数据合法性校验
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPassRate_List->stPassRate[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstPassRate_List->stPassRate[i].u8MonitorTime,sizeof(QCSG_VOLTAGE_PASSRATE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));		
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[u8PnNum];
			MemSet(pstPassRate_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstPassRate_info->u16Pn = u16Pn;
			pstPassRate_List->u8PnNum ++;
		}
	}
	MemCopy(&u32MonitorTime,pstPassRate_info->u8MonitorTime,3);
	MemCopy(&u32PassRateTime,pstPassRate_info->u8PassRateTime,3);
	MemCopy(&u32UpLimitTime,pstPassRate_info->u8UpLimitTime,3);
	MemCopy(&u32LowLimitTime,pstPassRate_info->u8LowLimitTime,3);
	u32MonitorTime = (QCSG_BCD2HEX((u8)(u32MonitorTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32MonitorTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32MonitorTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32MonitorTime))*60;
	u32PassRateTime = (QCSG_BCD2HEX((u8)(u32PassRateTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32PassRateTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32PassRateTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32PassRateTime))*60;
	u32UpLimitTime = (QCSG_BCD2HEX((u8)(u32UpLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32UpLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32UpLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32UpLimitTime))*60;
	u32LowLimitTime = (QCSG_BCD2HEX((u8)(u32LowLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32LowLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32LowLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32LowLimitTime))*60;
	MemCopy(&u16Umax,pstPassRate_info->u8MaxVoltage,2);
	MemCopy(&u16Umin,pstPassRate_info->u8MinVoltage,2);
	if(u16Umin == 0x0000)
	{
		u16Umin = 0x9999;
	}	
	u16Umax = QCSG_BCD2HEX((u8)(u16Umax>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umax);
	u16Umin = QCSG_BCD2HEX((u8)(u16Umin>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umin);
	MemCopy(&u16Ua,&pstRam_Data->u8Data0201FF00[0],2);
	MemCopy(&u16Ub,&pstRam_Data->u8Data0201FF00[2],2);
	MemCopy(&u16Uc,&pstRam_Data->u8Data0201FF00[4],2);
	u16Ua = QCSG_BCD2HEX((u8)(u16Ua>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ua);
	u16Ub = QCSG_BCD2HEX((u8)(u16Ub>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ub);
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	u16RatedVoltage = stPnPara.RatedVoltage;
	u16RatedVoltage = QCSG_BCD2HEX((u8)(u16RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)u16RatedVoltage);
	if(u8MeterType == 3)
	{
		if((u16Ua * 100 < u16RatedVoltage * 78) || (u16Ub * 100 < u16RatedVoltage * 78) || (u16Uc * 100 < u16RatedVoltage * 78))
		{
			u8MonitorFlag = FALSE;
		}
		if((u16Ua * 100 > u16RatedVoltage * 130) || (u16Ub * 100 > u16RatedVoltage * 130) || (u16Uc * 100 > u16RatedVoltage * 130))
		{
			u8MonitorFlag = FALSE;
		}
	}
	if(u8MeterType == 1)
	{
		if(u16Ua * 100 < u16RatedVoltage * 78)
		{
			u8MonitorFlag = FALSE;
		}
		if(u16Ua * 100 > u16RatedVoltage * 130)
		{
			u8MonitorFlag = FALSE;
		}		
	}
	if(u8MonitorFlag == TRUE)
	{
		u32MonitorTime += u8Cycle;
	}
	if(u8MeterType == 3)
	{
		if(((u16Ua < u16UpLimit) && (u16Ua > u16LowLimit)) && ((u16Ub < u16UpLimit) && (u16Ub > u16LowLimit)) && ((u16Uc < u16UpLimit) && (u16Uc > u16LowLimit)))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32PassRateTime += u8Cycle;
			}
		}
		if((u16Ua < u16LowLimit) || (u16Ub < u16LowLimit) || (u16Uc < u16LowLimit))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32LowLimitTime += u8Cycle;
			}
		}
		if((u16Ua > u16UpLimit) || (u16Ub > u16UpLimit) || (u16Uc > u16UpLimit))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32UpLimitTime += u8Cycle;
			}
		}
		if(u16Ua > u16Umax)
		{
			u16Umax = u16Ua;
			u8MaxFlag = 1;
		}
		if(u16Ub > u16Umax)
		{
			u16Umax = u16Ub;
			u8MaxFlag = 1;
		}
		if(u16Uc > u16Umax)
		{
			u16Umax = u16Uc;
			u8MaxFlag = 1;
		}
		if(u16Ua < u16Umin)
		{
			u16Umin = u16Ua;
			u8MinFlag = 1;
		}
		if(u16Ub < u16Umin)
		{
			u16Umin = u16Ub;
			u8MinFlag = 1;
		}	
		if(u16Uc < u16Umin)
		{
			u16Umin = u16Uc;
			u8MinFlag = 1;
		}	
	}
	if(u8MeterType == 1)
	{
		if((u16Ua < u16UpLimit) && (u16Ua > u16LowLimit))
		{
			if(u8MonitorFlag == TRUE)
			{
				u32PassRateTime += u8Cycle;
			}
		}
		if(u16Ua < u16LowLimit)
		{
			if(u8MonitorFlag == TRUE)
			{
				u32LowLimitTime += u8Cycle;
			}
		}
		if(u16Ua > u16UpLimit)
		{
			if(u8MonitorFlag == TRUE)
			{
				u32UpLimitTime += u8Cycle;
			}
		}
		if(u16Ua > u16Umax)
		{
			u16Umax = u16Ua;
			u8MaxFlag = 1;
		}
		if(u16Ua < u16Umin)
		{
			u16Umin = u16Ua;
			u8MinFlag = 1;
		}
	}	
	u16Umax = (u16)hex_bcd(u16Umax);	
	u16Umin = (u16)hex_bcd(u16Umin);	
	MemCopy(pstPassRate_info->u8MaxVoltage,&u16Umax,2);
	MemCopy(pstPassRate_info->u8MinVoltage,&u16Umin,2);
	if(u8MaxFlag == 1)
	{
		pstPassRate_info->u8MaxVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MaxVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MaxVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MaxVoltageTime[3] = stCurr_Time.u8Month;
	}
	if(u8MinFlag == 1)
	{
		pstPassRate_info->u8MinVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MinVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MinVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MinVoltageTime[3] = stCurr_Time.u8Month; 
	}
	u32PassRate = u32PassRateTime * 10000/u32MonitorTime;
	u32PassRate = hex_bcd(u32PassRate);
	u32UpLimitRate = u32UpLimitTime * 10000/u32MonitorTime;
	u32UpLimitRate = hex_bcd(u32UpLimitRate);
	u32LowLimitRate = u32LowLimitTime * 10000/u32MonitorTime;
	u32LowLimitRate = hex_bcd(u32LowLimitRate);
	u32UpLimitTime = hex_bcd(u32UpLimitTime/60);
	u32LowLimitTime = hex_bcd(u32LowLimitTime/60);
	u32MonitorTime = hex_bcd(u32MonitorTime/60);
	u32PassRateTime = hex_bcd(u32PassRateTime/60);
	MemCopy(pstPassRate_info->u8PassRate,&u32PassRate,3);
	MemCopy(pstPassRate_info->u8UpLimintRate,&u32UpLimitRate,3);
	MemCopy(pstPassRate_info->u8LowLimintRate,&u32LowLimitRate,3);
	MemCopy(pstPassRate_info->u8MonitorTime,&u32MonitorTime,3);
	MemCopy(pstPassRate_info->u8PassRateTime,&u32PassRateTime,3);
	MemCopy(pstPassRate_info->u8LowLimitTime,&u32LowLimitTime,3);
	MemCopy(pstPassRate_info->u8UpLimitTime,&u32UpLimitTime,3);
}

/**--------------------------------------------------------------------
*功    能:统计数据，本日电压合格率统计数据，终端及电能表支持
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000010(u8 u8Cycle,u16 u16UpLimit,u16 u16LowLimit,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	TIME_PARAM_S stCurr_Time;
	MeasurePointStruct stPnPara;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0,u8MaxFlag = 0,u8MinFlag = 0,u8MeterType = 0,u8MonitorFlag = TRUE;
	u16 u16Ua = 0,u16Ub = 0,u16Uc = 0,u16Umax = 0,u16Umin = 0,u16RatedVoltage = 0;
	u32 u32MonitorTime = 0,u32PassRateTime = 0,u32PassRate = 0,u32UpLimitRate = 0,u32UpLimitTime = 0,u32LowLimitRate = 0,u32LowLimitTime = 0,u32ReadLen = 0;
	
	if(u8Cycle == 0)
	{
		return;
	}
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],6) == TRUE)
	{
		//三相数据都是BCD，则说明是三相表，这里只做个简单判断，不再读取测量点参数
		u8MeterType = 3;
	}
	else if((QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],6) != TRUE) && ((QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],2) == TRUE)))
	{
		//单相表
		u8MeterType = 1;
	}
	else
	{
		return;
	}
	u8PnNum = pstPassRate_List->u8PnNum;
	//数据合法性校验
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPassRate_List->stPassRate[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstPassRate_List->stPassRate[i].u8MonitorTime,sizeof(QCSG_VOLTAGE_PASSRATE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));		
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[u8PnNum];
			MemSet(pstPassRate_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstPassRate_info->u16Pn = u16Pn;
			pstPassRate_List->u8PnNum ++;
		}
	}
	MemCopy(&u32MonitorTime,pstPassRate_info->u8MonitorTime,3);
	MemCopy(&u32PassRateTime,pstPassRate_info->u8PassRateTime,3);
	MemCopy(&u32UpLimitTime,pstPassRate_info->u8UpLimitTime,3);
	MemCopy(&u32LowLimitTime,pstPassRate_info->u8LowLimitTime,3);
	u32MonitorTime = QCSG_BCD2HEX((u8)(u32MonitorTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32MonitorTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32MonitorTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32MonitorTime);
	u32PassRateTime = QCSG_BCD2HEX((u8)(u32PassRateTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32PassRateTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32PassRateTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32PassRateTime);
	u32UpLimitTime = QCSG_BCD2HEX((u8)(u32UpLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32UpLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32UpLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32UpLimitTime);
	u32LowLimitTime = QCSG_BCD2HEX((u8)(u32LowLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32LowLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32LowLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32LowLimitTime);
	MemCopy(&u16Umax,pstPassRate_info->u8MaxVoltage,2);
	MemCopy(&u16Umin,pstPassRate_info->u8MinVoltage,2);
	if(u16Umin == 0x0000)
	{
		u16Umin = 0x9999;
	}	
	u16Umax = QCSG_BCD2HEX((u8)(u16Umax>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umax);
	u16Umin = QCSG_BCD2HEX((u8)(u16Umin>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umin);
	MemCopy(&u16Ua,&pstDlt645Frame_Info->u8RevBuf[14],2);
	MemCopy(&u16Ub,&pstDlt645Frame_Info->u8RevBuf[16],2);
	MemCopy(&u16Uc,&pstDlt645Frame_Info->u8RevBuf[18],2);
	u16Ua = QCSG_BCD2HEX((u8)(u16Ua>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ua);
	u16Ub = QCSG_BCD2HEX((u8)(u16Ub>>8)) * 100 + QCSG_BCD2HEX((u8)u16Ub);
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	u16RatedVoltage = stPnPara.RatedVoltage;
	if(QCSG_BCDCheck((u8*)&u16RatedVoltage,2) != TRUE)
	{
		u16RatedVoltage = JC_UN;
	}
	else
	{
		u16RatedVoltage = QCSG_BCD2HEX((u8)(u16RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)u16RatedVoltage);
	}
	if(u8MonitorFlag == FALSE)
	{
		return;
	}
	u32MonitorTime += u8Cycle;
	if(u8MeterType == 3)
	{
		if(((u16Ua < u16UpLimit) && (u16Ua > u16LowLimit)) && ((u16Ub < u16UpLimit) && (u16Ub > u16LowLimit)) && ((u16Uc < u16UpLimit) && (u16Uc > u16LowLimit)))
		{
			u32PassRateTime += u8Cycle;
		}
		if((u16Ua < u16LowLimit) || (u16Ub < u16LowLimit) || (u16Uc < u16LowLimit))
		{
			u32LowLimitTime += u8Cycle;
		}
		if((u16Ua > u16UpLimit) || (u16Ub > u16UpLimit) || (u16Uc > u16UpLimit))
		{
			u32UpLimitTime += u8Cycle;
		}
		if(u16Ua > u16Umax)
		{
			u16Umax = u16Ua;
			u8MaxFlag = 1;
		}
		if(u16Ub > u16Umax)
		{
			u16Umax = u16Ub;
			u8MaxFlag = 1;
		}
		if(u16Uc > u16Umax)
		{
			u16Umax = u16Uc;
			u8MaxFlag = 1;
		}
		if(u16Ua < u16Umin)
		{
			u16Umin = u16Ua;
			u8MinFlag = 1;
		}
		if(u16Ub < u16Umin)
		{
			u16Umin = u16Ub;
			u8MinFlag = 1;
		}	
		if(u16Uc < u16Umin)
		{
			u16Umin = u16Uc;
			u8MinFlag = 1;
		}	
	}
	if(u8MeterType == 1)
	{
		if((u16Ua < u16UpLimit) && (u16Ua > u16LowLimit))
		{
			u32PassRateTime += u8Cycle;
		}
		if(u16Ua < u16LowLimit)
		{
			u32LowLimitTime += u8Cycle;
		}
		if(u16Ua > u16UpLimit)
		{
			u32UpLimitTime += u8Cycle;
		}
		if(u16Ua > u16Umax)
		{
			u16Umax = u16Ua;
			u8MaxFlag = 1;
		}
		if(u16Ua < u16Umin)
		{
			u16Umin = u16Ua;
			u8MinFlag = 1;
		}
	}	
	u16Umax = (u16)hex_bcd(u16Umax);	
	u16Umin = (u16)hex_bcd(u16Umin);	
	MemCopy(pstPassRate_info->u8MaxVoltage,&u16Umax,2);
	MemCopy(pstPassRate_info->u8MinVoltage,&u16Umin,2);
	if(u8MaxFlag == 1)
	{
		pstPassRate_info->u8MaxVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MaxVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MaxVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MaxVoltageTime[3] = stCurr_Time.u8Month;
	}
	if(u8MinFlag == 1)
	{
		pstPassRate_info->u8MinVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MinVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MinVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MinVoltageTime[3] = stCurr_Time.u8Month; 
	}
	u32PassRate = u32PassRateTime * 10000/u32MonitorTime;
	u32PassRate = hex_bcd(u32PassRate);
	u32UpLimitRate = u32UpLimitTime * 10000/u32MonitorTime;
	u32UpLimitRate = hex_bcd(u32UpLimitRate);
	u32LowLimitRate =u32LowLimitTime * 10000/u32MonitorTime;
	u32LowLimitRate = hex_bcd(u32LowLimitRate);
	u32UpLimitTime = hex_bcd(u32UpLimitTime);
	u32LowLimitTime = hex_bcd(u32LowLimitTime);
	u32MonitorTime = hex_bcd(u32MonitorTime);
	u32PassRateTime = hex_bcd(u32PassRateTime);
	MemCopy(pstPassRate_info->u8PassRate,&u32PassRate,3);
	MemCopy(pstPassRate_info->u8UpLimintRate,&u32UpLimitRate,3);
	MemCopy(pstPassRate_info->u8LowLimintRate,&u32LowLimitRate,3);
	MemCopy(pstPassRate_info->u8MonitorTime,&u32MonitorTime,3);
	MemCopy(pstPassRate_info->u8PassRateTime,&u32PassRateTime,3);
	MemCopy(pstPassRate_info->u8LowLimitTime,&u32LowLimitTime,3);
	MemCopy(pstPassRate_info->u8UpLimitTime,&u32UpLimitTime,3);
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日A相电压合格率统计数据，终端及电能表支持
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000011(u8 u8Cycle,u16 u16UpLimit,u16 u16LowLimit,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_A_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	TIME_PARAM_S stCurr_Time;
	MeasurePointStruct stPnPara;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0,u8MaxFlag = 0,u8MinFlag = 0,u8MonitorFlag = TRUE;
	u16 u16Ua = 0,u16Umax = 0,u16Umin = 0,u16RatedVoltage = 0;
	u32 u32MonitorTime = 0,u32PassRateTime = 0,u32PassRate = 0,u32UpLimitRate = 0,u32UpLimitTime = 0,u32LowLimitRate = 0,u32LowLimitTime = 0,u32ReadLen = 0;
	
