gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(u8Cycle == 0)
	{
		return;
	}	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if((u8CtrlCode != 0x91) && (u8CtrlCode != 0x81))
	{
		return;
	}		
	if(u8ProtocolType == METER_DLT645_07)
	{
		if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[18],2) != TRUE)
		{
			return;
		}
	}
	else
	{
		if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[12],2) != TRUE)
		{
			return;
		}		
	}
	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}	
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPassRate_List->stPassRate[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstPassRate_List->stPassRate[i].u8MonitorTime,sizeof(QCSG_VOLTAGE_PASSRATE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));		
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[u8PnNum];
			MemSet(pstPassRate_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstPassRate_info->u16Pn = u16Pn;
			pstPassRate_List->u8PnNum ++;
		}
	}
	MemCopy(&u32MonitorTime,pstPassRate_info->u8MonitorTime,3);
	MemCopy(&u32PassRateTime,pstPassRate_info->u8PassRateTime,3);
	MemCopy(&u32UpLimitTime,pstPassRate_info->u8UpLimitTime,3);
	MemCopy(&u32LowLimitTime,pstPassRate_info->u8LowLimitTime,3);
	u32MonitorTime = QCSG_BCD2HEX((u8)(u32MonitorTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32MonitorTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32MonitorTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32MonitorTime);
	u32PassRateTime = QCSG_BCD2HEX((u8)(u32PassRateTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32PassRateTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32PassRateTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32PassRateTime);
	u32UpLimitTime = QCSG_BCD2HEX((u8)(u32UpLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32UpLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32UpLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32UpLimitTime);
	u32LowLimitTime = QCSG_BCD2HEX((u8)(u32LowLimitTime>>24)) * 1000000 + QCSG_BCD2HEX((u8)(u32LowLimitTime>>16)) * 10000
					+QCSG_BCD2HEX((u8)(u32LowLimitTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32LowLimitTime);
	MemCopy(&u16Umax,pstPassRate_info->u8MaxVoltage,2);
	MemCopy(&u16Umin,pstPassRate_info->u8MinVoltage,2);
	if(u16Umin == 0x0000)
	{
		u16Umin = 0x9999;
	}	
	u16Umax = QCSG_BCD2HEX((u8)(u16Umax>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umax);
	u16Umin = QCSG_BCD2HEX((u8)(u16Umin>>8)) * 100 + QCSG_BCD2HEX((u8)u16Umin);
	if(u8ProtocolType == METER_DLT645_07)
	{
		MemCopy(&u16Uc,&pstDlt645Frame_Info->u8RevBuf[18],2);
	}
	else
	{
		MemCopy(&u16Uc,&pstDlt645Frame_Info->u8RevBuf[12],2);
		u16Uc = (u16Uc << 4) & 0xFFF0;
	}
	u16Uc = QCSG_BCD2HEX((u8)(u16Uc>>8)) * 100 + QCSG_BCD2HEX((u8)u16Uc);
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	u16RatedVoltage = stPnPara.RatedVoltage;
	if(QCSG_BCDCheck((u8*)&u16RatedVoltage,2) != TRUE)
	{
		u16RatedVoltage = JC_UN;
	}
	else
	{
		u16RatedVoltage = QCSG_BCD2HEX((u8)(u16RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)u16RatedVoltage);
	}
	if(u16Uc * 100 < u16RatedVoltage * 78)
	{
		u8MonitorFlag = FALSE;
	}
	if(u16Uc * 100 > u16RatedVoltage * 130)
	{
		u8MonitorFlag = FALSE;
	}
	if(u8MonitorFlag == FALSE)
	{		
		return;
	}
	u32MonitorTime += u8Cycle;
	if((u16Uc < u16UpLimit) && (u16Uc > u16LowLimit))
	{
		u32PassRateTime += u8Cycle;
	}
	if(u16Uc < u16LowLimit)
	{
		u32LowLimitTime += u8Cycle;
	}
	if(u16Uc > u16UpLimit)
	{
		u32UpLimitTime += u8Cycle;
	}
	if(u16Uc > u16Umax)
	{
		u16Umax = u16Uc;
		u8MaxFlag = 1;
	}
	if(u16Uc < u16Umin)
	{
		u16Umin = u16Uc;
		u8MinFlag = 1;
	}
	u16Umax = (u16)hex_bcd(u16Umax);	
	u16Umin = (u16)hex_bcd(u16Umin);		
	MemCopy(pstPassRate_info->u8MaxVoltage,&u16Umax,2);
	MemCopy(pstPassRate_info->u8MinVoltage,&u16Umin,2);
	if(u8MaxFlag == 1)
	{
		pstPassRate_info->u8MaxVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MaxVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MaxVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MaxVoltageTime[3] = stCurr_Time.u8Month;
	}
	if(u8MinFlag == 1)
	{
		pstPassRate_info->u8MinVoltageTime[0] = stCurr_Time.u8Minute;
		pstPassRate_info->u8MinVoltageTime[1] = stCurr_Time.u8Hour;
		pstPassRate_info->u8MinVoltageTime[2] = stCurr_Time.u8Day;
		pstPassRate_info->u8MinVoltageTime[3] = stCurr_Time.u8Month; 
	}
	u32PassRate = u32PassRateTime * 10000/u32MonitorTime;
	u32PassRate = hex_bcd(u32PassRate);
	u32UpLimitRate = u32UpLimitTime * 10000/u32MonitorTime;
	u32UpLimitRate = hex_bcd(u32UpLimitRate);
	u32LowLimitRate = u32LowLimitTime * 10000/u32MonitorTime;
	u32LowLimitRate = hex_bcd(u32LowLimitRate);
	u32UpLimitTime = hex_bcd(u32UpLimitTime);
	u32LowLimitTime = hex_bcd(u32LowLimitTime);
	u32MonitorTime = hex_bcd(u32MonitorTime);
	u32PassRateTime = hex_bcd(u32PassRateTime);
	MemCopy(pstPassRate_info->u8PassRate,&u32PassRate,3);
	MemCopy(pstPassRate_info->u8UpLimintRate,&u32UpLimitRate,3);
	MemCopy(pstPassRate_info->u8LowLimintRate,&u32LowLimitRate,3);
	MemCopy(pstPassRate_info->u8MonitorTime,&u32MonitorTime,3);
	MemCopy(pstPassRate_info->u8PassRateTime,&u32PassRateTime,3);
	MemCopy(pstPassRate_info->u8LowLimitTime,&u32LowLimitTime,3);
	MemCopy(pstPassRate_info->u8UpLimitTime,&u32UpLimitTime,3);	
}

#endif
/**--------------------------------------------------------------------
*功    能:统计数据，本日电流极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000014_16(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_CURRENT_EXTREME_PASSRATE_LIST_S* pstCurrentExtreme_List = (QCSG_CURRENT_EXTREME_PASSRATE_LIST_S*)QCSG_CURRENT_EXTREME_DAY;
	QCSG_CURRENT_EXTREME_PASSRATE_S* pstCurrentExtreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0,u8MeterType = 0;
	u32 u32Ia = 0,u32Ib = 0,u32Ic = 0,u32Imax = 0,u32Imin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) == TRUE)
	{
		//三相数据都是BCD，则说明是三相表，这里只做个简单判断，不再读取测量点参数
		u8MeterType = 3;
	}
	else if((QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) != TRUE) && ((QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) == TRUE)))
	{
		//单相表
		u8MeterType = 1;
	}
	else
	{
		return;
	}
	u8PnNum = pstCurrentExtreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstCurrentExtreme_List,0,sizeof(QCSG_CURRENT_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstCurrentExtreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstCurrentExtreme_List->stCurrentExtreme[i].u8Max_A_Current,sizeof(QCSG_CURRENT_EXTREME_PASSRATE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstCurrentExtreme_List,0,sizeof(QCSG_CURRENT_EXTREME_PASSRATE_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstCurrentExtreme_List->stCurrentExtreme[i].u16Pn)
		{
			pstCurrentExtreme_info = &pstCurrentExtreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstCurrentExtreme_info = &pstCurrentExtreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pstCurrentExtreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstCurrentExtreme_info->u16Pn = u16Pn;
			pstCurrentExtreme_List->u8PnNum ++;
		}
	}
	MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
	u32Ia &= 0x007FFFFF;
	u32Ia = QCSG_BCD2HEX((u8)(u32Ia>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ia>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ia);
	if(u8MeterType == 3)
	{
		MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
		MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
		u32Ib &= 0x007FFFFF;
		u32Ic &= 0x007FFFFF;		
		u32Ib = QCSG_BCD2HEX((u8)(u32Ib>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ib>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ib);
		u32Ic = QCSG_BCD2HEX((u8)(u32Ic>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ic>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ic);
	}
	MemCopy(&u32Imax,pstCurrentExtreme_info->u8Max_A_Current,3);
	MemCopy(&u32Imin,pstCurrentExtreme_info->u8Min_A_Current,3);
	if(u32Imin == 0)
	{
		u32Imin = 0x799999;
	}			
	u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
	u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
	if(u32Ia > u32Imax)
	{
		MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
		u32Ia &= 0x007FFFFF;
		MemCopy(pstCurrentExtreme_info->u8Max_A_Current,&u32Ia,3);
		pstCurrentExtreme_info->u8Max_A_Current_Time[0] = stCurr_Time.u8Minute;
		pstCurrentExtreme_info->u8Max_A_Current_Time[1] = stCurr_Time.u8Hour;
		pstCurrentExtreme_info->u8Max_A_Current_Time[2] = stCurr_Time.u8Day;
		pstCurrentExtreme_info->u8Max_A_Current_Time[3] = stCurr_Time.u8Month;
	}
	if(u32Ia < u32Imin)
	{
		MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
		u32Ia &= 0x007FFFFF;
		MemCopy(pstCurrentExtreme_info->u8Min_A_Current,&u32Ia,3);
		pstCurrentExtreme_info->u8Min_A_Current_Time[0] = stCurr_Time.u8Minute;
		pstCurrentExtreme_info->u8Min_A_Current_Time[1] = stCurr_Time.u8Hour;
		pstCurrentExtreme_info->u8Min_A_Current_Time[2] = stCurr_Time.u8Day;
		pstCurrentExtreme_info->u8Min_A_Current_Time[3] = stCurr_Time.u8Month;		
	}
	if(u8MeterType == 3)
	{	
		MemCopy(&u32Imax,pstCurrentExtreme_info->u8Max_B_Current,3);
		MemCopy(&u32Imin,pstCurrentExtreme_info->u8Min_B_Current,3);
		u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
		u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
		if(u32Imin == 0)
		{
			u32Imin = 0x799999;
		}			
		if(u32Ib > u32Imax)
		{
			MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
			u32Ib &= 0x007FFFFF;		
			MemCopy(pstCurrentExtreme_info->u8Max_B_Current,&u32Ib,3);
			pstCurrentExtreme_info->u8Max_B_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Max_B_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Max_B_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Max_B_Current_Time[3] = stCurr_Time.u8Month;
		}
		if(u32Ib < u32Imin)
		{
			MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
			u32Ib &= 0x007FFFFF;
			MemCopy(pstCurrentExtreme_info->u8Min_B_Current,&u32Ib,3);
			pstCurrentExtreme_info->u8Min_B_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Min_B_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Min_B_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Min_B_Current_Time[3] = stCurr_Time.u8Month;		
		}
		
		MemCopy(&u32Imax,pstCurrentExtreme_info->u8Max_C_Current,3);
		MemCopy(&u32Imin,pstCurrentExtreme_info->u8Min_C_Current,3);
		u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
		u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
		if(u32Imin == 0)
		{
			u32Imin = 0x799999;
		}			
		if(u32Ic > u32Imax)
		{
			MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
			u32Ic &= 0x007FFFFF;		
			MemCopy(pstCurrentExtreme_info->u8Max_C_Current,&u32Ic,3);
			pstCurrentExtreme_info->u8Max_C_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Max_C_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Max_C_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Max_C_Current_Time[3] = stCurr_Time.u8Month;
		}
		if(u32Ic < u32Imin)
		{
			MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
			u32Ic &= 0x007FFFFF;		
			MemCopy(pstCurrentExtreme_info->u8Min_C_Current,&u32Ic,3);
			pstCurrentExtreme_info->u8Min_C_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Min_C_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Min_C_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Min_C_Current_Time[3] = stCurr_Time.u8Month;		
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据，本月电流极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1004014_16(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_CURRENT_EXTREME_PASSRATE_LIST_S* pstCurrentExtreme_List = (QCSG_CURRENT_EXTREME_PASSRATE_LIST_S*)QCSG_CURRENT_EXTREME_MONTH;
	QCSG_CURRENT_EXTREME_PASSRATE_S* pstCurrentExtreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0,u8MeterType = 0;
	u32 u32Ia = 0,u32Ib = 0,u32Ic = 0,u32Imax = 0,u32Imin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) == TRUE)
	{
		//三相数据都是BCD，则说明是三相表，这里只做个简单判断，不再读取测量点参数
		u8MeterType = 3;
	}
	else if((QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],9) != TRUE) && ((QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) == TRUE)))
	{
		//单相表
		u8MeterType = 1;
	}
	else
	{
		return;
	}
	u8PnNum = pstCurrentExtreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstCurrentExtreme_List,0,sizeof(QCSG_CURRENT_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstCurrentExtreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstCurrentExtreme_List->stCurrentExtreme[i].u8Max_A_Current,sizeof(QCSG_CURRENT_EXTREME_PASSRATE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstCurrentExtreme_List,0,sizeof(QCSG_CURRENT_EXTREME_PASSRATE_LIST_S));
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点事件信息
		if(u16Pn == pstCurrentExtreme_List->stCurrentExtreme[i].u16Pn)
		{
			pstCurrentExtreme_info = &pstCurrentExtreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstCurrentExtreme_info = &pstCurrentExtreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pstCurrentExtreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstCurrentExtreme_info->u16Pn = u16Pn;
			pstCurrentExtreme_List->u8PnNum ++;
		}
	}
	MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
	u32Ia &= 0x007FFFFF;
	u32Ia = QCSG_BCD2HEX((u8)(u32Ia>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ia>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ia);
	if(u8MeterType == 3)
	{
		MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
		MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
		u32Ib &= 0x007FFFFF;
		u32Ic &= 0x007FFFFF;		
		u32Ib = QCSG_BCD2HEX((u8)(u32Ib>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ib>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ib);
		u32Ic = QCSG_BCD2HEX((u8)(u32Ic>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Ic>>8)) * 100 + QCSG_BCD2HEX((u8)u32Ic);
	}
	MemCopy(&u32Imax,pstCurrentExtreme_info->u8Max_A_Current,3);
	MemCopy(&u32Imin,pstCurrentExtreme_info->u8Min_A_Current,3);
	if(u32Imin == 0)
	{
		u32Imin = 0x799999;
	}				
	u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
	u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
	if(u32Ia > u32Imax)
	{
		MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
		u32Ia &= 0x007FFFFF;
		MemCopy(pstCurrentExtreme_info->u8Max_A_Current,&u32Ia,3);
		pstCurrentExtreme_info->u8Max_A_Current_Time[0] = stCurr_Time.u8Minute;
		pstCurrentExtreme_info->u8Max_A_Current_Time[1] = stCurr_Time.u8Hour;
		pstCurrentExtreme_info->u8Max_A_Current_Time[2] = stCurr_Time.u8Day;
		pstCurrentExtreme_info->u8Max_A_Current_Time[3] = stCurr_Time.u8Month;
	}
	if(u32Ia < u32Imin)
	{
		MemCopy(&u32Ia,&pstDlt645Frame_Info->u8RevBuf[14],3);
		u32Ia &= 0x007FFFFF;
		MemCopy(pstCurrentExtreme_info->u8Min_A_Current,&u32Ia,3);
		pstCurrentExtreme_info->u8Min_A_Current_Time[0] = stCurr_Time.u8Minute;
		pstCurrentExtreme_info->u8Min_A_Current_Time[1] = stCurr_Time.u8Hour;
		pstCurrentExtreme_info->u8Min_A_Current_Time[2] = stCurr_Time.u8Day;
		pstCurrentExtreme_info->u8Min_A_Current_Time[3] = stCurr_Time.u8Month;		
	}
	if(u8MeterType == 3)
	{	
		MemCopy(&u32Imax,pstCurrentExtreme_info->u8Max_B_Current,3);
		MemCopy(&u32Imin,pstCurrentExtreme_info->u8Min_B_Current,3);
		u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
		u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
		if(u32Imin == 0)
		{
			u32Imin = 0x799999;
		}	
		if(u32Ib > u32Imax)
		{
			MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
			u32Ib &= 0x007FFFFF;	
			MemCopy(pstCurrentExtreme_info->u8Max_B_Current,&u32Ib,3);
			pstCurrentExtreme_info->u8Max_B_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Max_B_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Max_B_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Max_B_Current_Time[3] = stCurr_Time.u8Month;
		}
		if(u32Ib < u32Imin)
		{
			MemCopy(&u32Ib,&pstDlt645Frame_Info->u8RevBuf[17],3);
			u32Ib &= 0x007FFFFF;	
			MemCopy(pstCurrentExtreme_info->u8Min_B_Current,&u32Ib,3);
			pstCurrentExtreme_info->u8Min_B_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Min_B_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Min_B_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Min_B_Current_Time[3] = stCurr_Time.u8Month;		
		}
		
		MemCopy(&u32Imax,pstCurrentExtreme_info->u8Max_C_Current,3);
		MemCopy(&u32Imin,pstCurrentExtreme_info->u8Min_C_Current,3);
		u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
		u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
		if(u32Imin == 0)
		{
			u32Imin = 0x799999;
		}	
		if(u32Ic > u32Imax)
		{
			MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
			u32Ic &= 0x007FFFFF;		
			MemCopy(pstCurrentExtreme_info->u8Max_C_Current,&u32Ic,3);
			pstCurrentExtreme_info->u8Max_C_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Max_C_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Max_C_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Max_C_Current_Time[3] = stCurr_Time.u8Month;
		}
		if(u32Ic < u32Imin)
		{
			MemCopy(&u32Ic,&pstDlt645Frame_Info->u8RevBuf[20],3);
			u32Ic &= 0x007FFFFF;		
			MemCopy(pstCurrentExtreme_info->u8Min_C_Current,&u32Ic,3);
			pstCurrentExtreme_info->u8Min_C_Current_Time[0] = stCurr_Time.u8Minute;
			pstCurrentExtreme_info->u8Min_C_Current_Time[1] = stCurr_Time.u8Hour;
			pstCurrentExtreme_info->u8Min_C_Current_Time[2] = stCurr_Time.u8Day;
			pstCurrentExtreme_info->u8Min_C_Current_Time[3] = stCurr_Time.u8Month;		
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日零序电流极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000017(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_N_CurrentExtreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_N_CURRENT_EXTREME_DAY;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_N_CurrentExtreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32In = 0,u32Imax = 0,u32Imin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pst_N_CurrentExtreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_N_CurrentExtreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_N_CurrentExtreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}			
		if(QCSG_BCDCheck(pst_N_CurrentExtreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_N_CurrentExtreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_N_CurrentExtreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_N_CurrentExtreme_info = &pst_N_CurrentExtreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_N_CurrentExtreme_info = &pst_N_CurrentExtreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_N_CurrentExtreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_N_CurrentExtreme_info->u16Pn = u16Pn;
			pst_N_CurrentExtreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32In,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	u32In &= 0x007FFFFF;
	u32In = QCSG_BCD2HEX((u8)(u32In>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32In>>8)) * 100 + QCSG_BCD2HEX((u8)u32In);
	MemCopy(&u32Imax,pst_N_CurrentExtreme_info->u8Max_Value,3);
	MemCopy(&u32Imin,pst_N_CurrentExtreme_info->u8Min_Value,3);
	if(u32Imin == 0)
	{
		u32Imin = 0x799999;
	}				
	u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
	u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
	if(u32In > u32Imax)
	{
		MemCopy(&u32In,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32In &= 0x007FFFFF;
		MemCopy(pst_N_CurrentExtreme_info->u8Max_Value,&u32In,3);
		pst_N_CurrentExtreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_N_CurrentExtreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_N_CurrentExtreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_N_CurrentExtreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32In < u32Imin)
	{
		MemCopy(&u32In,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32In &= 0x007FFFFF;
		MemCopy(pst_N_CurrentExtreme_info->u8Min_Value,&u32In,3);
		pst_N_CurrentExtreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_N_CurrentExtreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_N_CurrentExtreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_N_CurrentExtreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据，本月零序电流极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1004017(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_N_CurrentExtreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_N_CURRENT_EXTREME_MONTH;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_N_CurrentExtreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32In = 0,u32Imax = 0,u32Imin = 0;
	
