gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pst_N_CurrentExtreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_N_CurrentExtreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_N_CurrentExtreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}					
		if(QCSG_BCDCheck(pst_N_CurrentExtreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_N_CurrentExtreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_N_CurrentExtreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_N_CurrentExtreme_info = &pst_N_CurrentExtreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_N_CurrentExtreme_info = &pst_N_CurrentExtreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_N_CurrentExtreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_N_CurrentExtreme_info->u16Pn = u16Pn;
			pst_N_CurrentExtreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32In,&pstDlt645Frame_Info->u8RevBuf[14],3);
	u32In &= 0x007FFFFF;	
	u32In = QCSG_BCD2HEX((u8)(u32In>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32In>>8)) * 100 + QCSG_BCD2HEX((u8)u32In);
	MemCopy(&u32Imax,pst_N_CurrentExtreme_info->u8Max_Value,3);
	MemCopy(&u32Imin,pst_N_CurrentExtreme_info->u8Min_Value,3);
	if(u32Imin == 0)
	{
		u32Imin = 0x799999;
	}				
	u32Imax = QCSG_BCD2HEX((u8)(u32Imax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imax);
	u32Imin = QCSG_BCD2HEX((u8)(u32Imin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Imin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Imin);
	if(u32In > u32Imax)
	{
		MemCopy(&u32In,&pstDlt645Frame_Info->u8RevBuf[14],3);
		u32In &= 0x007FFFFF;
		MemCopy(pst_N_CurrentExtreme_info->u8Max_Value,&u32In,3);
		pst_N_CurrentExtreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_N_CurrentExtreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_N_CurrentExtreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_N_CurrentExtreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32In < u32Imin)
	{
		MemCopy(&u32In,&pstDlt645Frame_Info->u8RevBuf[14],3);
		u32In &= 0x007FFFFF;		
		MemCopy(pst_N_CurrentExtreme_info->u8Min_Value,&u32In,3);
		pst_N_CurrentExtreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_N_CurrentExtreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_N_CurrentExtreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_N_CurrentExtreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日有功功率极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000018(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Active_Power_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_ACTIVE_POWER_DAY;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Active_Power_Extreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32P = 0,u32Pmax = 0,u32Pmin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pst_Active_Power_Extreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Active_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Active_Power_Extreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pst_Active_Power_Extreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Active_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_Active_Power_Extreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_Active_Power_Extreme_info = &pst_Active_Power_Extreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_Active_Power_Extreme_info = &pst_Active_Power_Extreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_Active_Power_Extreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_Active_Power_Extreme_info->u16Pn = u16Pn;
			pst_Active_Power_Extreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	u32P &= 0x007FFFFF;
	u32P = QCSG_BCD2HEX((u8)(u32P>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32P>>8)) * 100 + QCSG_BCD2HEX((u8)u32P);
	MemCopy(&u32Pmax,pst_Active_Power_Extreme_info->u8Max_Value,3);
	MemCopy(&u32Pmin,pst_Active_Power_Extreme_info->u8Min_Value,3);
	if(u32Pmin == 0)
	{
		u32Pmin = 0x799999;
	}				
	u32Pmax = QCSG_BCD2HEX((u8)(u32Pmax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmax);
	u32Pmin = QCSG_BCD2HEX((u8)(u32Pmin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmin);
	if(u32P > u32Pmax)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;
		MemCopy(pst_Active_Power_Extreme_info->u8Max_Value,&u32P,3);
		pst_Active_Power_Extreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Active_Power_Extreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Active_Power_Extreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_Active_Power_Extreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32P < u32Pmin)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;
		MemCopy(pst_Active_Power_Extreme_info->u8Min_Value,&u32P,3);
		pst_Active_Power_Extreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Active_Power_Extreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Active_Power_Extreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_Active_Power_Extreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}		
}
/**--------------------------------------------------------------------
*功    能:统计数据，本月有功功率极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1004018(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Active_Power_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_ACTIVE_POWER_MONTH;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Active_Power_Extreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32P = 0,u32Pmax = 0,u32Pmin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pst_Active_Power_Extreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Active_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Active_Power_Extreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}			
		if(QCSG_BCDCheck(pst_Active_Power_Extreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Active_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}			
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_Active_Power_Extreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_Active_Power_Extreme_info = &pst_Active_Power_Extreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_Active_Power_Extreme_info = &pst_Active_Power_Extreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_Active_Power_Extreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_Active_Power_Extreme_info->u16Pn = u16Pn;
			pst_Active_Power_Extreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	u32P &= 0x007FFFFF;
	u32P = QCSG_BCD2HEX((u8)(u32P>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32P>>8)) * 100 + QCSG_BCD2HEX((u8)u32P);
	MemCopy(&u32Pmax,pst_Active_Power_Extreme_info->u8Max_Value,3);
	MemCopy(&u32Pmin,pst_Active_Power_Extreme_info->u8Min_Value,3);
	if(u32Pmin == 0)
	{
		u32Pmin = 0x799999;
	}		
	u32Pmax = QCSG_BCD2HEX((u8)(u32Pmax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmax);
	u32Pmin = QCSG_BCD2HEX((u8)(u32Pmin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmin);
	if(u32P > u32Pmax)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;
		MemCopy(pst_Active_Power_Extreme_info->u8Max_Value,&u32P,3);
		pst_Active_Power_Extreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Active_Power_Extreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Active_Power_Extreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_Active_Power_Extreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32P < u32Pmin)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;
		MemCopy(pst_Active_Power_Extreme_info->u8Min_Value,&u32P,3);
		pst_Active_Power_Extreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Active_Power_Extreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Active_Power_Extreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_Active_Power_Extreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}			
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日无功功率极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000019(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Reactive_Power_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_REACTIVE_POWER_DAY;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Reactive_Power_Extreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32P = 0,u32Pmax = 0,u32Pmin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pst_Reactive_Power_Extreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Reactive_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Reactive_Power_Extreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pst_Reactive_Power_Extreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Reactive_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_Reactive_Power_Extreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_Reactive_Power_Extreme_info = &pst_Reactive_Power_Extreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_Reactive_Power_Extreme_info = &pst_Reactive_Power_Extreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_Reactive_Power_Extreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_Reactive_Power_Extreme_info->u16Pn = u16Pn;
			pst_Reactive_Power_Extreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	u32P &= 0x007FFFFF;	
	u32P = QCSG_BCD2HEX((u8)(u32P>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32P>>8)) * 100 + QCSG_BCD2HEX((u8)u32P);
	MemCopy(&u32Pmax,pst_Reactive_Power_Extreme_info->u8Max_Value,3);
	MemCopy(&u32Pmin,pst_Reactive_Power_Extreme_info->u8Min_Value,3);
	if(u32Pmin == 0)
	{
		u32Pmin = 0x799999;
	}		
	u32Pmax = QCSG_BCD2HEX((u8)(u32Pmax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmax);
	u32Pmin = QCSG_BCD2HEX((u8)(u32Pmin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmin);
	if(u32P > u32Pmax)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;	
		MemCopy(pst_Reactive_Power_Extreme_info->u8Max_Value,&u32P,3);
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32P < u32Pmin)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;	
		MemCopy(pst_Reactive_Power_Extreme_info->u8Min_Value,&u32P,3);
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}		
}
/**--------------------------------------------------------------------
*功    能:统计数据，本月无功功率极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1004019(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Reactive_Power_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_REACTIVE_POWER_MONTH;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Reactive_Power_Extreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32P = 0,u32Pmax = 0,u32Pmin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],3) != TRUE)
	{
		return;
	}
	u8PnNum = pst_Reactive_Power_Extreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Reactive_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Reactive_Power_Extreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}				
		if(QCSG_BCDCheck(pst_Reactive_Power_Extreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Reactive_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}			
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_Reactive_Power_Extreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_Reactive_Power_Extreme_info = &pst_Reactive_Power_Extreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_Reactive_Power_Extreme_info = &pst_Reactive_Power_Extreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_Reactive_Power_Extreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_Reactive_Power_Extreme_info->u16Pn = u16Pn;
			pst_Reactive_Power_Extreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
	u32P &= 0x007FFFFF;	
	u32P = QCSG_BCD2HEX((u8)(u32P>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32P>>8)) * 100 + QCSG_BCD2HEX((u8)u32P);
	MemCopy(&u32Pmax,pst_Reactive_Power_Extreme_info->u8Max_Value,3);
	MemCopy(&u32Pmin,pst_Reactive_Power_Extreme_info->u8Min_Value,3);
	if(u32Pmin == 0)
	{
		u32Pmin = 0x799999;
	}		
	u32Pmax = QCSG_BCD2HEX((u8)(u32Pmax>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmax);
	u32Pmin = QCSG_BCD2HEX((u8)(u32Pmin>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32Pmin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pmin);
	if(u32P > u32Pmax)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;	
		MemCopy(pst_Reactive_Power_Extreme_info->u8Max_Value,&u32P,3);
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_Reactive_Power_Extreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32P < u32Pmin)
	{
		MemCopy(&u32P,&pstDlt645Frame_Info->u8RevBuf[14],3);	
		u32P &= 0x007FFFFF;	
		MemCopy(pst_Reactive_Power_Extreme_info->u8Min_Value,&u32P,3);
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_Reactive_Power_Extreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}				
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日功率因数极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E100001A(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Power_Factor_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_POWER_FACTOR_DAY;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Power_Factor_Extreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32Pf = 0,u32Pfmax = 0,u32Pfmin = 0;
	
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],2) != TRUE)
	{
		return;
	}
	u8PnNum = pst_Power_Factor_Extreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Power_Factor_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Power_Factor_Extreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pst_Power_Factor_Extreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Power_Factor_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}			
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_Power_Factor_Extreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_Power_Factor_Extreme_info = &pst_Power_Factor_Extreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_Power_Factor_Extreme_info = &pst_Power_Factor_Extreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_Power_Factor_Extreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_Power_Factor_Extreme_info->u16Pn = u16Pn;
			pst_Power_Factor_Extreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32Pf,&pstDlt645Frame_Info->u8RevBuf[14],2);
	u32Pf &= 0x00007FFF;	
	u32Pf = QCSG_BCD2HEX((u8)(u32Pf>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pf);
	MemCopy(&u32Pfmax,pst_Power_Factor_Extreme_info->u8Max_Value,2);
	MemCopy(&u32Pfmin,pst_Power_Factor_Extreme_info->u8Min_Value,2);
	u32Pfmax = QCSG_BCD2HEX((u8)(u32Pfmax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pfmax);
	u32Pfmin = QCSG_BCD2HEX((u8)(u32Pfmin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pfmin);
	if(u32Pfmin == 0)
	{
		u32Pfmin = 0x7999;
	}			
	if(u32Pf > u32Pfmax)
	{
		MemCopy(&u32Pf,&pstDlt645Frame_Info->u8RevBuf[14],2);
		u32Pf &= 0x00007FFF;	
		MemCopy(pst_Power_Factor_Extreme_info->u8Max_Value,&u32Pf,2);
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32Pf < u32Pfmin)
	{
		MemCopy(&u32Pf,&pstDlt645Frame_Info->u8RevBuf[14],2);
		u32Pf &= 0x00007FFF;		
		MemCopy(pst_Power_Factor_Extreme_info->u8Min_Value,&u32Pf,2);
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}		
}
/**--------------------------------------------------------------------
*功    能:统计数据，本月功率因数极值统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E100401A(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Power_Factor_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_POWER_FACTOR_MONTH;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Power_Factor_Extreme_info = NULL;	
	TIME_PARAM_S stCurr_Time;
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u32 u32Pf = 0,u32Pfmax = 0,u32Pfmin = 0;
	
