gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	if(HAL_GetSystemTime(&stCurr_Time) != TRUE)
	{
		return;
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],2) != TRUE)
	{
		return;
	}
	u8PnNum = pst_Power_Factor_Extreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Power_Factor_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}		
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Power_Factor_Extreme_List->stCurrentExtreme[i].u16Pn,1) != TRUE)
		{
			break;
		}				
		if(QCSG_BCDCheck(pst_Power_Factor_Extreme_List->stCurrentExtreme[i].u8Max_Value,sizeof(QCSG_VALUE_EXTREME_PASSRATE_S) - 4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Power_Factor_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_Power_Factor_Extreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_Power_Factor_Extreme_info = &pst_Power_Factor_Extreme_List->stCurrentExtreme[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pst_Power_Factor_Extreme_info = &pst_Power_Factor_Extreme_List->stCurrentExtreme[u8PnNum];
			MemSet(pst_Power_Factor_Extreme_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pst_Power_Factor_Extreme_info->u16Pn = u16Pn;
			pst_Power_Factor_Extreme_List->u8PnNum ++;
		}
	}	
	MemCopy(&u32Pf,&pstDlt645Frame_Info->u8RevBuf[14],2);	
	u32Pf &= 0x00007FFF;
	u32Pf = QCSG_BCD2HEX((u8)(u32Pf>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pf);
	MemCopy(&u32Pfmax,pst_Power_Factor_Extreme_info->u8Max_Value,2);
	MemCopy(&u32Pfmin,pst_Power_Factor_Extreme_info->u8Min_Value,2);
	if(u32Pfmin == 0)
	{
		u32Pfmin = 0x7999;
	}		
	u32Pfmax = QCSG_BCD2HEX((u8)(u32Pfmax>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pfmax);
	u32Pfmin = QCSG_BCD2HEX((u8)(u32Pfmin>>8)) * 100 + QCSG_BCD2HEX((u8)u32Pfmin);
	if(u32Pf > u32Pfmax)
	{
		MemCopy(&u32Pf,&pstDlt645Frame_Info->u8RevBuf[14],2);	
		u32Pf &= 0x00007FFF;		
		MemCopy(pst_Power_Factor_Extreme_info->u8Max_Value,&u32Pf,2);
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[2] = stCurr_Time.u8Day;
		pst_Power_Factor_Extreme_info->u8Max_Value_Time[3] = stCurr_Time.u8Month;
	}
	if(u32Pf < u32Pfmin)
	{
		MemCopy(&u32Pf,&pstDlt645Frame_Info->u8RevBuf[14],2);	
		u32Pf &= 0x00007FFF;		
		MemCopy(pst_Power_Factor_Extreme_info->u8Min_Value,&u32Pf,2);
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[0] = stCurr_Time.u8Minute;
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[1] = stCurr_Time.u8Hour;
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[2] = stCurr_Time.u8Day;
		pst_Power_Factor_Extreme_info->u8Min_Value_Time[3] = stCurr_Time.u8Month;		
	}		
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日电流不平衡越限统计数据
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E100001B(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	//统计本日不平衡（实时数据），统计日冻结不平衡（冻结数据）
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日电压不平衡越限统计数据
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E100001C(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	//统计本日不平衡（实时数据），统计日冻结不平衡（冻结数据）	
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日断相数据
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000030(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日失压数据
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000031(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日失流数据
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000032(u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日功率因数区段统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000033(u8 u8Cycle,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_POWER_FACTOR_ZONE_LIST_S* pstPowerFactor_Zone_List = (QCSG_POWER_FACTOR_ZONE_LIST_S*)QCSG_POWER_FACTOR_ZONE_DAY;
	QCSG_POWER_FACTOR_ZONE_S* pstPowerFactor_Zone_info = NULL;	
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u16 u16PowerFactor = 0;
	u32 u32ReadLen = 0,u32SumTime = 0;
	PowerQualityParaStruct stPowerQualityPara;
	
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[14],2) != TRUE)
	{
		return;
	}
	MemCopy(&u16PowerFactor,&pstDlt645Frame_Info->u8RevBuf[14],2);
	u16PowerFactor &= 0x7FFF;
	u8PnNum = pstPowerFactor_Zone_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPowerFactor_Zone_List,0,sizeof(QCSG_POWER_FACTOR_ZONE_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPowerFactor_Zone_List->stPowerFactorZone[i].u16Pn,1) != TRUE)
		{
			break;
		}		
		if(QCSG_BCDCheck(pstPowerFactor_Zone_List->stPowerFactorZone[i].u8MonitorTime,sizeof(QCSG_POWER_FACTOR_ZONE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPowerFactor_Zone_List,0,sizeof(QCSG_POWER_FACTOR_ZONE_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPowerFactor_Zone_List->stPowerFactorZone[i].u16Pn)
		{
			pstPowerFactor_Zone_info = &pstPowerFactor_Zone_List->stPowerFactorZone[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstPowerFactor_Zone_info = &pstPowerFactor_Zone_List->stPowerFactorZone[u8PnNum];
			MemSet(pstPowerFactor_Zone_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstPowerFactor_Zone_info->u16Pn = u16Pn;
			pstPowerFactor_Zone_List->u8PnNum ++;
		}
	}
	//读取功率因数区段定值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE0800205,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8MonitorTime,3);
	u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
	u32SumTime += u8Cycle;
	u32SumTime = hex_bcd(u32SumTime);
	MemCopy(pstPowerFactor_Zone_info->u8MonitorTime,&u32SumTime,3);
	if(u16PowerFactor < stPowerQualityPara.E0800205[0])
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone1Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone1Time,&u32SumTime,3);		
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[0]) && (u16PowerFactor < stPowerQualityPara.E0800205[1]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone2Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone2Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[1]) && (u16PowerFactor < stPowerQualityPara.E0800205[2]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone3Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone3Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[2]) && (u16PowerFactor < stPowerQualityPara.E0800205[3]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone4Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone4Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[3]) && (u16PowerFactor < stPowerQualityPara.E0800205[4]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone5Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone5Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[4]) && (u16PowerFactor < stPowerQualityPara.E0800205[5]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone6Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone6Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[5]) && (u16PowerFactor < stPowerQualityPara.E0800205[6]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone7Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone7Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[6]) && (u16PowerFactor < stPowerQualityPara.E0800205[7]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone8Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone8Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[7]) && (u16PowerFactor < stPowerQualityPara.E0800205[8]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone9Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone9Time,&u32SumTime,3);			
	}
	if(u16PowerFactor >= stPowerQualityPara.E0800205[8])
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone10Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone10Time,&u32SumTime,3);			
	}	
}
/**--------------------------------------------------------------------
*功    能:统计数据，本日功率因数区段统计
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info，pu8MeterId
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_StatisticsData_E1000034(u8 u8Cycle,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_POWER_FACTOR_ZONE_LIST_S* pstPowerFactor_Zone_List = (QCSG_POWER_FACTOR_ZONE_LIST_S*)QCSG_POWER_FACTOR_ZONE_A_DAY;
	QCSG_POWER_FACTOR_ZONE_S* pstPowerFactor_Zone_info = NULL;	
	u8 u8PnNum = 0,u8CtrlCode = 0,i = 0;
	u16 u16PowerFactor = 0;
	u32 u32ReadLen = 0,u32SumTime = 0;
	PowerQualityParaStruct stPowerQualityPara;
	
