gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	if(u8CtrlCode != 0x91)
	{
		return;
	}		
	if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[20],2) != TRUE)
	{
		return;
	}
	MemCopy(&u16PowerFactor,&pstDlt645Frame_Info->u8RevBuf[20],2);
	u16PowerFactor &= 0x7FFF;
	u8PnNum = pstPowerFactor_Zone_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPowerFactor_Zone_List,0,sizeof(QCSG_POWER_FACTOR_ZONE_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPowerFactor_Zone_List->stPowerFactorZone[i].u16Pn,1) != TRUE)
		{
			break;
		}				
		if(QCSG_BCDCheck(pstPowerFactor_Zone_List->stPowerFactorZone[i].u8MonitorTime,sizeof(QCSG_POWER_FACTOR_ZONE_S) - 2) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPowerFactor_Zone_List,0,sizeof(QCSG_POWER_FACTOR_ZONE_LIST_S));
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPowerFactor_Zone_List->stPowerFactorZone[i].u16Pn)
		{
			pstPowerFactor_Zone_info = &pstPowerFactor_Zone_List->stPowerFactorZone[i];
			break;
		}
	}
	if(i >= u8PnNum)
	{
		//测量点之前未有记录，则添加到记录中,此次不做任何处理
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstPowerFactor_Zone_info = &pstPowerFactor_Zone_List->stPowerFactorZone[u8PnNum];
			MemSet(pstPowerFactor_Zone_info,0,sizeof(QCSG_VOLTAGE_PASSRATE_S));
			pstPowerFactor_Zone_info->u16Pn = u16Pn;
			pstPowerFactor_Zone_List->u8PnNum ++;
		}
	}
	//读取功率因数区段定值	
	u32ReadLen = sizeof(PowerQualityParaStruct);
	if(NAND_ReadMeasurePoint(0,0xE0800205,(u8*)&stPowerQualityPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8MonitorTime,3);
	u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
	u32SumTime += u8Cycle;
	u32SumTime = hex_bcd(u32SumTime);
	MemCopy(pstPowerFactor_Zone_info->u8MonitorTime,&u32SumTime,3);
	if(u16PowerFactor < stPowerQualityPara.E0800205[0])
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone1Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone1Time,&u32SumTime,3);		
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[0]) && (u16PowerFactor < stPowerQualityPara.E0800205[1]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone2Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone2Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[1]) && (u16PowerFactor < stPowerQualityPara.E0800205[2]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone3Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone3Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[2]) && (u16PowerFactor < stPowerQualityPara.E0800205[3]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone4Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone4Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[3]) && (u16PowerFactor < stPowerQualityPara.E0800205[4]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone5Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone5Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[4]) && (u16PowerFactor < stPowerQualityPara.E0800205[5]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone6Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone6Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[5]) && (u16PowerFactor < stPowerQualityPara.E0800205[6]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone7Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone7Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[6]) && (u16PowerFactor < stPowerQualityPara.E0800205[7]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone8Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone8Time,&u32SumTime,3);			
	}
	if((u16PowerFactor >= stPowerQualityPara.E0800205[7]) && (u16PowerFactor < stPowerQualityPara.E0800205[8]))
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone9Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone9Time,&u32SumTime,3);			
	}
	if(u16PowerFactor >= stPowerQualityPara.E0800205[8])
	{
		MemCopy(&u32SumTime,pstPowerFactor_Zone_info->u8Zone10Time,3);
		u32SumTime = QCSG_BCD2HEX((u8)(u32SumTime>>16)) * 10000 + QCSG_BCD2HEX((u8)(u32SumTime>>8)) * 100 + QCSG_BCD2HEX((u8)u32SumTime);
		u32SumTime += u8Cycle;
		u32SumTime = hex_bcd(u32SumTime);
		MemCopy(pstPowerFactor_Zone_info->u8Zone10Time,&u32SumTime,3);			
	}	
}
/**--------------------------------------------------------------------
*功    能:计算控制用月电量并写入RAM暂存
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Calc_Energy_TO_Ram(u16 u16Pn,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	QCSG_MONTH_ENERGY_LIST_S* pst_Month_Energy_List = (QCSG_MONTH_ENERGY_LIST_S*)QCSG_MONTH_ENERGY_LIST_CTRL;
	QCSG_ENERGY_S* pstEnergy_Data = NULL;
	MeasurePointStruct stPnPara;
	u8 u8PnNum,i = 0,u8Dlt645DataPos = 0;
	u32 u32Ident = 0,u32LastValue = 0,u32CurrValue = 0,u32SaveValue = 0,u32ReadLen = 0;	
	
	if(u8ProtocolType == METER_DLT645_97)
	{
		MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],2);
		if(u32Ident != 0x901F)
		{
			return;
		}
		u8Dlt645DataPos = 12;
	}
	else if(u8ProtocolType == METER_DLT645_07)
	{
		MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);
		if(u32Ident != 0x0001FF00)
		{
			return;
		}
		u8Dlt645DataPos = 14;		//定位至数据单元
	}
	else
	{
		return;
	}
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));
		return;
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn,1) != TRUE)
		{
			break;
		}				
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));
		return;
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}	
	MemCopy(&u32LastValue,pstRam_Data->u8Data00010000,4);
	MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4);
	u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
				 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
				 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
				 + QCSG_BCD2HEX((u8)u32LastValue);
	u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
				 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
				 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
				 + QCSG_BCD2HEX((u8)u32CurrValue);
	if(u32CurrValue < u32LastValue)
	{
		return;
	}
	u8PnNum = pst_Month_Energy_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Month_Energy_List,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00010000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u16Pn,1) != TRUE)
		{
			break;
		}		
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Month_Energy_List,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));		
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pst_Month_Energy_List->stPn_Ram_Data[i].u16Pn)	//原先已有数据
		{
			pstEnergy_Data = &pst_Month_Energy_List->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)			//第一次保存
	{
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEnergy_Data = &pst_Month_Energy_List->stPn_Ram_Data[u8PnNum];
			pstEnergy_Data->u16Pn = u16Pn;
			pstEnergy_Data->u32Energy00010000 = 0;
			pst_Month_Energy_List->u8PnNum++;
		}
		else
		{
			return;
		}
	}	
	if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
	{
		return;
	}
	if((stPnPara.CT == 0) || (stPnPara.PT == 0) || (stPnPara.CT == 0xFF) || (stPnPara.PT == 0xFF))
	{
		return;
	}
	u32SaveValue = pstEnergy_Data->u32Energy00010000;
	u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
				 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
				 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
				 + QCSG_BCD2HEX((u8)u32SaveValue);
	stPnPara.CT = QCSG_BCD2HEX((u8)(stPnPara.CT>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.CT);
	stPnPara.PT = QCSG_BCD2HEX((u8)(stPnPara.PT>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.PT);
	u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue) * stPnPara.CT * stPnPara.PT;
	pstEnergy_Data->u32Energy00010000 = hex_bcd(u32SaveValue);
}
/**--------------------------------------------------------------------
*功    能:计算控制用月电量并写入RAM暂存
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Calc_Lcd_Energy_TO_Ram(u16 u16Pn,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	QCSG_DAY_ENERGY_LIST_S* pst_Day_Energy_List = (QCSG_DAY_ENERGY_LIST_S*)QCSG_DAY_ENERGY_LIST_LCD;
	QCSG_MONTH_ENERGY_LIST_S* pst_Month_Energy_List = (QCSG_MONTH_ENERGY_LIST_S*)QCSG_MONTH_ENERGY_LIST_LCD;
	QCSG_ENERGY_S* pstEnergy_Data = NULL;	
	QCSG_ENERGY_S* pstMonth_Energy_Data = NULL;	
	u8 u8PnNum,i = 0,u8Dlt645DataPos = 0,u8DataLen = 0,u8CtrlCode = 0;
	u32 u32Ident = 0,u32LastValue = 0,u32CurrValue = 0,u32SaveValue = 0;	
	
