gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8DataLen = pstDlt645Frame_Info->u8RevBuf[9];
	if((u8CtrlCode == 0xC1) || (u8CtrlCode == 0xD1))
	{
		return;
	}
	if(u8ProtocolType == METER_DLT645_97)
	{
		MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],2);
		u8Dlt645DataPos = 12;
	}
	else if(u8ProtocolType == METER_DLT645_07)
	{
		MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);
		u8Dlt645DataPos = 14;
	}
	else
	{
		return;
	}	
	//校验RAM中存储的示值数据
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));
		return;
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn,1) != TRUE)
		{
			break;
		}		
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));	
		return;
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return;
	}		
	//如果反向有功示值没抄读过，不处理电能量数据，若抄读过，则正向示值也抄读过
	if(pstRam_Data->u8RdDoneFlag != TRUE)
	{
		return;
	}


	
	u8PnNum = pst_Day_Energy_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Day_Energy_List,0,sizeof(QCSG_DAY_ENERGY_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00010000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00010100,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00010200,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00010300,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00010400,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00020000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00020100,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00020200,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00020300,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00020400,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00030000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Day_Energy_List->stPn_Ram_Data[i].u32Energy00040000,4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Day_Energy_List,0,sizeof(QCSG_DAY_ENERGY_LIST_S));		
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pst_Day_Energy_List->stPn_Ram_Data[i].u16Pn)
		{
			pstEnergy_Data = &pst_Day_Energy_List->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)		//第一次保存
	{
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstEnergy_Data = &pst_Day_Energy_List->stPn_Ram_Data[u8PnNum];
			pstEnergy_Data->u16Pn = u16Pn;
			pstEnergy_Data->u32Energy00010000 = 0;
			pstEnergy_Data->u32Energy00010100 = 0;
			pstEnergy_Data->u32Energy00010200 = 0;
			pstEnergy_Data->u32Energy00010300 = 0;
			pstEnergy_Data->u32Energy00010400 = 0;
			pstEnergy_Data->u32Energy00020000 = 0;
			pstEnergy_Data->u32Energy00020100 = 0;
			pstEnergy_Data->u32Energy00020200 = 0;
			pstEnergy_Data->u32Energy00020300 = 0;
			pstEnergy_Data->u32Energy00020400 = 0;
			pstEnergy_Data->u32Energy00030000 = 0;
			pstEnergy_Data->u32Energy00040000 = 0;
			pst_Day_Energy_List->u8PnNum++;
		}
		else
		{
			return;
		}
	}		




	
	u8PnNum = pst_Month_Energy_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Month_Energy_List,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00010000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00010100,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00010200,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00010300,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00010400,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00020000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00020100,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00020200,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00020300,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00020400,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00030000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00040000,4) != TRUE)
		{
			break;
		}
	}
	if(i < MAX_PN_NUM2)
	{
		MemSet(pst_Month_Energy_List,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));		
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pst_Month_Energy_List->stPn_Ram_Data[i].u16Pn)
		{
			pstMonth_Energy_Data = &pst_Month_Energy_List->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)		//第一次保存
	{
		if(u8PnNum < MAX_PN_NUM2)	
		{
			pstMonth_Energy_Data = &pst_Month_Energy_List->stPn_Ram_Data[u8PnNum];
			pstMonth_Energy_Data->u16Pn = u16Pn;
			pstMonth_Energy_Data->u32Energy00010000 = 0;
			pstMonth_Energy_Data->u32Energy00010100 = 0;
			pstMonth_Energy_Data->u32Energy00010200 = 0;
			pstMonth_Energy_Data->u32Energy00010300 = 0;
			pstMonth_Energy_Data->u32Energy00010400 = 0;
			pstMonth_Energy_Data->u32Energy00020000 = 0;
			pstMonth_Energy_Data->u32Energy00020100 = 0;
			pstMonth_Energy_Data->u32Energy00020200 = 0;
			pstMonth_Energy_Data->u32Energy00020300 = 0;
			pstMonth_Energy_Data->u32Energy00020400 = 0;
			pstMonth_Energy_Data->u32Energy00030000 = 0;
			pstMonth_Energy_Data->u32Energy00040000 = 0;
			pst_Month_Energy_List->u8PnNum++;
		}
		else
		{
			return;
		}
	}		

	
	if((u32Ident == 0x901F) || (u32Ident == 0x0001FF00))
	{
		if(QCSG_BCDCheck(pstRam_Data->u8Data00010000,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00010000,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00010000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00010000 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00010000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00010000 = hex_bcd(u32SaveValue);
				}
			}

