gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
		}
		if((u8DataLen/4) == 1)
		{
			return;
		}

		
		if(QCSG_BCDCheck(pstRam_Data->u8Data00010100,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00010100,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 4],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 4],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00010100;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00010100 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00010100;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00010100 = hex_bcd(u32SaveValue);
				}
			}
		}
		if((u8DataLen/4) == 2)
		{
			return;
		}
		if(QCSG_BCDCheck(pstRam_Data->u8Data00010200,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00010200,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 8],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 8],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00010200;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00010200 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00010200;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00010200 = hex_bcd(u32SaveValue);
				}
			}
		}
		if((u8DataLen/4) == 3)
		{
			return;
		}
		if(QCSG_BCDCheck(pstRam_Data->u8Data00010300,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00010300,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 12],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 12],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00010300;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00010300 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00010300;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00010300 = hex_bcd(u32SaveValue);
				}
			}
		}
		if((u8DataLen/4) == 4)
		{
			return;
		}
		if(QCSG_BCDCheck(pstRam_Data->u8Data00010400,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00010400,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 16],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 16],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00010400;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00010400 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00010400;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00010400 = hex_bcd(u32SaveValue);
				}
			}
		}
	}
	if((u32Ident == 0x902F) || (u32Ident == 0x0002FF00))
	{
		if(QCSG_BCDCheck(pstRam_Data->u8Data00020000,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00020000,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00020000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00020000 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00020000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00020000 = hex_bcd(u32SaveValue);
				}
			}
		}
		if((u8DataLen/4) == 1)
		{
			return;
		}
		if(QCSG_BCDCheck(pstRam_Data->u8Data00020100,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00020100,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 4],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 4],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00020100;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00020100 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00020100;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00020100 = hex_bcd(u32SaveValue);
				}
			}
		}
		if((u8DataLen/4) == 2)
		{
			return;
		}
		if(QCSG_BCDCheck(pstRam_Data->u8Data00020200,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00020200,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 8],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 8],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00020200;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00020200 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00020200;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00020200 = hex_bcd(u32SaveValue);
				}
			}
		}
		if((u8DataLen/4) == 3)
		{
			return;
		}
		if(QCSG_BCDCheck(pstRam_Data->u8Data00020300,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00020300,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 12],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 12],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00020300;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00020300 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00020300;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00020300 = hex_bcd(u32SaveValue);
				}
			}
		}
		if((u8DataLen/4) == 4)
		{
			return;
		}
		if(QCSG_BCDCheck(pstRam_Data->u8Data00020400,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00020400,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 16],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos + 16],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00020400;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00020400 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00020400;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00020400 = hex_bcd(u32SaveValue);
				}
			}
		}		
	}
	if((u32Ident == 0x911F) || (u32Ident == 0x0003FF00))
	{
		if(QCSG_BCDCheck(pstRam_Data->u8Data00030000,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00030000,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);	
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00030000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00030000 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00030000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00030000 = hex_bcd(u32SaveValue);
				}				
			}			
		}		
	}
	if((u32Ident == 0x902F) || (u32Ident == 0x0004FF00))
	{
		if(QCSG_BCDCheck(pstRam_Data->u8Data00040000,4) == TRUE)
		{
			MemCopy(&u32LastValue,pstRam_Data->u8Data00040000,4);
			if(QCSG_BCDCheck(&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4) == TRUE)
			{
				MemCopy(&u32CurrValue,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],4);
				u32LastValue = QCSG_BCD2HEX((u8)(u32LastValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32LastValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32LastValue);
				u32CurrValue = QCSG_BCD2HEX((u8)(u32CurrValue >> 24)) * 1000000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 16)) * 10000
							 + QCSG_BCD2HEX((u8)(u32CurrValue >> 8)) * 100
							 + QCSG_BCD2HEX((u8)u32CurrValue);	
				if(u32CurrValue >= u32LastValue)
				{
					u32SaveValue = pstEnergy_Data->u32Energy00040000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstEnergy_Data->u32Energy00040000 = hex_bcd(u32SaveValue);
					u32SaveValue = pstMonth_Energy_Data->u32Energy00040000;
					u32SaveValue = QCSG_BCD2HEX((u8)(u32SaveValue >> 24)) * 1000000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 16)) * 10000
						 + QCSG_BCD2HEX((u8)(u32SaveValue >> 8)) * 100
						 + QCSG_BCD2HEX((u8)u32SaveValue);
					u32SaveValue = u32SaveValue + (u32CurrValue - u32LastValue);
					pstMonth_Energy_Data->u32Energy00040000 = hex_bcd(u32SaveValue);
				}				
			}			
		}			
	}
}
/**--------------------------------------------------------------------
*功    能:LCD显示用数据写入内存
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_WriteLcdData_TO_Ram(u16 u16Pn,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_LCD_RAMDATA_LIST_S* pstPn_Ram_Data = (QCSG_LCD_RAMDATA_LIST_S*)QCSG_LCD_RAM_LIST;
	QCSG_LCD_RAMDATA_S* pstRam_Data = NULL;	
	u8 u8PnNum = 0,i = 0,u8CtrlCode = 0,u8DataLen = 0;
	u32 u32Ident = 0,u32Value = 0;
	
