gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_LCD_RAMDATA_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPnLcdRamData[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPnLcdRamData[i];
			break;
		}
	}	
	if(i >= u8PnNum)		//第一次保存
	{
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstRam_Data = &pstPn_Ram_Data->stPnLcdRamData[u8PnNum];
			pstRam_Data->u16Pn = u16Pn;
			pstPn_Ram_Data->u8PnNum++;
		}
		else
		{
			return;
		}
	}
	if(u8ProtocolType == METER_DLT645_97)
	{
		MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],2);
	}
	else
	{
		MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);		
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];	
	u8CtrlCode &= 0xDF;
	u8DataLen = pstDlt645Frame_Info->u8RevBuf[9];
	switch(u32Ident)
	{
		case 0x901F:
			MemSet(pstRam_Data->u8Data0001FF00,0xFF,sizeof(pstRam_Data->u8Data0001FF00));
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0001FF00,&pstDlt645Frame_Info->u8RevBuf[12],u8DataLen - 2);
			}				
			break;
		case 0x902F:
			MemSet(pstRam_Data->u8Data0002FF00,0xFF,sizeof(pstRam_Data->u8Data0002FF00));
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0002FF00,&pstDlt645Frame_Info->u8RevBuf[12],u8DataLen - 2);
			}					
			break;	
		case 0x911F:
			MemSet(pstRam_Data->u8Data0003FF00,0xFF,sizeof(pstRam_Data->u8Data0003FF00));
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0003FF00,&pstDlt645Frame_Info->u8RevBuf[12],u8DataLen - 2);
			}					
			break;	
		case 0x912F:
			MemSet(pstRam_Data->u8Data0004FF00,0xFF,sizeof(pstRam_Data->u8Data0004FF00));
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0004FF00,&pstDlt645Frame_Info->u8RevBuf[12],u8DataLen - 2);
			}					
			break;				
		    //A相电压
		case 0xB611:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&u32Value,&pstDlt645Frame_Info->u8RevBuf[12],2);
				u32Value = (u32Value << 4) & 0xFFFFFFF0;
				MemCopy(pstRam_Data->u8Data0201FF00,&u32Value,2);
			}
			break;
			//B相电压
		case 0xB612:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&u32Value,&pstDlt645Frame_Info->u8RevBuf[12],2);
				u32Value = (u32Value << 4) & 0xFFFFFFF0;				
				MemCopy(&pstRam_Data->u8Data0201FF00[2],&u32Value,2);
			}			
			break;
			//C相电压
		case 0xB613:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&u32Value,&pstDlt645Frame_Info->u8RevBuf[12],2);
				u32Value = (u32Value << 4) & 0xFFFFFFF0;					
				MemCopy(&pstRam_Data->u8Data0201FF00[4],&u32Value,2);
			}				
			break;
			//A相电流
		case 0xB621:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&u32Value,&pstDlt645Frame_Info->u8RevBuf[12],2);
				u32Value = (u32Value << 4) & 0xfffffff0;
				MemCopy(pstRam_Data->u8Data0202FF00,&u32Value,3);
			}					
			break;
			//B相电流
		case 0xB622:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&u32Value,&pstDlt645Frame_Info->u8RevBuf[12],2);
				u32Value = (u32Value << 4) & 0xfffffff0;
				MemCopy(&pstRam_Data->u8Data0202FF00[3],&u32Value,3);
			}	
			break;
			//C相电流
		case 0xB623:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&u32Value,&pstDlt645Frame_Info->u8RevBuf[12],2);
				u32Value = (u32Value << 4) & 0xfffffff0;
				MemCopy(&pstRam_Data->u8Data0202FF00[6],&u32Value,3);
			}				
			break;
			//有功功率
		case 0xB630:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0203FF00,&pstDlt645Frame_Info->u8RevBuf[12],3);
			}				
			break;
		case 0xB631:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0203FF00[3],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}						
			break;
		case 0xB632:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0203FF00[6],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}				
			break;
		case 0xB633:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0203FF00[9],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}							
			break;
			//无功功率
		case 0xB640:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0204FF00,&pstDlt645Frame_Info->u8RevBuf[12],3);
			}						
			break;
		case 0xB641:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0204FF00[3],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}					
			break;
		case 0xB642:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0204FF00[6],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}						
			break;
		case 0xB643:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0204FF00[9],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}						
			break;
			//总功率因数
		case 0xB650:
			MemSet(pstRam_Data->u8Data0206FF00,0xFF,sizeof(pstRam_Data->u8Data0206FF00));
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0206FF00,&pstDlt645Frame_Info->u8RevBuf[12],2);
			}					
			break;
		case 0xB651:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0206FF00[2],&pstDlt645Frame_Info->u8RevBuf[12],2);
			}					
			break;
		case 0xB652:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0206FF00[4],&pstDlt645Frame_Info->u8RevBuf[12],2);
			}					
			break;
		case 0xB653:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0206FF00[6],&pstDlt645Frame_Info->u8RevBuf[12],2);
			}					
			break;
		case 0x0001FF00:
			MemSet(pstRam_Data->u8Data0001FF00,0xFF,sizeof(pstRam_Data->u8Data0001FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0001FF00))
				{
					MemCopy(pstRam_Data->u8Data0001FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}		
			break;
		case 0x0002FF00:
			MemSet(pstRam_Data->u8Data0002FF00,0xFF,sizeof(pstRam_Data->u8Data0002FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0002FF00))
				{
					MemCopy(pstRam_Data->u8Data0002FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}	
			break;
		case 0x0003FF00:
			MemSet(pstRam_Data->u8Data0003FF00,0xFF,sizeof(pstRam_Data->u8Data0003FF00));		
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0003FF00))
				{
					MemCopy(pstRam_Data->u8Data0003FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}				
			break;
		case 0x0004FF00:
			MemSet(pstRam_Data->u8Data0004FF00,0xFF,sizeof(pstRam_Data->u8Data0004FF00));		
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0004FF00))
				{
					MemCopy(pstRam_Data->u8Data0004FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}			
			break;	
		case 0x0201FF00:
			MemSet(pstRam_Data->u8Data0201FF00,0xFF,sizeof(pstRam_Data->u8Data0201FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0201FF00))
				{
					MemCopy(pstRam_Data->u8Data0201FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}				
			break;
		case 0x0202FF00:
			MemSet(pstRam_Data->u8Data0202FF00,0xFF,sizeof(pstRam_Data->u8Data0202FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0202FF00))
				{
					MemCopy(pstRam_Data->u8Data0202FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}					
			break;	
		case 0x0203FF00:
			MemSet(pstRam_Data->u8Data0203FF00,0xFF,sizeof(pstRam_Data->u8Data0203FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0203FF00))
				{
					MemCopy(pstRam_Data->u8Data0203FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}							
			break;	
		case 0x0204FF00:
			MemSet(pstRam_Data->u8Data0204FF00,0xFF,sizeof(pstRam_Data->u8Data0204FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0204FF00))
				{
					MemCopy(pstRam_Data->u8Data0204FF00,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}							
			break;	
		case 0x0206FF00:
			MemSet(pstRam_Data->u8Data0206FF00,0xFF,sizeof(pstRam_Data->u8Data0206FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0206FF00))
				{
					MemCopy(pstRam_Data->u8Data0206FF00,&pstDlt645Frame_Info->u8RevBuf[14],8);
				}
			}
			break;		
		case 0x0207FF00:
			MemSet(pstRam_Data->u8Data0207FF00,0xFF,sizeof(pstRam_Data->u8Data0207FF00));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data0207FF00))
				{
					MemCopy(&pstRam_Data->u8Data0207FF00[6],&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}//err20180921 不确定是否为笔误
			}				
			break;
		case 0x040005FF:
			MemSet(pstRam_Data->u8Data040005FF,0xFF,sizeof(pstRam_Data->u8Data040005FF));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data040005FF))
				{
					MemCopy(&pstRam_Data->u8Data040005FF,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}				
			break;
		case 0x02800002:
			MemSet(pstRam_Data->u8Data02800002,0xFF,sizeof(pstRam_Data->u8Data02800002));
			if(u8CtrlCode == 0x91)
			{
				if((u8DataLen - 4) <= sizeof(pstRam_Data->u8Data02800002))
				{
					MemCopy(&pstRam_Data->u8Data02800002,&pstDlt645Frame_Info->u8RevBuf[14],u8DataLen - 4);
				}
			}	
			break;
	}
}


/**--------------------------------------------------------------------
*功    能:LCD显示用数据写入内存
*输入参数:u16Pn，u32Ident，InBuf
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_WriteLcdData_TO_Ram_EDMI(u16 u16Pn,u32 u32Ident,u8* InBuf)
{
	QCSG_LCD_RAMDATA_LIST_S* pstPn_Ram_Data = (QCSG_LCD_RAMDATA_LIST_S*)QCSG_LCD_RAM_LIST;
	QCSG_LCD_RAMDATA_S* pstRam_Data = NULL;	
	u8 u8PnNum = 0,i = 0;
	
	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_LCD_RAMDATA_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPnLcdRamData[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPnLcdRamData[i];
			break;
		}
	}	
	if(i >= u8PnNum)		//第一次保存
	{
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstRam_Data = &pstPn_Ram_Data->stPnLcdRamData[u8PnNum];
			pstRam_Data->u16Pn = u16Pn;
			pstPn_Ram_Data->u8PnNum++;
		}
		else
		{
			return;
		}
	}
	switch(u32Ident)
	{
		case 0x0001FF00:
			MemCopy(pstRam_Data->u8Data0001FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0001FF00));				
			break;
		case 0x0002FF00:
			MemCopy(pstRam_Data->u8Data0002FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0002FF00));
			break;
		case 0x0003FF00:
			MemCopy(pstRam_Data->u8Data0003FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0003FF00));	
			break;
		case 0x0004FF00:
			MemCopy(pstRam_Data->u8Data0004FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0004FF00));
			break;	
		case 0x0201FF00:
			MemCopy(pstRam_Data->u8Data0201FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0201FF00));	
			break;
		case 0x0202FF00:
			MemCopy(pstRam_Data->u8Data0202FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0202FF00));			
			break;	
		case 0x0203FF00:
			MemCopy(pstRam_Data->u8Data0203FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0203FF00));				
			break;	
		case 0x0204FF00:
			MemCopy(pstRam_Data->u8Data0204FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0204FF00));				
			break;	
		case 0x0206FF00:
			MemCopy(pstRam_Data->u8Data0206FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0206FF00));
			break;		
		case 0x0207FF00:
			MemCopy(pstRam_Data->u8Data0207FF00,&InBuf[0],sizeof(pstRam_Data->u8Data0207FF00));		
			break;
		case 0x040005FF:
			MemCopy(pstRam_Data->u8Data040005FF,&InBuf[0],sizeof(pstRam_Data->u8Data040005FF));			
			break;
		case 0x02800002:
			MemCopy(pstRam_Data->u8Data02800002,&InBuf[0],sizeof(pstRam_Data->u8Data02800002));		
			break;
	}
}



/**--------------------------------------------------------------------
*功    能:抄表数据写入RAM暂存
*输入参数:u16Pn，u8ProtocolType，pstDlt645Frame_Info
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_WriteData_TO_Ram(u16 u16Pn,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	u8 u8PnNum,i = 0,u8CtrlCode = 0,u8DataLen = 0;
	u32 u32Ident = 0;
	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)		//第一次保存
	{
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[u8PnNum];
			pstRam_Data->u16Pn = u16Pn;
			pstPn_Ram_Data->u8PnNum++;
		}
		else
		{
			return;
		}		
	}
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
	u8CtrlCode &= 0xDF;
	u8DataLen = pstDlt645Frame_Info->u8RevBuf[9];

	//err20181031 控制码错误 则该帧不带数据标识
	if((u8CtrlCode & DLT_645_ERROR_BIT) == 0)//该帧为正确帧
	{
		if(u8ProtocolType == METER_DLT645_97)
		{
			MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],2);
		}
		else
		{
			MemCopy(&u32Ident,&pstDlt645Frame_Info->u8RevBuf[10],4);		
		}
	}
	else //err20181031 错误帧从发送帧中取数据标识
		MemCopy(&u32Ident,&pstDlt645Frame_Info->u8SendBuf[10],4);
	switch(u32Ident)
	{
		case 0x0000901F:
			if(u8CtrlCode == 0x81)
			{
				for(i = 0;i < (u8DataLen/4);i++)
				{
					switch(i)
					{
						case 0:
							MemCopy(pstRam_Data->u8Data00010000,&pstDlt645Frame_Info->u8RevBuf[12],4);
							break;
						case 1:
							MemCopy(pstRam_Data->u8Data00010100,&pstDlt645Frame_Info->u8RevBuf[12 + 4],4);
							break;
						case 2:
							MemCopy(pstRam_Data->u8Data00010200,&pstDlt645Frame_Info->u8RevBuf[12 + 8],4);
							break;
						case 3:
							MemCopy(pstRam_Data->u8Data00010300,&pstDlt645Frame_Info->u8RevBuf[12 + 12],4);
							break;
						case 4:
							MemCopy(pstRam_Data->u8Data00010400,&pstDlt645Frame_Info->u8RevBuf[12 + 16],4);
							break;
					}
				}
			}
			else
			{
				MemSet(pstRam_Data->u8Data00010000,0xFF,4);
				MemSet(pstRam_Data->u8Data00010100,0xFF,4);
				MemSet(pstRam_Data->u8Data00010200,0xFF,4);
				MemSet(pstRam_Data->u8Data00010300,0xFF,4);
				MemSet(pstRam_Data->u8Data00010400,0xFF,4);
			}			
			break;
		case 0x0000902F:
			if(u8CtrlCode == 0x81)
			{
				for(i = 0;i < (u8DataLen/4);i++)
				{
					switch(i)
					{
						case 0:
							MemCopy(pstRam_Data->u8Data00020000,&pstDlt645Frame_Info->u8RevBuf[12],4);
							break;
						case 1:
							MemCopy(pstRam_Data->u8Data00020100,&pstDlt645Frame_Info->u8RevBuf[12 + 4],4);
							break;
						case 2:
							MemCopy(pstRam_Data->u8Data00020200,&pstDlt645Frame_Info->u8RevBuf[12 + 8],4);
							break;
						case 3:
							MemCopy(pstRam_Data->u8Data00020300,&pstDlt645Frame_Info->u8RevBuf[12 + 12],4);
							break;
						case 4:
							MemCopy(pstRam_Data->u8Data00020400,&pstDlt645Frame_Info->u8RevBuf[12 + 16],4);
							break;
					}
				}
				pstRam_Data->u8RdDoneFlag = TRUE;
			}
			else
			{
				MemSet(pstRam_Data->u8Data00020000,0xFF,4);
				MemSet(pstRam_Data->u8Data00020100,0xFF,4);
				MemSet(pstRam_Data->u8Data00020200,0xFF,4);
				MemSet(pstRam_Data->u8Data00020300,0xFF,4);
				MemSet(pstRam_Data->u8Data00020400,0xFF,4);
			}			
			break;
			//有功功率
		case 0xB630:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(pstRam_Data->u8Data0203FF00,&pstDlt645Frame_Info->u8RevBuf[12],3);
			}				
			break;
		case 0xB631:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0203FF00[3],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}						
			break;
		case 0xB632:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0203FF00[6],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}				
			break;
		case 0xB633:
			if(u8CtrlCode == 0x81)
			{
				MemCopy(&pstRam_Data->u8Data0203FF00[9],&pstDlt645Frame_Info->u8RevBuf[12],3);
			}							
			break;			
		case 0x0001FF00:
			if(u8CtrlCode == 0x91)
			{
				for(i = 0;i < (u8DataLen/4);i++)
				{
					switch(i)
					{
						case 0:
							MemCopy(pstRam_Data->u8Data00010000,&pstDlt645Frame_Info->u8RevBuf[14],4);
							break;
						case 1:
							MemCopy(pstRam_Data->u8Data00010100,&pstDlt645Frame_Info->u8RevBuf[14 + 4],4);
							break;
						case 2:
							MemCopy(pstRam_Data->u8Data00010200,&pstDlt645Frame_Info->u8RevBuf[14 + 8],4);
							break;
						case 3:
							MemCopy(pstRam_Data->u8Data00010300,&pstDlt645Frame_Info->u8RevBuf[14 + 12],4);
							break;
						case 4:
							MemCopy(pstRam_Data->u8Data00010400,&pstDlt645Frame_Info->u8RevBuf[14 + 16],4);
							break;
					}
				}
			}
			else
			{
				MemSet(pstRam_Data->u8Data00010000,0xFF,4);
				MemSet(pstRam_Data->u8Data00010100,0xFF,4);
				MemSet(pstRam_Data->u8Data00010200,0xFF,4);
				MemSet(pstRam_Data->u8Data00010300,0xFF,4);
				MemSet(pstRam_Data->u8Data00010400,0xFF,4);
			}
			break;
		case 0x0002FF00:
			if(u8CtrlCode == 0x91)
			{
				for(i = 0;i < (u8DataLen/4);i++)
				{
					switch(i)
					{
						case 0:
							MemCopy(pstRam_Data->u8Data00020000,&pstDlt645Frame_Info->u8RevBuf[14],4);
							break;
						case 1:
							MemCopy(pstRam_Data->u8Data00020100,&pstDlt645Frame_Info->u8RevBuf[14 + 4],4);
							break;
						case 2:
							MemCopy(pstRam_Data->u8Data00020200,&pstDlt645Frame_Info->u8RevBuf[14 + 8],4);
							break;
						case 3:
							MemCopy(pstRam_Data->u8Data00020300,&pstDlt645Frame_Info->u8RevBuf[14 + 12],4);
							break;
						case 4:
							MemCopy(pstRam_Data->u8Data00020400,&pstDlt645Frame_Info->u8RevBuf[14 + 16],4);
							break;
					}
				}				
				pstRam_Data->u8RdDoneFlag = TRUE;
			}
			else
			{
				MemSet(pstRam_Data->u8Data00020000,0xFF,4);
				MemSet(pstRam_Data->u8Data00020100,0xFF,4);
				MemSet(pstRam_Data->u8Data00020200,0xFF,4);
				MemSet(pstRam_Data->u8Data00020300,0xFF,4);
				MemSet(pstRam_Data->u8Data00020400,0xFF,4);
			}
			break;		
		case 0x0003FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data00030000,&pstDlt645Frame_Info->u8RevBuf[14],4);
			}
			else
			{
				MemSet(pstRam_Data->u8Data00030000,0xFF,4);
			}
			break;	
		case 0x0004FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data00040000,&pstDlt645Frame_Info->u8RevBuf[14],4);
			}
			else
			{
				MemSet(pstRam_Data->u8Data00040000,0xFF,4);
			}
			break;	
		case 0x0005FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data00050000,&pstDlt645Frame_Info->u8RevBuf[14],4);
			}
			else
			{
				MemSet(pstRam_Data->u8Data00050000,0xFF,4);
			}
			break;
		case 0x0006FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data00060000,&pstDlt645Frame_Info->u8RevBuf[14],4);
			}
			else
			{
				MemSet(pstRam_Data->u8Data00060000,0xFF,4);
			}
			break;		
		case 0x0007FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data00070000,&pstDlt645Frame_Info->u8RevBuf[14],4);
			}
			else
			{
				MemSet(pstRam_Data->u8Data00070000,0xFF,4);
			}
			break;
		case 0x0008FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data00080000,&pstDlt645Frame_Info->u8RevBuf[14],4);
			}
			else
			{
				MemSet(pstRam_Data->u8Data00080000,0xFF,4);
			}
			break;	
		case 0x0201FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data0201FF00,&pstDlt645Frame_Info->u8RevBuf[14],6);
			}
			else
			{
				MemSet(pstRam_Data->u8Data0201FF00,0xFF,6);
			}
			break;
		case 0x0202FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data0202FF00,&pstDlt645Frame_Info->u8RevBuf[14],9);
			}
			else
			{
				MemSet(pstRam_Data->u8Data0202FF00,0xFF,9);
			}
			break;
		case 0x0203FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data0203FF00,&pstDlt645Frame_Info->u8RevBuf[14],12);
			}
			else
			{
				MemSet(pstRam_Data->u8Data0203FF00,0xFF,12);
			}
			break;
		case 0x0204FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data0204FF00,&pstDlt645Frame_Info->u8RevBuf[14],12);
			}
			else
			{
				MemSet(pstRam_Data->u8Data0204FF00,0xFF,12);
			}
			break;
		case 0x0206FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data0206FF00,&pstDlt645Frame_Info->u8RevBuf[14],8);
			}
			else
			{
				MemSet(pstRam_Data->u8Data0206FF00,0xFF,8);
			}
			break;
		case 0x0207FF00:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data0207FF00,&pstDlt645Frame_Info->u8RevBuf[14],6);//err20180921 修改笔误
			}
			else
			{
				MemSet(pstRam_Data->u8Data0207FF00,0xFF,6);
			}
			break;			
		case 0x01010000:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data01010000,&pstDlt645Frame_Info->u8RevBuf[14],8);
			}
			else
			{
				MemSet(pstRam_Data->u8Data01010000,0xFF,8);
			}
			break;
		case 0x01020000:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data01020000,&pstDlt645Frame_Info->u8RevBuf[14],8);
			}
			else
			{
				MemSet(pstRam_Data->u8Data01020000,0xFF,8);
			}
			break;
		case 0x01030000:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data01030000,&pstDlt645Frame_Info->u8RevBuf[14],8);
			}
			else
			{
				MemSet(pstRam_Data->u8Data01030000,0xFF,8);
			}
			break;
		case 0x01040000:
			if(u8CtrlCode == 0x91)
			{
				MemCopy(pstRam_Data->u8Data01040000,&pstDlt645Frame_Info->u8RevBuf[14],8);
			}
			else
			{
				MemSet(pstRam_Data->u8Data01040000,0xFF,8);
			}
			break;
	}
	return;
}


/**--------------------------------------------------------------------
*功    能:抄表数据写入RAM暂存
*输入参数:u16Pn，u32Ident，InBuf
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_WriteData_TO_Ram_EDMI(u16 u16Pn,u32 u32Ident,u8* InBuf)
{
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	u8 u8PnNum,i = 0;
	//u32 u32Ident = 0;
	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPn_Ram_Data,0,sizeof(QCSG_PN_RAM_DATA_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)		//第一次保存
	{
		if(u8PnNum < MAX_PN_NUM2)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[u8PnNum];
			pstRam_Data->u16Pn = u16Pn;
			pstPn_Ram_Data->u8PnNum++;
		}
		else
		{
			return;
		}		
	}

	switch(u32Ident)
	{	
		case 0x0001FF00:			
			MemCopy(pstRam_Data->u8Data00010000,&InBuf[0],4);
			MemCopy(pstRam_Data->u8Data00010100,&InBuf[4],4);			
			MemCopy(pstRam_Data->u8Data00010200,&InBuf[8],4);			
			MemCopy(pstRam_Data->u8Data00010300,&InBuf[12],4);			
			MemCopy(pstRam_Data->u8Data00010400,&InBuf[16],4);											
			break;
		case 0x0002FF00:			
			MemCopy(pstRam_Data->u8Data00020000,&InBuf[0],4);							
			MemCopy(pstRam_Data->u8Data00020100,&InBuf[4],4);							
			MemCopy(pstRam_Data->u8Data00020200,&InBuf[8],4);							
			MemCopy(pstRam_Data->u8Data00020300,&InBuf[12],4);							
			MemCopy(pstRam_Data->u8Data00020400,&InBuf[16],4);						
			break;		
		case 0x0003FF00:			
			MemCopy(pstRam_Data->u8Data00030000,&InBuf[0],4);			
			break;	
		case 0x0004FF00:			
			MemCopy(pstRam_Data->u8Data00040000,&InBuf[0],4);			
			break;	
		case 0x0005FF00:			
			MemCopy(pstRam_Data->u8Data00050000,&InBuf[0],4);
			break;
		case 0x0006FF00:			
			MemCopy(pstRam_Data->u8Data00060000,&InBuf[0],4);			
			break;		
		case 0x0007FF00:			
			MemCopy(pstRam_Data->u8Data00070000,&InBuf[0],4);			
			break;
		case 0x0008FF00:			
			MemCopy(pstRam_Data->u8Data00080000,&InBuf[0],4);			
			break;	
		case 0x0201FF00:			
			MemCopy(pstRam_Data->u8Data0201FF00,&InBuf[0],6);
			break;
		case 0x0202FF00:
			MemCopy(pstRam_Data->u8Data0202FF00,&InBuf[0],9);			
			break;
		case 0x0203FF00:			
			MemCopy(pstRam_Data->u8Data0203FF00,&InBuf[0],12);			
			break;
		case 0x0204FF00:			
			MemCopy(pstRam_Data->u8Data0204FF00,&InBuf[0],12);			
			break;
		case 0x0206FF00:
			MemCopy(pstRam_Data->u8Data0206FF00,&InBuf[0],8);		
			break;
		case 0x0207FF00:	
			MemCopy(pstRam_Data->u8Data0207FF00,&InBuf[0],6);//err20180921 修改笔误			
			break;			
		case 0x01010000:			
			MemCopy(pstRam_Data->u8Data01010000,&InBuf[0],8);			
			break;
		case 0x01020000:
			MemCopy(pstRam_Data->u8Data01020000,&InBuf[0],8);			
			break;
		case 0x01030000:		
			MemCopy(pstRam_Data->u8Data01030000,&InBuf[0],8);			
			break;
		case 0x01040000:			
			MemCopy(pstRam_Data->u8Data01040000,&InBuf[0],8);			
			break;
	}
	return;
}

