gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
/**--------------------------------------------------------------------
*功    能:97645数据转换为南网曲线数据存储
*输入参数:u32Dlt97Ident:64597数据标识，pu8InData：输入数据，u8InLen：输入数据长度
*输出参数:pstFrozenData:冻结数据
*返    回:无
--------------------------------------------------------------------**/
u8 DLT645DataToNW_CurveData(u32 u32Dlt97Ident,u8* pu8InData,u8 u8InLen,QCSG_FROZEN_RAM_DATA_S* pstFrozenData)
{
	u8 u8Res = TRUE;
	u32 u32Ident = 0,u32TempData = 0;
	switch(u32Dlt97Ident)
	{
		case 0xB611:
			u32Ident = 0x0201FF00;
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 18;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&u32TempData,2);
				pstFrozenData->u32DataLen += (6 + 2);			
			}
			else
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 18;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,2);
				pstFrozenData->u32DataLen += (6 + 2);							
			}
			break;
		case 0xB612:
			if(u8InLen != 0)
			{
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TempData,2);
				pstFrozenData->u32DataLen += 2;			
			}
			else
			{
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,2);
				pstFrozenData->u32DataLen += 2;							
			}
			break;			
		case 0xB613:
			if(u8InLen != 0)
			{
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TempData,2);
				pstFrozenData->u32DataLen += 2;			
			}
			else
			{
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,2);
				pstFrozenData->u32DataLen += 2;							
			}
			MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,12);
			pstFrozenData->u32DataLen += 12;
			break;
		case 0xB621:
			u32Ident = 0x0202FF00;
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 18;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&u32TempData,3);
				pstFrozenData->u32DataLen += (6 + 3);			
			}
			else
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 18;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,3);
				pstFrozenData->u32DataLen += (6 + 3);							
			}
			break;
		case 0xB622:
			if(u8InLen != 0)
			{
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TempData,3);
				pstFrozenData->u32DataLen += 3;			
			}
			else
			{
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,3);
				pstFrozenData->u32DataLen += 3;							
			}
			break;			
		case 0xB623:
			if(u8InLen != 0)
			{
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TempData,3);
				pstFrozenData->u32DataLen += 3;			
			}
			else
			{
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,3);
				pstFrozenData->u32DataLen += 3;							
			}
			MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,9);
			pstFrozenData->u32DataLen += 9;	
			break;
		case 0xB630:
			u32Ident = 0x0203FF00;
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 12;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],pu8InData,3);
				pstFrozenData->u32DataLen += (6 + 3);			
			}
			else
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 12;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,3);
				pstFrozenData->u32DataLen += (6 + 3);							
			}
			break;
		case 0xB631:
		case 0xB632:
		case 0xB633:
			if(u8InLen != 0)
			{
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],pu8InData,3);
				pstFrozenData->u32DataLen += 3;			
			}
			else
			{
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,3);
				pstFrozenData->u32DataLen += 3;							
			}			
			break;
		case 0xB640:
			u32Ident = 0x0204FF00;
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 12;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&u32TempData,3);
				pstFrozenData->u32DataLen += (6 + 3);	
			}
			else
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 12;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,3);
				pstFrozenData->u32DataLen += (6 + 3);							
			}
			break;
		case 0xB641:
		case 0xB642:
		case 0xB643:
			if(u8InLen != 0)
			{
				MemCopy(&u32TempData,pu8InData,2);
				u32TempData = (u32TempData << 4)& 0xFFFFFFF0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TempData,3);
				pstFrozenData->u32DataLen += 3;	
			}
			else
			{
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,3);
				pstFrozenData->u32DataLen += 3;							
			}			
			break;
		case 0xB650:
			u32Ident = 0x0206FF00;
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 8;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],pu8InData,2);
				pstFrozenData->u32DataLen += (6 + 2);			
			}
			else
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 8;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,2);
				pstFrozenData->u32DataLen += (6 + 2);							
			}			
			break;
		case 0xB651:
		case 0xB652:
		case 0xB653:
			if(u8InLen != 0)
			{
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],pu8InData,2);
				pstFrozenData->u32DataLen += 2;			
			}
			else
			{
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],0xFF,2);
				pstFrozenData->u32DataLen += 2;							
			}				
			break;
		case 0x0201FF00:
			u32Ident = 0x0201FF00;
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 18;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,18);
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],pu8InData,6);
			}
			pstFrozenData->u32DataLen += (6 + 18);	
			break;
		case 0x0202FF00:
			u32Ident = 0x0202FF00;
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 18;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,18);
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],pu8InData,9);
			}
			pstFrozenData->u32DataLen += (6 + 18);	
			break;
		case 0x0207FF00:
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
			if(u8InLen != 0)
			{
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = 12;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,12);
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6 + 6],pu8InData,6);
			}
			pstFrozenData->u32DataLen += 12;	
			break;
		default:
			u8Res = FALSE;
	}
	return u8Res;
}
/**--------------------------------------------------------------------
*功    能:抄表冻结数据存储
*输入参数:pstFrozenTime:冻结时间，u8FrozenFlag：数据存储标志，,u32 u32Ident:数据标识，pu8MeterId：表号，pstDlt645Frame_Info：645数据
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_METER_FrozenData_Save(u8 u8ChNo,TIME_PARAM_S* pstFrozenTime,u8 u8FrozenFlag,u32 u32Ident,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	//冻结数据测量点记录结构体
	QCSG_RECORD_FROZEN_PN_LIST_S* pstRD_Meter_TD_Pn_List = (QCSG_RECORD_FROZEN_PN_LIST_S*)QCSG_RECORD_FROZEN_PN_LIST;
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = NULL;
	RealTimeYYStruct stFrozenYYTime;
    u8 u8CtrlCode = 0,u8Dlt645DataLen = 0,u8Dlt645DataPos = 0,i = 0;
	
    if(u8FrozenFlag == 0)
    {
        return;
    }
	if((u8ChNo != RS485_1PORT)&&(u8ChNo != RS485_2PORT)&&(u8ChNo != RS485_3PORT)&&(u8ChNo != ACSAMPLEPORT))
	{
		return;
	}
	if(u8ChNo == RS485_1PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485I_RAM_FROZEN_DATA_S;
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485II_RAM_FROZEN_DATA_S;
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485III_RAM_FROZEN_DATA_S;
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;		
	}
    if(u8ProtocolType == METER_DLT645_97)
    {
        u8Dlt645DataLen = pstDlt645Frame_Info->u8RevBuf[9] - 2;
		u8Dlt645DataPos = 10 + 2;
    }
    else if(u8ProtocolType == METER_DLT645_07)
    {
        u8Dlt645DataLen = pstDlt645Frame_Info->u8RevBuf[9] - 4;	//减去数据标识长度=数据单元长度
		u8Dlt645DataPos = 10 + 4;		//跳过数据标识，从数据单元开始
    }
    else
    {
        return;
    }
	RealTimeToYYTime(pstFrozenTime,&stFrozenYYTime);
	if(pstDlt645Frame_Info->u8RevLen != 0)
	{
		u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
		if((u8CtrlCode == 0xC1)||(u8CtrlCode == 0xD1))	//异常帧
		{//u32Ident前面已经由645标识转成南网标识
			if(QCSG_GetDlt645DataLen_By_Ident(0x0D,u32Ident,&u8Dlt645DataLen)== TRUE)//07规约，返回TRUE，也就说明是07规约
			{
				//冻结数据直接写到RAM中
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = u8Dlt645DataLen;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,u8Dlt645DataLen);
				pstFrozenData->u32DataLen += (6 + u8Dlt645DataLen);			
			}
			else
			{
				if(u8ProtocolType == METER_DLT645_97)		//97规约
				{
					//如果是曲线数据标识转换，在此处理
					u8Dlt645DataLen = 0;		//长度为0时，下面这个函数会赋FF
					DLT645DataToNW_CurveData(u32Ident,&u8Dlt645DataLen,u8Dlt645DataLen,pstFrozenData);
				}
			}
		}
		else
		{
			//冻结数据直接写到RAM中
			if(DLT645DataToNW_CurveData(u32Ident,&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],u8Dlt645DataLen,pstFrozenData) != TRUE)
			{
				//如果没经过转换，则直接写入RAM
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32Ident,4);
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = u8Dlt645DataLen;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&pstDlt645Frame_Info->u8RevBuf[u8Dlt645DataPos],u8Dlt645DataLen);
				pstFrozenData->u32DataLen += (6 + u8Dlt645DataLen);		
			}
		}
	}
	else
	{
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));		
		return;
	}
	if(pstFrozenData->u32SaveFlag == 0x01)//某个表所有需抄数据项都抄完才保存到flash或文件，之前只是保存在内存
	{
		if(pstFrozenData->u32DataLen != 0)
		{
			if((u8FrozenFlag & TD_D_TYPE) != 0)	//保存日冻结
			{
				NAND_WriteMeterAMRData(AMR_DailyFreeze,pu8MeterId,0,u32Ident,&stFrozenYYTime,
				pstFrozenData->u8Data,&pstFrozenData->u32DataLen);
				for(i = 0;i < MAX_PN_NUM2;i++)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u16PnList[i] == u16Pn)
					{
						break;
					}
				}
				if(i >= MAX_PN_NUM2)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum < MAX_PN_NUM2)
					{
						pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u16PnList[pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum] = u16Pn;
						pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum++;
					}
				}
			}
			if((u8FrozenFlag & TD_M_TYPE) != 0)//保存月冻结
			{
				NAND_WriteMeterAMRData(AMR_MonthFreeze,pu8MeterId,0,u32Ident,&stFrozenYYTime,
				pstFrozenData->u8Data,&pstFrozenData->u32DataLen);
				for(i = 0;i < MAX_PN_NUM2;i++)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u16PnList[i] == u16Pn)
					{
						break;
					}
				}
				if(i >= MAX_PN_NUM2)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum < MAX_PN_NUM2)
					{
						pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u16PnList[pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum] = u16Pn;
						pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum++;
					}
				}
			}
			if((u8FrozenFlag & TD_C_TYPE) != 0)	//保存曲线
			{//pu8MeterId:表地址 u32Ident:南网数据标识 stFrozenYYTime:当前时间保存为冻结时间 
			// u8Data:N*(Fn(4)+L(2)(Data的长度)+Data(n)) u32DataLen:整个u8Data的长度
				NAND_WriteMeterCurveData(AMR_CurveFreeze,pu8MeterId,0,u32Ident,&stFrozenYYTime,
				pstFrozenData->u8Data,&pstFrozenData->u32DataLen);
			}
		}
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));
	}
}

/**--------------------------------------------------------------------
*功    能:抄表冻结数据存储 红相表专用
*输入参数:pstFrozenTime:冻结时间，u8FrozenFlag：数据存储标志，,u32 u32Ident:数据标识，
pu8MeterId：表号，
NWDataLen：输入南网数据(pu8InBuff)的长度  			(原来是u8ProtocolType)
pu8InBuf：南网数据内容 (原来pstDlt645Frame_Info：645数据)

*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_METER_FrozenData_Save_EDMI(u8 u8ChNo,TIME_PARAM_S* pstFrozenTime,u8 u8FrozenFlag,u32 u32NWIdent,u16 u16Pn,u8* pu8MeterId,u8 u8NWDataLen,u8* pu8InBuf)
{
	//冻结数据测量点记录结构体
	QCSG_RECORD_FROZEN_PN_LIST_S* pstRD_Meter_TD_Pn_List = (QCSG_RECORD_FROZEN_PN_LIST_S*)QCSG_RECORD_FROZEN_PN_LIST;
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = NULL;
	RealTimeYYStruct stFrozenYYTime;
   //u8 u8CtrlCode = 0,u8Dlt645DataLen = 0,u8Dlt645DataPos = 0
	u8 i = 0;
	
    if(u8FrozenFlag == 0)
    {
        return;
    }
	if((u8ChNo != RS485_1PORT)&&(u8ChNo != RS485_2PORT)&&(u8ChNo != RS485_3PORT)&&(u8ChNo != ACSAMPLEPORT))
	{
		return;
	}
	if(u8ChNo == RS485_1PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485I_RAM_FROZEN_DATA_S;
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485II_RAM_FROZEN_DATA_S;
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485III_RAM_FROZEN_DATA_S;
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;		
	}

