gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	RealTimeToYYTime(pstFrozenTime,&stFrozenYYTime);
	if(u8NWDataLen != 0)
	{
		//如果没经过转换，则直接写入RAM
		//直接是南网标识 不需要转换
		MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32NWIdent,4);
		pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = u8NWDataLen;
		pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
		MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],pu8InBuf,u8NWDataLen);
		pstFrozenData->u32DataLen += (6 + u8NWDataLen);		
	}
	else
	{
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));		
		return;
	}
	if(pstFrozenData->u32SaveFlag == 0x01)//某个表所有需抄数据项都抄完才保存到flash或文件，之前只是保存在内存
	{
		if(pstFrozenData->u32DataLen != 0)
		{
			if((u8FrozenFlag & TD_D_TYPE) != 0)	//保存日冻结
			{
				NAND_WriteMeterAMRData(AMR_DailyFreeze,pu8MeterId,0,u32NWIdent,&stFrozenYYTime,
				pstFrozenData->u8Data,&pstFrozenData->u32DataLen);
				for(i = 0;i < MAX_PN_NUM2;i++)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u16PnList[i] == u16Pn)
					{
						break;
					}
				}
				if(i >= MAX_PN_NUM2)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum < MAX_PN_NUM2)
					{
						pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u16PnList[pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum] = u16Pn;
						pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum++;
					}
				}
			}
			if((u8FrozenFlag & TD_M_TYPE) != 0)//保存月冻结
			{
				NAND_WriteMeterAMRData(AMR_MonthFreeze,pu8MeterId,0,u32NWIdent,&stFrozenYYTime,
				pstFrozenData->u8Data,&pstFrozenData->u32DataLen);
				for(i = 0;i < MAX_PN_NUM2;i++)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u16PnList[i] == u16Pn)
					{
						break;
					}
				}
				if(i >= MAX_PN_NUM2)
				{
					if(pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum < MAX_PN_NUM2)
					{
						pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u16PnList[pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum] = u16Pn;
						pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum++;
					}
				}
			}
			if((u8FrozenFlag & TD_C_TYPE) != 0)	//保存曲线
			{//pu8MeterId:表地址 u32Ident:南网数据标识 stFrozenYYTime:当前时间保存为冻结时间 
			// u8Data:N*(Fn(4)+L(2)(Data的长度)+Data(n)) u32DataLen:整个u8Data的长度
				NAND_WriteMeterCurveData(AMR_CurveFreeze,pu8MeterId,0,u32NWIdent,&stFrozenYYTime,
				pstFrozenData->u8Data,&pstFrozenData->u32DataLen);
			}
		}
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));
	}
}

/**--------------------------------------------------------------------
*功    能:抄表返回的645帧处理
*输入参数:pstFrozenTime:冻结时间，u8FrozenFlag：数据存储标志，u16Pn：测量点号，pstDlt645Frame_Info：645数据
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_METER_Dlt645Data_Process(u8 u8Cycle,u8 u8ChNo,TIME_PARAM_S* pstFrozenTime,u8 u8FrozenFlag,u16 u16Pn,u8* pu8MeterId,u8 u8ProtocolType,DLT645_FRAME_S* pstDlt645Frame_Info)
{
	MeasurePointStruct stPnPara;
	PowerQualityParaStruct stPowerQualityPara;
    u8 u8CtrlCode = 0,u8DataLen = 0,i = 0;
	u16 u16UpLimit = 0,u16LowLimit = 0;
    u32 u32RequestIdent = 0;
    u32 u32ResponseIdent = 0,u32ReadLen = 0;
	
	TIME_PARAM_S stSysCurrTime;
	HAL_GetSystemTime(&stSysCurrTime);

	if(pstDlt645Frame_Info->u8RevLen == 0)
	{
	//该函数里判u8RevLen为0时，直接释放临时数据pstFrozenData，
	//然后return，相当于还是没有保存数据到flash或文件
	//为何多此一举?
       	RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
		return;
	}
    if(QCSG_Dlt645FrameJudge(pstDlt645Frame_Info->u8SendBuf,&pstDlt645Frame_Info->u8SendLen) != TRUE)
    {
        return;
    }
    if(QCSG_Dlt645FrameJudge(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen) != TRUE)
    {
        return;
    }
	u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];	//取控制码 91 D1
	u8DataLen = pstDlt645Frame_Info->u8RevBuf[9];	//取数据长度 
	for(i = 0;i < u8DataLen;i++)
	{
		pstDlt645Frame_Info->u8RevBuf[10 + i] -= 0x33;			
	}	
    if(u8ProtocolType == METER_DLT645_97)
    {
		for(i = 0;i < 2;i++)
		{
			pstDlt645Frame_Info->u8SendBuf[10 + i] -= 0x33;
		}
        MemCopy(&u32RequestIdent,&pstDlt645Frame_Info->u8SendBuf[10],2);
        MemCopy(&u32ResponseIdent,&pstDlt645Frame_Info->u8RevBuf[10],2);
    }
    if(u8ProtocolType == METER_DLT645_07)
    {
		for(i = 0;i < 4;i++)
		{
			pstDlt645Frame_Info->u8SendBuf[10 + i] -= 0x33;
		}
	    MemCopy(&u32RequestIdent,&pstDlt645Frame_Info->u8SendBuf[10],4);
	    MemCopy(&u32ResponseIdent,&pstDlt645Frame_Info->u8RevBuf[10],4);
	}
	
	//err20181031 控制码错误 则该帧不带数据标识
	if((u8CtrlCode & DLT_645_ERROR_BIT) == 0)//该帧为正确帧
	{
	    if(u32RequestIdent != u32ResponseIdent)
	    {
			if((u8CtrlCode != 0xC1)&&(u8CtrlCode != 0xD1))
			{
				return;
			}
	    }
	}
    switch(u32RequestIdent)
    {
		case 0x0000FF00:
			u32RequestIdent = 0x050600FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;		
		case 0x05060101:
			u32RequestIdent = 0x050601FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060201:
			u32RequestIdent = 0x050602FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060301:
			u32RequestIdent = 0x050603FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060401:
			u32RequestIdent = 0x050604FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060501:
			u32RequestIdent = 0x050605FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060601:
			u32RequestIdent = 0x050606FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060701:
			u32RequestIdent = 0x050607FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060801:
			u32RequestIdent = 0x050608FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060901:
			u32RequestIdent = 0x050609FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x05060A01:
			u32RequestIdent = 0x05060AFF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0001FF00:
			RD_Calc_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_Calc_Lcd_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			//E200002C 		示度下降  ARD3
			RD_Alarm_E200002C(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			
			//E2000030 		差动告警 ARD3
			RD_Alarm_E2000030(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0002FF00:
			RD_Calc_Lcd_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200002C(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0003FF00:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0004FF00:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;	
		case 0x0005FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0006FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0007FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0008FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x01010000:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x01020000:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x01030000:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x01040000:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0201FF00:

			
		
