gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			//E2000005		电压不平衡 ARD2
			RD_Alarm_E2000005(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			
			//E200001A 		A 相电压过压 ARD2
			RD_Alarm_E200001A(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);

			//E200001B 		B 相电压过压 ARD2
			RD_Alarm_E200001B(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);

			//E200001C 		C 相电压过压 ARD2
			RD_Alarm_E200001C(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);


			if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) == NO_ERROR)
			{
				if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
				{
					break;
				}
				stPnPara.RatedVoltage = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);

//电能质量监测参数	
				if(NAND_ReadMeasurePoint(u16Pn,0xE0800100,(u8*)&stPowerQualityPara,&u32ReadLen) == NO_ERROR)
				{
					if((QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800102,2) != TRUE) || (stPowerQualityPara.E0800102 == 0))
					{
						u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
					}
					else
					{
						stPowerQualityPara.E0800102 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800102>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800102);						
						u16UpLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800102 / 100;					
					}
					if((QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800103,2) != TRUE) || (stPowerQualityPara.E0800103 == 0))
					{
						u16LowLimit = stPnPara.RatedVoltage * 93 / 100;												
					}					
					else
					{
						stPowerQualityPara.E0800103 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800103>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800103);
						u16LowLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800103 / 100;						
					}
				}
				else
				{
					u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
					u16LowLimit = stPnPara.RatedVoltage * 93 / 100;
				}


				
#if(TEST_ON == 1) //err20180802 交采30S一次 只取0s的进行统计。
			if(((stSysCurrTime.u8Second >=0x30) && (stSysCurrTime.u8Second <=0x35)) && (u16Pn == 0)) return;
#endif
				//QCSG_LogToRS232Port((u32)u16Pn,(u32)&stSysCurrTime.u8Second,1);
				RD_StatisticsData_E1000010(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
				RD_StatisticsData_E1000011(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
				RD_StatisticsData_E1000012(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
				RD_StatisticsData_E1000013(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
				RD_StatisticsData_03100000(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
				RD_StatisticsData_03100100(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
				RD_StatisticsData_03100200(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
				RD_StatisticsData_03100300(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
			}

#if defined(FKGA43_CL3200_TEST)
			if(((stSysCurrTime.u8Second >=0x30) && (stSysCurrTime.u8Second <=0x35)) && (u16Pn == 0)) return;
			RD_StatisticsData_E1000020_21_CL3200(u8Cycle,u16Pn,pstDlt645Frame_Info);
#endif
			break;
		case 0x0202FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000004(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200000D(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000010(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000016(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200000E(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000011(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000017(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200000F(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000012(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000018(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200001D(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200001E(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200001F(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010004(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010005(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010006(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010007(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010008(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010009(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E201000B(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);//err20181105 增加断相事件A相
			RD_Event_E201000C(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);//err20181105 增加断相事件B相
			RD_Event_E201000D(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);//err20181105 增加断相事件C相
			RD_StatisticsData_E1000014_16(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004014_16(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);

		//ABC相失流告警
			RD_Alarm_E2000013(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000014(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000015(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);

			
#if !defined(FKGA43_CL3200_TEST)
			RD_StatisticsData_E1000020_21(u8Cycle,u16Pn,pstDlt645Frame_Info);
#endif			
			break;
		case 0x02800001:
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000006(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1000017(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004017(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02800002:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);			
			break;
		case 0x0203FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200002D(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200002E(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1000018(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004018(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0204FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1000019(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004019(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0206FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000026(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E2000027(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E100001A(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E100401A(u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			
