gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
#if(TEST_ON == 1) //err20180802 交采30S一次 只取0s的进行统计。			
			if(((stSysCurrTime.u8Second >=0x30) && (stSysCurrTime.u8Second <=0x35)) && (u16Pn == 0)) return;
#endif	
			RD_StatisticsData_E1000033(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1000034(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1000035(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1000036(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004033(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004034(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004035(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_E1004036(u8Cycle,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x0207FF00:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x03300200:
			RD_Alarm_E2000031(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x03300400://err20181107 增加事件 校时记录
			RD_Event_E2010010(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x04000501:
			RD_Alarm_E2000032(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x04000507:
			RD_Alarm_E2000003(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x040005FF:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x14000001:
			RD_Alarm_E2000003(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02080100://A相电压波形失真度
			RD_Alarm_E2000020(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02080200://B相电压波形失真度
			RD_Alarm_E2000021(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02080300://C相电压波形失真度
			RD_Alarm_E2000022(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02090100:
			RD_Alarm_E2000023(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02090200:
			RD_Alarm_E2000024(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02090300:
			RD_Alarm_E2000025(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x02050000:	//瞬时总视在功率
			RD_Alarm_E2000029(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Alarm_E200002A(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x03300000://编程总次数
			RD_Alarm_E2000035(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);//电能表编程时间更改 ARD2
			break;
		case 0x04010001:	//第一套第1日时段表数据
			RD_Alarm_E2000036(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x04020001://err20181101 增加第二套第一日时段表数据告警判断
			RD_Alarm_E2000036(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x04000409:
			RD_Alarm_E2000037(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);//电能表脉冲常数更改 ARD6
			break;
		case 0x0400040A:
			RD_Alarm_E2000037(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x04000101://:日期及星期
			RD_Alarm_E200003E(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x04000102://时间
			RD_Alarm_E200003E(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x03300E00:
			RD_Alarm_E200004D(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010011(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);//err20181106 增加事件 表端钮盒开启记录
			break;
		case 0x03300D00:
			RD_Alarm_E200004E(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_Event_E2010012(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);//err20181106 增加事件 表盖开启记录
			break;
		case 0x00900200:
			RD_Alarm_E200002B(pstFrozenTime,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);		
			break;
		case 0x901F:
			if((u8FrozenFlag & TD_D_TYPE) != 0)
			{
				u32RequestIdent = 0x050601FF;
			}
			else if((u8FrozenFlag & TD_C_TYPE) != 0)
			{
				u32RequestIdent = 0x0001FF00;
			}
			else
			{
				break;
			}
			RD_Calc_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_Calc_Lcd_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);	
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);			
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x902F:
			if((u8FrozenFlag & TD_D_TYPE) != 0)
			{
				u32RequestIdent = 0x050602FF;
			}
			else if((u8FrozenFlag & TD_C_TYPE) != 0)
			{
				u32RequestIdent = 0x0002FF00;
			}
			else
			{
				break;
			}
			RD_Calc_Lcd_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);	
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);			
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x911F:
			u32RequestIdent = 0x050603FF;
			RD_Calc_Lcd_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);			
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x912F:
			u32RequestIdent = 0x050604FF;
			RD_Calc_Lcd_Energy_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);			
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x913F:
			u32RequestIdent = 0x050605FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x914F:
			u32RequestIdent = 0x050608FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x915F:
			u32RequestIdent = 0x050606FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0x916F:
			u32RequestIdent = 0x050607FF;
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB611:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) == NO_ERROR)
			{
				if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
				{
					break;
				}
				stPnPara.RatedVoltage = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);
				if(NAND_ReadMeasurePoint(u16Pn,0xE0800100,(u8*)&stPowerQualityPara,&u32ReadLen) == NO_ERROR)
				{
					if((QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800102,2) != TRUE) || (QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800103,2) != TRUE))
					{
						u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
						u16LowLimit = stPnPara.RatedVoltage * 93 / 100;						
					}
					else
					{
						stPowerQualityPara.E0800102 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800102>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800102);
						stPowerQualityPara.E0800103 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800103>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800103);
						u16UpLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800102 / 100;
						u16LowLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800103 / 100;
					}
				}
				else
				{
					u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
					u16LowLimit = stPnPara.RatedVoltage * 93 / 100;
				}
			}				
			RD_StatisticsData_E1000011(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
			RD_StatisticsData_03100100(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);		
			break;
		case 0xB612:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) == NO_ERROR)
			{
				if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
				{
					break;
				}
				stPnPara.RatedVoltage = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);
				if(NAND_ReadMeasurePoint(u16Pn,0xE0800100,(u8*)&stPowerQualityPara,&u32ReadLen) == NO_ERROR)
				{
					if((QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800102,2) != TRUE) || (QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800103,2) != TRUE))
					{
						u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
						u16LowLimit = stPnPara.RatedVoltage * 93 / 100;						
					}
					else
					{
						stPowerQualityPara.E0800102 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800102>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800102);
						stPowerQualityPara.E0800103 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800103>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800103);
						u16UpLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800102 / 100;
						u16LowLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800103 / 100;
					}					
				}
				else
				{
					u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
					u16LowLimit = stPnPara.RatedVoltage * 93 / 100;
				}
			}			
			RD_StatisticsData_E1000012(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
			RD_StatisticsData_03100200(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
			break;
		case 0xB613:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
			if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) == NO_ERROR)
			{
				if(QCSG_BCDCheck((u8*)&stPnPara.RatedVoltage,2) != TRUE)
				{
					break;
				}
				stPnPara.RatedVoltage = QCSG_BCD2HEX((u8)(stPnPara.RatedVoltage>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.RatedVoltage);
				if(NAND_ReadMeasurePoint(u16Pn,0xE0800100,(u8*)&stPowerQualityPara,&u32ReadLen) == NO_ERROR)
				{
					if((QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800102,2) != TRUE) || (QCSG_BCDCheck((u8*)&stPowerQualityPara.E0800103,2) != TRUE))
					{
						u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
						u16LowLimit = stPnPara.RatedVoltage * 93 / 100;						
					}
					else
					{
						stPowerQualityPara.E0800102 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800102>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800102);
						stPowerQualityPara.E0800103 = QCSG_BCD2HEX((u8)(stPowerQualityPara.E0800103>>8)) * 100 + QCSG_BCD2HEX((u8)stPowerQualityPara.E0800103);
						u16UpLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800102 / 100;
						u16LowLimit = stPnPara.RatedVoltage * stPowerQualityPara.E0800103 / 100;
					}
				}
				else
				{
					u16UpLimit = stPnPara.RatedVoltage * 107 / 100;
					u16LowLimit = stPnPara.RatedVoltage * 93 / 100;
				}
			}	
			RD_StatisticsData_E1000013(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);	
			RD_StatisticsData_03100300(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);		
			RD_StatisticsData_E1000010_97(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			RD_StatisticsData_03100000_97(u8Cycle,u16UpLimit,u16LowLimit,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);			
			break;
		case 0xB621:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB622:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB623:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB630:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB631:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB632:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB633:
			RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;	
		case 0xB640:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB641:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB642:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB643:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB650:
			RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB651:
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB652:
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		case 0xB653:
			RD_METER_FrozenData_Save(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8ProtocolType,pstDlt645Frame_Info);
			break;
		default:
			break;
    }
}


/**--------------------------------------------------------------------
*功    能:抄表返回的帧处理 已经处理成南网数据标识和数据内容
*输入参数:pstFrozenTime:冻结时间，u8FrozenFlag：数据存储标志，u16Pn：测量点号，pstDlt645Frame_Info：645数据
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_METER_EDMIData_Process(u8 u8ChNo,TIME_PARAM_S* pstFrozenTime,u8 u8FrozenFlag,u16 u16Pn,u8* pu8MeterId,u8 u8NwDataLen,u8* pu8InBuf,u32 u32NWIdent)
{
	//MeasurePointStruct stPnPara;
	//PowerQualityParaStruct stPowerQualityPara;
   // u8 u8CtrlCode = 0,u8DataLen = 0,i = 0;
	//u16 u16UpLimit = 0,u16LowLimit = 0;
   // u32 u32RequestIdent = 0;
  //  u32 u32ResponseIdent = 0,u32ReadLen = 0;
	
	TIME_PARAM_S stSysCurrTime;
	HAL_GetSystemTime(&stSysCurrTime);

	//if(pstDlt645Frame_Info->u8RevLen == 0)
	//{
	//该函数里判u8RevLen为0时，直接释放临时数据pstFrozenData，
	//然后return，相当于还是没有保存数据到flash或文件
	//为何多此一举?
    //   	RD_METER_FrozenData_Save_EDMI(u8ChNo,pstFrozenTime,u8FrozenFlag,u32RequestIdent,u16Pn,pu8MeterId,u8NwDataLen,pu8InBuf);
	//	return;
	//}
    
    switch(u32NWIdent)
    {
    	case 0x050600FF:
		case 0x050601FF:
		case 0x050602FF:
		case 0x050603FF:
		case 0x050604FF:
		case 0x050605FF:
		case 0x050606FF:
		case 0x050607FF:
		case 0x050608FF:
		case 0x050609FF:
		case 0x05060AFF:
			RD_METER_FrozenData_Save_EDMI(u8ChNo,pstFrozenTime,u8FrozenFlag,u32NWIdent,u16Pn,pu8MeterId,u8NwDataLen,pu8InBuf);
			break;
		case 0x0001FF00:
		case 0x0002FF00:
		case 0x0003FF00:
		case 0x0004FF00:
			RD_WriteLcdData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			//RD_WriteLcdData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			//RD_WriteData_TO_Ram(u16Pn,u8ProtocolType,pstDlt645Frame_Info);
			RD_WriteData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			RD_METER_FrozenData_Save_EDMI(u8ChNo,pstFrozenTime,u8FrozenFlag,u32NWIdent,u16Pn,pu8MeterId,u8NwDataLen,pu8InBuf);
			break;	
		case 0x0005FF00:
		case 0x0006FF00:
		case 0x0007FF00:
		case 0x0008FF00:
		case 0x01010000:
		case 0x01020000:
		case 0x01030000:
		case 0x01040000:
			RD_WriteData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			break;
		case 0x0201FF00:
		case 0x0202FF00:
			RD_WriteData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			RD_WriteLcdData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			RD_METER_FrozenData_Save_EDMI(u8ChNo,pstFrozenTime,u8FrozenFlag,u32NWIdent,u16Pn,pu8MeterId,u8NwDataLen,pu8InBuf);
			break;
		case 0x02800001:
			RD_METER_FrozenData_Save_EDMI(u8ChNo,pstFrozenTime,u8FrozenFlag,u32NWIdent,u16Pn,pu8MeterId,u8NwDataLen,pu8InBuf);
			break;
		case 0x02800002:
			RD_WriteLcdData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);		
			break;
		case 0x0203FF00:
		case 0x0204FF00:
		case 0x0206FF00:
			RD_WriteData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			RD_WriteLcdData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			RD_METER_FrozenData_Save_EDMI(u8ChNo,pstFrozenTime,u8FrozenFlag,u32NWIdent,u16Pn,pu8MeterId,u8NwDataLen,pu8InBuf);
			break;
		case 0x0207FF00:
			RD_WriteData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			RD_WriteLcdData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			break;
		case 0x040005FF:
			RD_WriteLcdData_TO_Ram_EDMI(u16Pn,u32NWIdent,pu8InBuf);
			break;
		
		default:
			break;
    }
}





#if (DLT500_REPORT == 0)
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000010_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8Overrrun,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[17],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000011_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_A_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8Overrrun,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[17],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000012_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_B_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8Overrrun,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[17],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000013_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_C_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

