gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8Overrrun,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[17],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}
#else
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000010_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8UpLimintRate,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8LowLimintRate,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8PassRateTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[18],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[27],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[29],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000011_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_A_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8UpLimintRate,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8LowLimintRate,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8PassRateTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[18],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[27],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[29],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000012_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_B_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8UpLimintRate,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8LowLimintRate,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8PassRateTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[18],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[27],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[29],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000013_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VOLTAGE_PASSRATE_LIST_S* pstPassRate_List = (QCSG_VOLTAGE_PASSRATE_LIST_S*)QCSG_C_VOLTAGE_PASSRATE_DAY;
	QCSG_VOLTAGE_PASSRATE_S* pstPassRate_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstPassRate_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPassRate_List,0,sizeof(QCSG_VOLTAGE_PASSRATE_LIST_S));
	}		
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPassRate_List->stPassRate[i].u16Pn)
		{
			pstPassRate_info = &pstPassRate_List->stPassRate[i];
			MemCopy(&pu8OutBuf[0],pstPassRate_info->u8MonitorTime,3);
			MemCopy(&pu8OutBuf[3],pstPassRate_info->u8PassRate,3);
			MemCopy(&pu8OutBuf[6],pstPassRate_info->u8UpLimintRate,3);
			MemCopy(&pu8OutBuf[9],pstPassRate_info->u8LowLimintRate,3);
			MemCopy(&pu8OutBuf[12],pstPassRate_info->u8PassRateTime,3);
			MemCopy(&pu8OutBuf[15],pstPassRate_info->u8UpLimitTime,3);
			MemCopy(&pu8OutBuf[18],pstPassRate_info->u8LowLimitTime,3);
			MemCopy(&pu8OutBuf[21],pstPassRate_info->u8MaxVoltage,2);
			MemCopy(&pu8OutBuf[23],pstPassRate_info->u8MaxVoltageTime,4);
			MemCopy(&pu8OutBuf[27],pstPassRate_info->u8MinVoltage,2);
			MemCopy(&pu8OutBuf[29],pstPassRate_info->u8MinVoltageTime,4);
			break;
		}
	}
}

#endif
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000014_16_DataCopy(u16 u16Pn,u32 u32Ident,u8* pu8OutBuf)
{
	QCSG_CURRENT_EXTREME_PASSRATE_LIST_S* pstCurrentExtreme_List = (QCSG_CURRENT_EXTREME_PASSRATE_LIST_S*)QCSG_CURRENT_EXTREME_DAY;
	QCSG_CURRENT_EXTREME_PASSRATE_S* pstCurrentExtreme_info = NULL;	
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pstCurrentExtreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstCurrentExtreme_List,0,sizeof(QCSG_CURRENT_EXTREME_PASSRATE_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstCurrentExtreme_List->stCurrentExtreme[i].u16Pn)
		{
			pstCurrentExtreme_info = &pstCurrentExtreme_List->stCurrentExtreme[i];
			if(u32Ident == 0xE1000014)
			{
				MemCopy(&pu8OutBuf[0],pstCurrentExtreme_info->u8Max_A_Current,3);
				MemCopy(&pu8OutBuf[3],pstCurrentExtreme_info->u8Max_A_Current_Time,4);
				MemCopy(&pu8OutBuf[7],pstCurrentExtreme_info->u8Min_A_Current,3);
				MemCopy(&pu8OutBuf[10],pstCurrentExtreme_info->u8Min_A_Current_Time,4);
			}
			if(u32Ident == 0xE1000015)
			{
				MemCopy(&pu8OutBuf[0],pstCurrentExtreme_info->u8Max_B_Current,3);
				MemCopy(&pu8OutBuf[3],pstCurrentExtreme_info->u8Max_B_Current_Time,4);
				MemCopy(&pu8OutBuf[7],pstCurrentExtreme_info->u8Min_B_Current,3);
				MemCopy(&pu8OutBuf[10],pstCurrentExtreme_info->u8Min_B_Current_Time,4);
			}
			if(u32Ident == 0xE1000016)
			{
				MemCopy(&pu8OutBuf[0],pstCurrentExtreme_info->u8Max_C_Current,3);
				MemCopy(&pu8OutBuf[3],pstCurrentExtreme_info->u8Max_C_Current_Time,4);
				MemCopy(&pu8OutBuf[7],pstCurrentExtreme_info->u8Min_C_Current,3);
				MemCopy(&pu8OutBuf[10],pstCurrentExtreme_info->u8Min_C_Current_Time,4);
			}			
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000017_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_N_CurrentExtreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_N_CURRENT_EXTREME_DAY;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_N_CurrentExtreme_info = NULL;
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pst_N_CurrentExtreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_N_CurrentExtreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_N_CurrentExtreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_N_CurrentExtreme_info = &pst_N_CurrentExtreme_List->stCurrentExtreme[i];
			MemCopy(&pu8OutBuf[0],pst_N_CurrentExtreme_info->u8Max_Value,3);
			MemCopy(&pu8OutBuf[3],pst_N_CurrentExtreme_info->u8Max_Value_Time,4);
			MemCopy(&pu8OutBuf[7],pst_N_CurrentExtreme_info->u8Min_Value,3);
			MemCopy(&pu8OutBuf[10],pst_N_CurrentExtreme_info->u8Min_Value_Time,4);
			break;
		}
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000018_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Active_Power_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_ACTIVE_POWER_DAY;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Active_Power_Extreme_info = NULL;	
	u8 u8PnNum = 0,i = 0;	

	u8PnNum = pst_Active_Power_Extreme_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pst_Active_Power_Extreme_List,0,sizeof(QCSG_VALUE_EXTREME_PASSRATE_LIST_S));
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pst_Active_Power_Extreme_List->stCurrentExtreme[i].u16Pn)
		{
			pst_Active_Power_Extreme_info = &pst_Active_Power_Extreme_List->stCurrentExtreme[i];
			MemCopy(&pu8OutBuf[0],pst_Active_Power_Extreme_info->u8Max_Value,3);
			MemCopy(&pu8OutBuf[3],pst_Active_Power_Extreme_info->u8Max_Value_Time,4);
			MemCopy(&pu8OutBuf[7],pst_Active_Power_Extreme_info->u8Min_Value,3);
			MemCopy(&pu8OutBuf[10],pst_Active_Power_Extreme_info->u8Min_Value_Time,4);			
			break;
		}		
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据拷贝
*输入参数:u16Pn：测量点号，
*输出参数:pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_0xE1000019_DataCopy(u16 u16Pn,u8* pu8OutBuf)
{
	QCSG_VALUE_EXTREME_PASSRATE_LIST_S* pst_Reactive_Power_Extreme_List = (QCSG_VALUE_EXTREME_PASSRATE_LIST_S*)QCSG_REACTIVE_POWER_DAY;
	QCSG_VALUE_EXTREME_PASSRATE_S* pst_Reactive_Power_Extreme_info = NULL;		
	u8 u8PnNum = 0,i = 0;	

