gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	u8PnNum = pstPowerFactor_Zone_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM2)
	{
		MemSet(pstPowerFactor_Zone_List,0,sizeof(QCSG_POWER_FACTOR_ZONE_LIST_S));
	}
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录
		if(u16Pn == pstPowerFactor_Zone_List->stPowerFactorZone[i].u16Pn)
		{
			pstPowerFactor_Zone_info = &pstPowerFactor_Zone_List->stPowerFactorZone[i];
			MemCopy(&pu8OutBuf[0],pstPowerFactor_Zone_info->u8MonitorTime,33);
			break;
		}		
	}
}
/**--------------------------------------------------------------------
*功    能:统计数据赋值
*输入参数:u32Ident：数据标识，u16MaxOutSize：缓冲大小
*输出参数:pu16OutLen:输出长度，pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_RtStatisticsData(u16 u16Pn,u32 u32Ident,u8* pu8OutBuf,u16* pu16OutLen)
{
	(*pu16OutLen) = 0;
	MemCopy(pu8OutBuf,&u16Pn,2);
	MemCopy(&pu8OutBuf[4],&u32Ident,4);
	switch(u32Ident)
	{
		case 0xE1000001:
		case 0xE1000002:
			(*pu16OutLen) = 4;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;
		case 0xE1000003:
		case 0xE1000004:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;		
		case 0xE1000008:	//剩余金额
			(*pu16OutLen) = 4;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;
		case 0xE1000010:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000010_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;
		case 0xE1000011:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000011_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1000012:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000012_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1000013:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000013_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;
		case 0xE1000014:
		case 0xE1000015:
		case 0xE1000016:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000014_16_DataCopy(u16Pn,u32Ident,&pu8OutBuf[8]);
			break;	
		case 0xE1000017:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000017_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;		
		case 0xE1000018:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000018_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1000019:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000019_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE100001A:
			(*pu16OutLen) = 12;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE100001A_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;		
		case 0xE100001B:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;	
		case 0xE100001C:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;		
		case 0xE1000020:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1000020_DataCopy(&pu8OutBuf[8]);
			}
			break;	
		case 0xE1000021:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1000021_DataCopy(&pu8OutBuf[8]);
			}
			break;	
		case 0xE1000030:
			(*pu16OutLen) = 72;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;		
		case 0xE1000031:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;	
		case 0xE1000032:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;	
		case 0xE1000033:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000033_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1000034:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000034_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1000035:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000035_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;		
		case 0xE1000036:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1000036_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;			
		case 0xE1000040:
		case 0xE1000041:
		case 0xE1000042:
		case 0xE1000043:	
		case 0xE1000044:
		case 0xE1000045:			
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;			
		case 0xE1000101:
		case 0xE1000102:
		case 0xE1000103:
		case 0xE1000104:
		case 0xE1000105:
		case 0xE1000106:
		case 0xE1000107:
		case 0xE1000108:
		case 0xE1000109:
		case 0xE100010A:
		case 0xE100010B:
		case 0xE100010C:
		case 0xE100010D:
		case 0xE100010E:
		case 0xE100010F:
		case 0xE1000110:			
		case 0xE1000201:
		case 0xE1000202:
		case 0xE1000203:
		case 0xE1000204:
		case 0xE1000205:
		case 0xE1000206:
		case 0xE1000207:
		case 0xE1000208:
		case 0xE1000209:
		case 0xE100020A:
		case 0xE100020B:
		case 0xE100020C:
		case 0xE100020D:
		case 0xE100020E:
		case 0xE100020F:
		case 0xE1000210:
		case 0xE1000301:
		case 0xE1000302:
		case 0xE1000303:
		case 0xE1000304:
		case 0xE1000305:
		case 0xE1000306:
		case 0xE1000307:
		case 0xE1000308:
		case 0xE1000309:
		case 0xE100030A:
		case 0xE100030B:
		case 0xE100030C:
		case 0xE100030D:
		case 0xE100030E:
		case 0xE100030F:
		case 0xE1000310:			
			(*pu16OutLen) = 2;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;	
		case 0xE10001FF:
		case 0xE10002FF:
		case 0xE10003FF:			
			(*pu16OutLen) = 32;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;			
		case 0x03100000:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0x03100000_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;
		case 0x03100100:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0x03100100_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0x03100200:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0x03100200_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0x03100300:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0x03100300_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1004014:
		case 0xE1004015:
		case 0xE1004016:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004014_16_DataCopy(u16Pn,u32Ident,&pu8OutBuf[8]);
			break;	
		case 0xE1004017:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004017_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;			
		case 0xE1004018:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004018_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1004019:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004019_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE100401A:
			(*pu16OutLen) = 12;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE100401A_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE100401B:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;	
		case 0xE100401C:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;	
		case 0xE1004020:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1004020_DataCopy(&pu8OutBuf[8]);
			}
			break;	
		case 0xE1004021:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1004021_DataCopy(&pu8OutBuf[8]);
			}
			break;
		case 0xE1004030:
			(*pu16OutLen) = 72;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;		
		case 0xE1004031:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;	
		case 0xE1004032:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			break;
		case 0xE1004033:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004033_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;
		case 0xE1004034:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004034_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;	
		case 0xE1004035:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004035_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;
		case 0xE1004036:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[8],0xFF,(*pu16OutLen));
			RD_0xE1004036_DataCopy(u16Pn,&pu8OutBuf[8]);
			break;		
	}
	MemCopy(&pu8OutBuf[2],pu16OutLen,2);
}
/**--------------------------------------------------------------------
*功    能:统计数据赋值
*输入参数:u32Ident：数据标识，u16MaxOutSize：缓冲大小
*输出参数:pu16OutLen:输出长度，pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_FrozenStatisticsData(u16 u16Pn,u32 u32Ident,u8* pu8OutBuf,u16* pu16OutLen)
{
	(*pu16OutLen) = 0;	
	switch(u32Ident)
	{
		case 0xE1000008:
			(*pu16OutLen) = 4;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;
		case 0xE1000010:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000010_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;
		case 0xE1000011:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000011_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE1000012:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000012_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE1000013:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000013_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;
		case 0xE1000014:
		case 0xE1000015:
		case 0xE1000016:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000014_16_DataCopy(u16Pn,u32Ident,&pu8OutBuf[0]);
			break;	
		case 0xE1000017:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000017_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;		
		case 0xE1000018:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000018_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE1000019:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000019_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE100001A:
			(*pu16OutLen) = 12;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE100001A_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;		
		case 0xE100001B:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;	
		case 0xE100001C:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;		
		case 0xE1000020:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1000020_DataCopy(&pu8OutBuf[0]);
			}
			break;	
		case 0xE1000021:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1000021_DataCopy(&pu8OutBuf[0]);
			}
			break;	
		case 0xE1000030:
			(*pu16OutLen) = 72;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;		
		case 0xE1000031:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;	
		case 0xE1000032:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;	
		case 0xE1000033:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000033_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;
		case 0xE1000034:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000034_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;		
		case 0xE1000035:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000035_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;		
		case 0xE1000036:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1000036_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;			
		case 0xE1000040:
		case 0xE1000041:
		case 0xE1000042:
		case 0xE1000043:	
		case 0xE1000044:
		case 0xE1000045:			
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;			
		case 0xE1000101:
		case 0xE1000102:
		case 0xE1000103:
		case 0xE1000104:
		case 0xE1000105:
		case 0xE1000106:
		case 0xE1000107:
		case 0xE1000108:
		case 0xE1000109:
		case 0xE100010A:
		case 0xE100010B:
		case 0xE100010C:
		case 0xE100010D:
		case 0xE100010E:
		case 0xE100010F:
		case 0xE1000110:			
		case 0xE1000201:
		case 0xE1000202:
		case 0xE1000203:
		case 0xE1000204:
		case 0xE1000205:
		case 0xE1000206:
		case 0xE1000207:
		case 0xE1000208:
		case 0xE1000209:
		case 0xE100020A:
		case 0xE100020B:
		case 0xE100020C:
		case 0xE100020D:
		case 0xE100020E:
		case 0xE100020F:
		case 0xE1000210:
		case 0xE1000301:
		case 0xE1000302:
		case 0xE1000303:
		case 0xE1000304:
		case 0xE1000305:
		case 0xE1000306:
		case 0xE1000307:
		case 0xE1000308:
		case 0xE1000309:
		case 0xE100030A:
		case 0xE100030B:
		case 0xE100030C:
		case 0xE100030D:
		case 0xE100030E:
		case 0xE100030F:
		case 0xE1000310:			
			(*pu16OutLen) = 2;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;	
		case 0xE10001FF:
		case 0xE10002FF:
		case 0xE10003FF:			
			(*pu16OutLen) = 32;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;			
		case 0x03100000:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0x03100000_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;
		case 0x03100100:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0x03100100_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0x03100200:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0x03100200_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0x03100300:
#if (DLT500_REPORT == 0)
			(*pu16OutLen) = 27;
#else
			(*pu16OutLen) = 33;
#endif
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0x03100300_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE1004014:
		case 0xE1004015:
		case 0xE1004016:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004014_16_DataCopy(u16Pn,u32Ident,&pu8OutBuf[0]);
			break;	
		case 0xE1004017:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004017_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;			
		case 0xE1004018:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004018_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE1004019:
			(*pu16OutLen) = 14;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004019_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE100401A:
			(*pu16OutLen) = 12;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE100401A_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;	
		case 0xE100401B:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;	
		case 0xE100401C:
			(*pu16OutLen) = 9;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;	
		case 0xE1004020:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1004020_DataCopy(&pu8OutBuf[0]);
			}
			break;	
		case 0xE1004021:
			(*pu16OutLen) = 3;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			if(u16Pn == 0)
			{
				RD_0xE1004021_DataCopy(&pu8OutBuf[0]);
			}
			break;
		case 0xE1004030:
			(*pu16OutLen) = 72;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;		
		case 0xE1004031:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;	
		case 0xE1004032:
			(*pu16OutLen) = 40;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			break;
		case 0xE1004033:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004033_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;
		case 0xE1004034:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004034_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;			
		case 0xE1004035:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004035_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;
		case 0xE1004036:
			(*pu16OutLen) = 33;
			MemSet(&pu8OutBuf[0],0xFF,(*pu16OutLen));
			RD_0xE1004036_DataCopy(u16Pn,&pu8OutBuf[0]);
			break;			
	}
}
/**--------------------------------------------------------------------
*功    能:清除日冻结统计数据赋值
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_ClearTDStatisticsData(u8 u8Flag)
{
	MemSet((u8*)QCSG_VOLTAGE_PASSRATE_DAY,0,1024);
	MemSet((u8*)QCSG_A_VOLTAGE_PASSRATE_DAY,0,1024);
	MemSet((u8*)QCSG_B_VOLTAGE_PASSRATE_DAY,0,1024);
	MemSet((u8*)QCSG_C_VOLTAGE_PASSRATE_DAY,0,1024);
	MemSet((u8*)QCSG_CURRENT_EXTREME_DAY,0,1024);
	MemSet((u8*)QCSG_N_CURRENT_EXTREME_DAY,0,512);
	MemSet((u8*)QCSG_ACTIVE_POWER_DAY,0,512);
	MemSet((u8*)QCSG_REACTIVE_POWER_DAY,0,512);
	MemSet((u8*)QCSG_POWER_FACTOR_DAY,0,512);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_DAY,0,1024);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_A_DAY,0,1024);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_B_DAY,0,1024);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_C_DAY,0,1024);
	if(u8Flag == 1)
	{
		MemSet((u8*)QCSG_POWER_DOWN_NUM_DAY,0,4);
		MemSet((u8*)QCSG_POWER_DOWN_TIME_DAY,0,4);
	}
}
/**--------------------------------------------------------------------
*功    能:清除月冻结统计数据赋值
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_ClearTMStatisticsData(u8 u8Flag)
{
	MemSet((u8*)QCSG_VOLTAGE_PASSRATE_MONTH,0,1024);
	MemSet((u8*)QCSG_A_VOLTAGE_PASSRATE_MONTH,0,1024);
	MemSet((u8*)QCSG_B_VOLTAGE_PASSRATE_MONTH,0,1024);
	MemSet((u8*)QCSG_C_VOLTAGE_PASSRATE_MONTH,0,1024);
	MemSet((u8*)QCSG_CURRENT_EXTREME_MONTH,0,1024);
	MemSet((u8*)QCSG_N_CURRENT_EXTREME_MONTH,0,512);
	MemSet((u8*)QCSG_ACTIVE_POWER_MONTH,0,512);
	MemSet((u8*)QCSG_REACTIVE_POWER_MONTH,0,512);
	MemSet((u8*)QCSG_POWER_FACTOR_MONTH,0,512);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_MONTH,0,1024);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_A_MONTH,0,1024);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_B_MONTH,0,1024);
	MemSet((u8*)QCSG_POWER_FACTOR_ZONE_C_MONTH,0,1024);
	if(u8Flag == 1)
	{
		MemSet((u8*)QCSG_POWER_DOWN_NUM_MONTH,0,4);
		MemSet((u8*)QCSG_POWER_DOWN_TIME_MONTH,0,4);	
	}
}
/**--------------------------------------------------------------------
*功    能:跨日清除
*输入参数:u32Ident：数据标识，u16MaxOutSize：缓冲大小
*输出参数:pu16OutLen:输出长度，pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_ClearAlarmData(void)
{
	//电能表飞走告警，跨日清
	MemSet((u8*)QCSG_ALARM_E200002D_LIST,0,512);	
	//时钟电池过低告警，跨日清
	MemSet((u8*)QCSG_ALARM_E2000032_LIST,0,512);
	//电能表时钟异常告警，跨日清
	MemSet((u8*)QCSG_ALARM_E200003E_LIST,0,512);
}
/**--------------------------------------------------------------------
*功    能:日冻结统计数据转存
*输入参数:u32Ident：数据标识，u16MaxOutSize：缓冲大小
*输出参数:pu16OutLen:输出长度，pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_TDStatisticsDataSave(TIME_PARAM_S* pstTime)
{
	//统计数据存储没有分通道存储，都放在一个list中，这里借用JCRAM的临时缓冲
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;
	MeasurePointStruct stPnPara;
	RealTimeYYStruct stFrozenYYTime;
	u8 i = 0,j = 0;
	u16 u16Pn = 0,u16ReadLen = 0;
	u32 u32CurrIdent = 0,u32TDIdent = 0,u32ReadLen = 0;
	
	RealTimeToYYTime(pstTime,&stFrozenYYTime);
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));
		u16Pn = (u16)SwitchNumToPn(i);
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			continue;
		}
		j = 0;
		while(1)
		{
			u32CurrIdent = gc_StatisticsIdent_Table[j].u32CurrDayStatisticsIdent;
			u32TDIdent = gc_StatisticsIdent_Table[j].u32TDStatisticsIdent;
			j++;
			if((u16Pn != 0) && (u32CurrIdent == 0xE1000020))	// (本日)日停电总次数
			{
				continue;
			}
			if((u16Pn != 0) && (u32CurrIdent == 0xE1000021))	//(本日)日停电总时间
			{
				continue;
			}
			if((u32CurrIdent == 0xFFFFFFFF) || (u32CurrIdent == 0))
			{
				break;
			}
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TDIdent,4);
			RD_FrozenStatisticsData(u16Pn,u32CurrIdent,&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&u16ReadLen);	
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = (u8)u16ReadLen;
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
			pstFrozenData->u32DataLen += (6 + u16ReadLen);		
		}
		NAND_WriteMeterAMRData(AMR_DailyStatisticFreeze,stPnPara.Addr,0,u32TDIdent,&stFrozenYYTime,
		pstFrozenData->u8Data,&pstFrozenData->u32DataLen);		
	}
}

/**--------------------------------------------------------------------
*功    能:日冻结统计数据转存_配变
*输入参数:u32Ident：数据标识，u16MaxOutSize：缓冲大小
*输出参数:pu16OutLen:输出长度，pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_TDStatisticsDataSave_PB(TIME_PARAM_S* pstTime)
{
	//统计数据存储没有分通道存储，都放在一个list中，这里借用JCRAM的临时缓冲
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;
	MeasurePointStruct stPnPara;
	RealTimeYYStruct stFrozenYYTime;
	u8 j = 0;
	u16 u16Pn = 0,u16ReadLen = 0;
	u32 u32CurrIdent = 0,u32TDIdent = 0,u32ReadLen = 0;
	
	RealTimeToYYTime(pstTime,&stFrozenYYTime);

		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			return;//continue;
		}
		j = 0;
		while(1)
		{
			u32CurrIdent = gc_StatisticsIdent_Table[j].u32CurrDayStatisticsIdent;
			u32TDIdent = gc_StatisticsIdent_Table[j].u32TDStatisticsIdent;
			j++;

