gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
			if((u32CurrIdent == 0xFFFFFFFF) || (u32CurrIdent == 0))
			{
				break;
			}
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TDIdent,4);
			RD_FrozenStatisticsData(u16Pn,u32CurrIdent,&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&u16ReadLen);	
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = (u8)u16ReadLen;
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
			pstFrozenData->u32DataLen += (6 + u16ReadLen);		
		}
		NAND_WriteMeterAMRData(AMR_DailyStatisticFreeze,stPnPara.Addr,0,u32TDIdent,&stFrozenYYTime,
		pstFrozenData->u8Data,&pstFrozenData->u32DataLen);		
	
}

/**--------------------------------------------------------------------
*功    能:月冻结统计数据转存
*输入参数:u32Ident：数据标识，u16MaxOutSize：缓冲大小
*输出参数:pu16OutLen:输出长度，pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_TMStatisticsDataSave(TIME_PARAM_S* pstTime)
{
	//统计数据存储没有分通道存储，都放在一个list中，这里借用JCRAM的临时缓冲
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;
	MeasurePointStruct stPnPara;
	RealTimeYYStruct stFrozenYYTime;	
	u8 i = 0,j = 0;
	u16 u16Pn = 0,u16ReadLen = 0;
	u32 u32CurrIdent = 0,u32TMIdent = 0,u32ReadLen = 0;

	RealTimeToYYTime(pstTime,&stFrozenYYTime);	
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));
		u16Pn = (u16)SwitchNumToPn(i);
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			continue;
		}		
		j = 0;
		while(1)
		{
			u32CurrIdent = gc_StatisticsIdent_Table[j].u32CurrMonthStatisticsIdent;
			u32TMIdent = gc_StatisticsIdent_Table[j].u32TMStatisticsIdent;
			j++;
			if((u16Pn != 0) && (u32CurrIdent == 0xE1004020))
			{
				continue;
			}
			if((u16Pn != 0) && (u32CurrIdent == 0xE1004021))
			{
				continue;
			}			
			if((u32CurrIdent == 0xFFFFFFFF) || (u32CurrIdent == 0))
			{
				break;
			}
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TMIdent,4);
			RD_FrozenStatisticsData(u16Pn,u32CurrIdent,&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&u16ReadLen);	
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = (u8)u16ReadLen;
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
			pstFrozenData->u32DataLen += (6 + u16ReadLen);		
		}
		NAND_WriteMeterAMRData(AMR_MonthStatisticFreeze,stPnPara.Addr,0,u32TMIdent,&stFrozenYYTime,
		pstFrozenData->u8Data,&pstFrozenData->u32DataLen);		
	}	
}

/**--------------------------------------------------------------------
*功    能:月冻结统计数据转存_配变
*输入参数:u32Ident：数据标识，u16MaxOutSize：缓冲大小
*输出参数:pu16OutLen:输出长度，pu8OutBuf：输出缓冲
*返    回:无
--------------------------------------------------------------------**/
void RD_TMStatisticsDataSave_PB(TIME_PARAM_S* pstTime)
{
	//统计数据存储没有分通道存储，都放在一个list中，这里借用JCRAM的临时缓冲
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;
	MeasurePointStruct stPnPara;
	RealTimeYYStruct stFrozenYYTime;	
	u8 j = 0;
	u16 u16Pn = 0,u16ReadLen = 0;
	u32 u32CurrIdent = 0,u32TMIdent = 0,u32ReadLen = 0;

	RealTimeToYYTime(pstTime,&stFrozenYYTime);	
	
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			return;//continue;
		}		
		j = 0;
		while(1)
		{
			u32CurrIdent = gc_StatisticsIdent_Table[j].u32CurrMonthStatisticsIdent;
			u32TMIdent = gc_StatisticsIdent_Table[j].u32TMStatisticsIdent;
			j++;			
			if((u32CurrIdent == 0xFFFFFFFF) || (u32CurrIdent == 0))
			{
				break;
			}
			MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32TMIdent,4);
			RD_FrozenStatisticsData(u16Pn,u32CurrIdent,&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],&u16ReadLen);	
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = (u8)u16ReadLen;
			pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
			pstFrozenData->u32DataLen += (6 + u16ReadLen);		
		}
		NAND_WriteMeterAMRData(AMR_MonthStatisticFreeze,stPnPara.Addr,0,u32TMIdent,&stFrozenYYTime,
		pstFrozenData->u8Data,&pstFrozenData->u32DataLen);			
}

/**--------------------------------------------------------------------
*功    能:645数据标识到南网数据标识的转换
*输入参数:u8ConvertMethod：转换方法，pu8InData：输入缓冲，u16InLen：输入长度
*输出参数:pu8OutData：输出缓冲，pu16OutLen：输出长度
*返    回:无
--------------------------------------------------------------------**/
void RD_DLT645Data_To_NwData(u8 u8ConvertMethod,u8* pu8InData,u8 u8InLen,u8* pu8OutData,u8* pu8OutLen)
{
	TIME_PARAM_S stFrozenTime;
	u32 u32Value = 0;
	
	switch(u8ConvertMethod)
	{
		case COMMON_COV_METHOD:
		//数据直接转换
			MemCopy(pu8OutData,pu8InData,u8InLen);
			(*pu8OutLen) = u8InLen;
			break;
		case PRICE_COV_METHOD:
		//数据头增加1个字节费率字段
			if((u8InLen/4) > 0)
			{
				pu8OutData[0] = u8InLen/4 - 1;
				MemCopy(&pu8OutData[1],pu8InData,u8InLen);
				(*pu8OutLen) = u8InLen + 1;
			}
			else
			{
				pu8OutData[0] = 0x04;
				(*pu8OutLen) = 21;
				MemSet(&pu8OutData[1],0xFF,20);
			}
			break;
		case HBYTE_ADD_YEAR_COV_METHOD:
		//高字节补充1个字节年份信息,用于97最大需量发生时间转换
			if(HAL_GetSystemTime(&stFrozenTime) != TRUE)
			{
				stFrozenTime.u8Year = 0x00;
			}	
			if(QCSG_BCDCheck(pu8InData,u8InLen) != TRUE)
			{
				stFrozenTime.u8Year = 0xFF;
			}
			MemCopy(&pu8OutData[0],pu8InData,u8InLen);
			pu8OutData[u8InLen] = stFrozenTime.u8Year;
			(*pu8OutLen) = u8InLen + 1;			
			break;
		case HLBIT_ADD_ZERO_COV_METHOD:
		//高四位补零，低四位补零，用于97协议电流数据转换
			if(u8InLen < 4)
			{
				if(QCSG_BCDCheck(pu8InData,u8InLen) != TRUE)
				{
					(*pu8OutLen) = u8InLen + 1;
					MemSet(pu8OutData,0xFF,(*pu8OutLen));
				}
				else
				{
					MemCopy(&u32Value,pu8InData,u8InLen);
					u32Value = (u32Value << 4) & 0xFFFFFFF0;
					(*pu8OutLen) = u8InLen + 1;
					MemCopy(pu8OutData,&u32Value,(*pu8OutLen));
				}
			}
			break;
		case LBYTE_ADD_ZERO_COV_METHOD:
		//低字节补充零，用于97无功功率格式转换	
			if(QCSG_BCDCheck(pu8InData,u8InLen) != TRUE)
			{
				pu8OutData[0] = 0xFF;
			}
			else
			{
				pu8OutData[0] = 0x00;
			}
			MemCopy(&pu8OutData[1],pu8InData,u8InLen);
			(*pu8OutLen) = u8InLen + 1;
			break;
		case HBYTE_ADD_ZERO_COV_METHOD:
			if(QCSG_BCDCheck(pu8InData,u8InLen) != TRUE)
			{
				pu8OutData[u8InLen] = 0xFF;
			}
			else
			{
				pu8OutData[u8InLen] = 0x00;
			}
			(*pu8OutLen) = u8InLen + 1;
			break;
		case TAKE_PRICE_DATA_COV_METHOD:
		//打包数据中提取费率数据，主要用于冻结数据处理，由于冻结处理没用表格，故此项目前无用
//			i = pu8InData[0];
//			i *= 4;
//			MR((u32)&pu8OutData[0], (u32)&pu8InData[0], 4);
//			MR((u32)&pu8OutData[4], (u32)&pu8InData[4 + i], 4);
//			(*pu8OutLen) = 8;
			break;
		case LBIT_ADD_ZERO_COV_METHOD:
			if((QCSG_BCDCheck(pu8InData,u8InLen) != TRUE) || (u8InLen > 4))
			{
				(*pu8OutLen) = u8InLen;
				MemSet(pu8OutData,0xFF,(*pu8OutLen));
			}			
			MemCopy(&u32Value,pu8InData,u8InLen);
			u32Value = (u32Value << 4) & 0xFFFFFFF0;
			MemCopy(pu8OutData,&u32Value,u8InLen);
			(*pu8OutLen) = u8InLen;
			break;
		case LBYTE_ADD_PRICE_METHOD:
			pu8OutData[0] = 0x04;
			MemCopy(&pu8OutData[1],pu8InData,u8InLen);
			(*pu8OutLen) = u8InLen + 1;			
			break;
		case DEMAND_PRICE_COV_METHOD:
		//数据头增加1个字节费率字段,对需量数据的处理
			if((u8InLen/8) > 0)
			{
				pu8OutData[0] = u8InLen/8 - 1;
				MemCopy(&pu8OutData[1],pu8InData,u8InLen);
				(*pu8OutLen) = u8InLen + 1;
			}
			else
			{
				pu8OutData[0] = 0x04;
				(*pu8OutLen) = 41;
				MemSet(&pu8OutData[1],0xFF,40);
			}			
			break;
			
		case LBYTE_ABANDON_HBYTE_ZERO:	//20190507 剩余金额用到
			if(QCSG_BCDCheck(pu8InData,u8InLen) != TRUE){	//回复d1或抄不到
				MemSet(pu8OutData,0xFF,4);
			}
			else{
				MemCopy(pu8OutData,&pu8InData[1],3);
				pu8OutData[3]=0;
			}
			(*pu8OutLen) = u8InLen;
			break;

				
		default:
			MemCopy(pu8OutData,pu8InData,u8InLen);
			(*pu8OutLen) = u8InLen;
			break;
	}
}


 /**--------------------------------------------------------------------
 *功	 能:645数据标识到南网数据标识的转换
 *输入参数:u8ConvertMethod：转换方法，pu8InData：输入缓冲，u16InLen：输入长度
 *输出参数:pu8OutData：输出缓冲，pu16OutLen：输出长度
 *返	 回:无
 --------------------------------------------------------------------**/
 void RD_EDMIData_To_NwData(u8 u8ConvertMethod,u8* pu8InData,u8 u8InLen,u8* pu8OutData,u8* pu8OutLen)
 {
 	 u8 i=0;
	 //TIME_PARAM_S stFrozenTime;
	 u64 u64Value = 0;
	 u32 u32Value = 0;//单位10Wh
	 u64 Float_Value = 0;
	 u64 Output_Value[2];//单位Wh
	 u32 u32Output_Value[2];
	 u8 Zero_Value[8] = {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};
	 u8 Zero_Time[6] = {1,1,96,0,0,0};//红相表基准基准时间96年1月1日0点0分0秒 HEX格式
	 u8 u8Sign_bit=0;

	switch(u8ConvertMethod)
	{
		case EDMI_IEEE754_FLOAT_METHOD://单个数据类型  直接取
			if(MemCompare(pu8InData, Zero_Value, 8) == 0)
			{
				MemSet(pu8OutData,0x00,4);
			}
			else 
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				u32Value = u32Output_Value[0] /10;// 单位转换XX   XXXX Wh -> XXXXXX.XX KWH
				pu8OutData[3] = QCSG_HEX2BCD((u8)(u32Value/1000000%100));
				pu8OutData[2] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
			}
			(*pu8OutLen) = 4;
			break;	
		case EDMI_IEEE754_DOUBLE_METHOD:
			if(MemCompare(pu8InData, Zero_Value, 8) == 0)
			{
				MemSet(pu8OutData,0x00,4);
			}
			else 
			{
				Float_Value = ((u64)pu8InData[0]<<56) + ((u64)pu8InData[1]<<48) + ((u64)pu8InData[2]<<40) + ((u64)pu8InData[3]<<32)	+ ((u64)pu8InData[4]<<24) + ((u64)pu8InData[5]<<16) + ((u64)pu8InData[6]<<8) + ((u64)pu8InData[7]);
				IEEE754_Double_Arithmetic(Float_Value,Output_Value);
				u64Value = Output_Value[0] /10;// 单位转换XX   XXXX Wh -> XXXXXX.XX KWH
				pu8OutData[3] = QCSG_HEX2BCD((u8)(u64Value/1000000%100));
				pu8OutData[2] = QCSG_HEX2BCD((u8)(u64Value/10000%100));
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u64Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u64Value/1%100));
			}
			(*pu8OutLen) = 4 ;
			break;
		case PRICE_COV_EDMI_IEEE754_DOUBLE_METHOD:
			pu8OutData[0] = 4;
			for(i=0;i<5;i++)
			{
				if(MemCompare(&pu8InData[i*8], Zero_Value, 8) == 0)
				{
					MemSet(&pu8OutData[i*4+1],0x00,4);
				}
				else 
				{
					Float_Value = ((u64)pu8InData[i*8]<<56) + ((u64)pu8InData[i*8+1]<<48) + ((u64)pu8InData[i*8+2]<<40) + ((u64)pu8InData[i*8+3]<<32)	+ ((u64)pu8InData[i*8+4]<<24) + ((u64)pu8InData[i*8+5]<<16) + ((u64)pu8InData[i*8+6]<<8) + ((u64)pu8InData[i*8+7]);
					IEEE754_Double_Arithmetic(Float_Value,Output_Value);
					u64Value = Output_Value[0] /10;// 单位转换XX   XXXX Wh -> XXXXXX.XX KWH
					pu8OutData[i*4+4] = QCSG_HEX2BCD((u8)(u64Value/1000000%100));
					pu8OutData[i*4+3] = QCSG_HEX2BCD((u8)(u64Value/10000%100));
					pu8OutData[i*4+2] = QCSG_HEX2BCD((u8)(u64Value/100%100));
					pu8OutData[i*4+1] = QCSG_HEX2BCD((u8)(u64Value/1%100));
				}
			}
			(*pu8OutLen) = 21;
			break;
		case NOPRICE_COV_EDMI_IEEE754_DOUBLE_METHOD://不增加费率字段 用于曲线和冻结
			//pu8OutData[0] = 4;
			for(i=0;i<5;i++)
			{
				if(MemCompare(&pu8InData[i*8], Zero_Value, 8) == 0)
				{
					MemSet(&pu8OutData[i*4],0x00,4);
				}
				else 
				{
					Float_Value = ((u64)pu8InData[i*8]<<56) + ((u64)pu8InData[i*8+1]<<48) + ((u64)pu8InData[i*8+2]<<40) + ((u64)pu8InData[i*8+3]<<32)	+ ((u64)pu8InData[i*8+4]<<24) + ((u64)pu8InData[i*8+5]<<16) + ((u64)pu8InData[i*8+6]<<8) + ((u64)pu8InData[i*8+7]);
					IEEE754_Double_Arithmetic(Float_Value,Output_Value);
					u64Value = Output_Value[0] /10;// 单位转换XX   XXXX Wh -> XXXXXX.XX KWH
					pu8OutData[i*4+3] = QCSG_HEX2BCD((u8)(u64Value/1000000%100));
					pu8OutData[i*4+2] = QCSG_HEX2BCD((u8)(u64Value/10000%100));
					pu8OutData[i*4+1] = QCSG_HEX2BCD((u8)(u64Value/100%100));
					pu8OutData[i*4+0] = QCSG_HEX2BCD((u8)(u64Value/1%100));
				}
			}
			(*pu8OutLen) = 20;
			break;
		case EDMI_REQ_BLOCK_METHOD:
			pu8OutData[0] = 4;
			for(i=0;i<5;i++)
			{
				if(MemCompare(&pu8InData[i*10], Zero_Value, 4) == 0)//判断需量是否有效
				{
					MemSet(&pu8OutData[i*8+1],0x00,3);
				}
				else
				{
					Float_Value = (pu8InData[i*10+0]<<24) + (pu8InData[i*10+1]<<16) + (pu8InData[i*10+2]<<8) + (pu8InData[i*10+3]);
					IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
					u32Value = u32Output_Value[0] *10 + u32Output_Value[1]/10;//XXXXW -> XXXXXX 0.1W 
					pu8OutData[i*8+2+1] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
					pu8OutData[i*8+1+1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
					pu8OutData[i*8+0+1] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				}
				if(MemCompare(&pu8InData[i*10+4], Zero_Time, 6) == 0)//判断时间是否有效 
				{
					MemSet(&pu8OutData[i*8+3+1],0x00,5);
				}
				else 
				{
					pu8OutData[i*8+3+4+1] = QCSG_HEX2BCD(pu8InData[i*10+4+2]);//年 96
					pu8OutData[i*8+3+3+1] = QCSG_HEX2BCD(pu8InData[i*10+4+1]);//月 1
					pu8OutData[i*8+3+2+1] = QCSG_HEX2BCD(pu8InData[i*10+4+0]);//日 1
					pu8OutData[i*8+3+1+1] = QCSG_HEX2BCD(pu8InData[i*10+4+3]);//时 0
					pu8OutData[i*8+3+0+1] = QCSG_HEX2BCD(pu8InData[i*10+4+4]);//分 0
				}
			}
			(*pu8OutLen) = 41;
			break;
		case NOPRICE_COV_EDMI_REQ_BLOCK_METHOD://不增加费率字段 用于曲线和冻结
			//pu8OutData[0] = 4;
			for(i=0;i<5;i++)
			{
				if(MemCompare(&pu8InData[i*10], Zero_Value, 4) == 0)//判断需量是否有效
				{
					MemSet(&pu8OutData[i*8],0x00,3);
				}
				else
				{
					Float_Value = (pu8InData[i*10+0]<<24) + (pu8InData[i*10+1]<<16) + (pu8InData[i*10+2]<<8) + (pu8InData[i*10+3]);
					IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
					u32Value = u32Output_Value[0] *10 + u32Output_Value[1]/10;//XXXXW -> XXXXXX 0.1W 
					pu8OutData[i*8+2] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
					pu8OutData[i*8+1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
					pu8OutData[i*8+0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				}
				if(MemCompare(&pu8InData[i*10+4], Zero_Time, 6) == 0)//判断时间是否有效
				{
					MemSet(&pu8OutData[i*8+3],0x00,5);
				}
				else 
				{
					pu8OutData[i*8+3+4] = QCSG_HEX2BCD(pu8InData[i*10+4+2]);//年
					pu8OutData[i*8+3+3] = QCSG_HEX2BCD(pu8InData[i*10+4+1]);//月
					pu8OutData[i*8+3+2] = QCSG_HEX2BCD(pu8InData[i*10+4+0]);//日
					pu8OutData[i*8+3+1] = QCSG_HEX2BCD(pu8InData[i*10+4+3]);//时
					pu8OutData[i*8+3+0] = QCSG_HEX2BCD(pu8InData[i*10+4+4]);//分
				}
			}
			(*pu8OutLen) = 40;
			break;
		case EDMI_REQ_SINGLE_METHOD:
			if(MemCompare(pu8InData, Zero_Value, 4) == 0)//判断需量是否有效
			{
				MemSet(pu8OutData,0x00,3);
			}
			else
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				u32Value = u32Output_Value[0] *10 + u32Output_Value[1]/10;//XXXXW -> XXXXXX 0.1W 
				pu8OutData[2] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
			}
			if(MemCompare(&pu8InData[4], Zero_Time, 6) == 0)//判断时间是否有效
			{
				MemSet(&pu8OutData[3],0x00,5);
			}
			else 
			{
				pu8OutData[3+4] = QCSG_HEX2BCD(pu8InData[4+2]);//年 //前4个是需量
				pu8OutData[3+3] = QCSG_HEX2BCD(pu8InData[4+1]);//月
				pu8OutData[3+2] = QCSG_HEX2BCD(pu8InData[4+0]);//日
				pu8OutData[3+1] = QCSG_HEX2BCD(pu8InData[4+3]);//时
				pu8OutData[3+0] = QCSG_HEX2BCD(pu8InData[4+4]);//分
			}
			(*pu8OutLen) = 8;
			break;
		case EDMI_VOLTAGE_BLOCK_METHOD:
			for(i=0;i<3;i++)
			{
				if(MemCompare(&pu8InData[i*4], Zero_Value, 4) == 0)
				{
					MemSet(&pu8OutData[i*2],0x00,2);
				}
				else 
				{
					Float_Value = (pu8InData[i*4+0]<<24) + (pu8InData[i*4+1]<<16) + (pu8InData[i*4+2]<<8) + (pu8InData[i*4+3]);
					IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
					u32Value = u32Output_Value[0] *10 + u32Output_Value[1]/10;// 单位转换XXXX V -> XXXX 0.1V     XXXXXX Wh -> XXXXXXXX 10WH
					pu8OutData[i*2+1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
					pu8OutData[i*2+0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				}
			}
			MemSet(&pu8OutData[6],0xFF,12);
			(*pu8OutLen) = 18;
			break;
		case EDMI_VOLTAGE_SINGLE_METHOD:
			if(MemCompare(pu8InData, Zero_Value, 4) == 0)
			{
				MemSet(pu8OutData,0x00,2);
			}
			else 
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				u32Value = u32Output_Value[0] *10 + u32Output_Value[1]/10;// 单位转换XXXX V -> XXXX 0.1V     XXXXXX Wh -> XXXXXXXX 10WH
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
			}
			(*pu8OutLen) = 2;
			break;	
		case EDMI_CURRENT_BLOCK_METHOD://电流数据块
			for(i=0;i<3;i++)
			{
				if(MemCompare(&pu8InData[i*4], Zero_Value, 4) == 0)
				{
					MemSet(&pu8OutData[i*3],0x00,3);
				}
				else 
				{
					Float_Value = (pu8InData[i*4+0]<<24) + (pu8InData[i*4+1]<<16) + (pu8InData[i*4+2]<<8) + (pu8InData[i*4+3]);
					IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
					u32Value = u32Output_Value[0] *1000 + u32Output_Value[1]*10;//XXXXA -> XXXXXX 0.001A
					pu8OutData[i*3+2] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
					pu8OutData[i*3+1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
					pu8OutData[i*3+0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				}
			}
			MemSet(&pu8OutData[9],0xFF,9);
			(*pu8OutLen) = 18;
			break;
		case EDMI_CURRENT_SINGLE_METHOD://电流数据 单相
			if(MemCompare(pu8InData, Zero_Value, 4) == 0)
			{
				MemSet(pu8OutData,0x00,3);
			}
			else 
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				u32Value = u32Output_Value[0] *1000 + u32Output_Value[1]*10;//XXXXA -> XXXXXX 0.001A
				// 单位转换XXXX V -> XXXX 0.1V (*10) 
				//		XXXXXX Wh -> XXXXXXXX 10WH (/10)
				pu8OutData[2] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
			}
			(*pu8OutLen) = 3;
			break;	
		case EDMI_POWER_BLOCK_METHOD://功率数据块
			for(i=0;i<4;i++)
			{
				if(MemCompare(&pu8InData[i*4], Zero_Value, 4) == 0)
				{
					MemSet(&pu8OutData[i*3],0x00,3);
				}
				else 
				{
					Float_Value = (pu8InData[i*4+0]<<24) + (pu8InData[i*4+1]<<16) + (pu8InData[i*4+2]<<8) + (pu8InData[i*4+3]);
					IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
					u32Value = u32Output_Value[0] *10 + u32Output_Value[1]/10;//XXXXW -> XXXXXX 0.1W
					pu8OutData[i*3+2] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
					pu8OutData[i*3+1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
					pu8OutData[i*3+0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				}
			}
			(*pu8OutLen) = 12;
			break;
		case EDMI_POWER_SINGLE_METHOD://功率数据 单相
			if(MemCompare(pu8InData, Zero_Value, 4) == 0)
			{
				MemSet(pu8OutData,0x00,3);
			}
			else 
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				u32Value = u32Output_Value[0] *10 + u32Output_Value[1]/10;//XXXXW -> XXXXXX 0.1W
				// 单位转换XXXX V -> XXXX 0.1V (*10) 
				//		XXXXXX Wh -> XXXXXXXX 10WH (/10)
				pu8OutData[2] = QCSG_HEX2BCD((u8)(u32Value/10000%100));
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
			}
			(*pu8OutLen) = 3;
			break;	
		case EDMI_FACTOR_BLOCK_METHOD:
			if(MemCompare(pu8InData, Zero_Value, 4) == 0)
			{
				MemSet(pu8OutData,0x00,2);
			}
			else 
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				u8Sign_bit = IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				u32Value = u32Output_Value[0] *1000 + u32Output_Value[1]*10;//XXXXQ -> XXXX 0.001Q
				
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				if(u8Sign_bit == 1) 
					pu8OutData[1] |= 0x80;
			}
			MemSet(&pu8OutData[2],0xFF,6);//红相表功率因数只有总 其余填FF
			(*pu8OutLen) = 8;
			break;	
		case EDMI_FACTOR_SINGLE_METHOD:
			if(MemCompare(pu8InData, Zero_Value, 4) == 0)
			{
				MemSet(pu8OutData,0x00,2);
			}
			else 
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				u8Sign_bit = IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				u32Value = u32Output_Value[0] *1000 + u32Output_Value[1]*10;//XXXXQ -> XXXX 0.001Q
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				if(u8Sign_bit == 1) 
					pu8OutData[1] |= 0x80;
			}
			(*pu8OutLen) = 2;
			break;	
		case EDMI_ANGLE_BLOCK_METHOD:
			for(i=0;i<6;i++)
			{
				if(MemCompare(&pu8InData[i*4], Zero_Value, 4) == 0)
				{
					MemSet(&pu8OutData[i*2],0x00,2);
				}
				else 
				{
					Float_Value = (pu8InData[i*4+0]<<24) + (pu8InData[i*4+1]<<16) + (pu8InData[i*4+2]<<8) + (pu8InData[i*4+3]);
					u8Sign_bit = IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
					if(u8Sign_bit == 0) 
						u32Output_Value[0] = 360-u32Output_Value[0];
					u32Value = u32Output_Value[0] *10;//XXXXD -> XXX.XD 0.1D
					pu8OutData[i*2+1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
					pu8OutData[i*2+0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
				}
			}
			(*pu8OutLen) = 12;
			break;	
		case EDMI_ANGLE_SINGLE_METHOD:
			if(MemCompare(pu8InData, Zero_Value, 4) == 0)
			{
				MemSet(pu8OutData,0x00,2);
			}
			else 
			{
				Float_Value = (pu8InData[0]<<24) + (pu8InData[1]<<16) + (pu8InData[2]<<8) + (pu8InData[3]);
				u8Sign_bit = IEEE754_Float_Arithmetic((u32)Float_Value,u32Output_Value);
				if(u8Sign_bit == 0) 
						u32Output_Value[0] = 360-u32Output_Value[0];
				u32Value = u32Output_Value[0] *10;//XXXXD -> XXX.XD 0.1D
				pu8OutData[1] = QCSG_HEX2BCD((u8)(u32Value/100%100));
				pu8OutData[0] = QCSG_HEX2BCD((u8)(u32Value/1%100));	
			}
			(*pu8OutLen) = 2;
			break;
		case EDMI_TIME_METHOD:
			if(MemCompare(pu8InData, Zero_Value, 3) == 0)
			{
				MemSet(pu8OutData,0x00,3);
			}
			else
			{
				pu8OutData[2] = QCSG_HEX2BCD((u8)pu8InData[0]);//时
				pu8OutData[1] = QCSG_HEX2BCD((u8)pu8InData[1]);//分
				pu8OutData[0] = QCSG_HEX2BCD((u8)pu8InData[2]);//秒
			}
			(*pu8OutLen) = 3;
			break;
		case EDMI_DATA_METHOD://err20190713-2 增加支持日期抄读 星期不支持填FF 南网YYMMDDWW 红相DDMMYY
			if(MemCompare(pu8InData, Zero_Value, 3) == 0)
			{
				MemSet(pu8OutData,0x00,4);
			}
			else
			{
				pu8OutData[0] = 0xFF;							//星期
				pu8OutData[1] = QCSG_HEX2BCD((u8)pu8InData[0]);//日
				pu8OutData[2] = QCSG_HEX2BCD((u8)pu8InData[1]);//月
				pu8OutData[3] = QCSG_HEX2BCD((u8)pu8InData[2]);//年
			}
			(*pu8OutLen) = 4;
			break;
		case COMMON_COV_METHOD:
		//数据直接转换
			MemCopy(pu8OutData,pu8InData,u8InLen);
			(*pu8OutLen) = u8InLen;
			break;
		default:
			MemCopy(pu8OutData,pu8InData,u8InLen);
			(*pu8OutLen) = u8InLen;
			break;
	}
	
