gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
}



 /**--------------------------------------------------------------------
*功    能:LCD数据刷新
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_LcdData_Refresh(void)
{
	QCSG_LCD_RAMDATA_LIST_S* pstPn_Ram_Data = (QCSG_LCD_RAMDATA_LIST_S*)QCSG_LCD_RAM_LIST;
	QCSG_LCD_RAMDATA_S* pstRam_Data = (QCSG_LCD_RAMDATA_S*)ADDR_LCD_MeterAMRDataBuf;
	QCSG_DAY_ENERGY_LIST_S* pst_Day_Energy_List = (QCSG_DAY_ENERGY_LIST_S*)QCSG_DAY_ENERGY_LIST_LCD;
	QCSG_MONTH_ENERGY_LIST_S* pst_Month_Energy_List = (QCSG_MONTH_ENERGY_LIST_S*)QCSG_MONTH_ENERGY_LIST_LCD;
	u8 i = 0,j = 0;
	u16 u16Pn = 0,u16PnBack = 0;

	if((pstRam_Data->u16Res1 & LCD_RT_BOTTOM_ICO) != 0)
	{
		pstRam_Data->u16Res1 &= (~LCD_RT_BOTTOM_ICO);
		u16Pn = 0;
		for(i = 0;i < pstPn_Ram_Data->u8PnNum;i++)
		{
			if(u16Pn == pstPn_Ram_Data->stPnLcdRamData[i].u16Pn)
			{
				MemCopy(pstRam_Data->u8Terminal040005FF,pstPn_Ram_Data->stPnLcdRamData[i].u8Data040005FF,sizeof(pstRam_Data->u8Terminal040005FF));
				break;
			}
		}
	}
	if((pstRam_Data->u16Res1 & LCD_RT_AMR_REQ) != 0)
	{
		pstRam_Data->u16Res1 &= (~LCD_RT_AMR_REQ);
		u16PnBack = pstRam_Data->u16Pn;
		u16Pn = (u16)SwitchNumToPn(pstRam_Data->u16Pn);
		for(i = 0;i < pstPn_Ram_Data->u8PnNum;i++)
		{
			if(u16Pn == pstPn_Ram_Data->stPnLcdRamData[i].u16Pn)
			{
				MemCopy(pstRam_Data,&pstPn_Ram_Data->stPnLcdRamData[i],sizeof(QCSG_LCD_RAMDATA_S));
				pstRam_Data->u16Pn = u16PnBack;
				break;
			}
		}
		//填充电能量数据
		for(j = 0;j < pst_Day_Energy_List->u8PnNum;j++)
		{
			if(u16Pn == pst_Day_Energy_List->stPn_Ram_Data[j].u16Pn)
			{
				MemCopy(&pstRam_Data->u8CurrDay0001FF00[0],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00010000,4);
				MemCopy(&pstRam_Data->u8CurrDay0001FF00[4],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00010100,4);
				MemCopy(&pstRam_Data->u8CurrDay0001FF00[8],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00010200,4);
				MemCopy(&pstRam_Data->u8CurrDay0001FF00[12],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00010300,4);
				MemCopy(&pstRam_Data->u8CurrDay0001FF00[16],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00010400,4);
				MemCopy(&pstRam_Data->u8CurrDay0002FF00[0],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00020000,4);
				MemCopy(&pstRam_Data->u8CurrDay0002FF00[4],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00020100,4);
				MemCopy(&pstRam_Data->u8CurrDay0002FF00[8],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00020200,4);
				MemCopy(&pstRam_Data->u8CurrDay0002FF00[12],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00020300,4);
				MemCopy(&pstRam_Data->u8CurrDay0002FF00[16],&pst_Day_Energy_List->stPn_Ram_Data[j].u32Energy00020400,4);
			}
		}
		for(j = 0;j < pst_Month_Energy_List->u8PnNum;j++)
		{
			if(u16Pn == pst_Month_Energy_List->stPn_Ram_Data[j].u16Pn)
			{
				MemCopy(&pstRam_Data->u8CurrMonth0001FF00[0],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00010000,4);
				MemCopy(&pstRam_Data->u8CurrMonth0001FF00[4],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00010100,4);
				MemCopy(&pstRam_Data->u8CurrMonth0001FF00[8],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00010200,4);
				MemCopy(&pstRam_Data->u8CurrMonth0001FF00[12],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00010300,4);
				MemCopy(&pstRam_Data->u8CurrMonth0001FF00[16],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00010400,4);
				MemCopy(&pstRam_Data->u8CurrMonth0002FF00[0],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00020000,4);
				MemCopy(&pstRam_Data->u8CurrMonth0002FF00[4],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00020100,4);
				MemCopy(&pstRam_Data->u8CurrMonth0002FF00[8],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00020200,4);
				MemCopy(&pstRam_Data->u8CurrMonth0002FF00[12],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00020300,4);
				MemCopy(&pstRam_Data->u8CurrMonth0002FF00[16],&pst_Month_Energy_List->stPn_Ram_Data[j].u32Energy00020400,4);
			}
		}
		//填充统计数据
		RD_0xE1000010_DataCopy(u16Pn,pstRam_Data->u8DataE1000010);
		RD_0xE1000011_DataCopy(u16Pn,pstRam_Data->u8DataE1000011);
		RD_0xE1000012_DataCopy(u16Pn,pstRam_Data->u8DataE1000012);
		RD_0xE1000013_DataCopy(u16Pn,pstRam_Data->u8DataE1000013);	
		RD_0x03100000_DataCopy(u16Pn,pstRam_Data->u8Data03100000);
		RD_0x03100100_DataCopy(u16Pn,pstRam_Data->u8Data03100100);
		RD_0x03100200_DataCopy(u16Pn,pstRam_Data->u8Data03100200);
		RD_0x03100300_DataCopy(u16Pn,pstRam_Data->u8Data03100300);
		RD_0xE1000033_DataCopy(u16Pn,pstRam_Data->u8DataE1000033);
		RD_0xE1004033_DataCopy(u16Pn,pstRam_Data->u8DataE1004033);
		//填充终端状态字
		QCSG_ReadTerminal_State(&pstRam_Data->u8DataTerminalStateWord[0],&pstRam_Data->u8DataTerminalStateWord[1]);
	}
}
/**--------------------------------------------------------------------
*功    能:实时抄表处理
*输入参数:u8ChNo:通道号，pstRT_RDMeter_Info:抄表信息结构体，pstDlt645Frame_Info:DLT645帧结构体
*输出参数:pu8Lock:锁状态
*返    回:无
--------------------------------------------------------------------**/
void RD_Meter_RT(DLT645_FRAME_S* pstDlt645Frame_Info,u8* pu8Lock)
{
	QCSG_RTREADMETER_REQ_INFO_S* pstRt_Req_Info = (QCSG_RTREADMETER_REQ_INFO_S*)QCSG_RT_RDMETER_REQ;
	QCSG_RTREADMETER_RES_INFO_S* pstRt_Res_Info = (QCSG_RTREADMETER_RES_INFO_S*)QCSG_RT_RDMETER_RES;
	MeasurePointStruct stPnPara;
	MultiFrameSendReqStruct stSendReq_Info;
	u8 u8DLT645IdentNum = 0,u8DataLen = 0,u8FailLen = 0,u8Res = 0,u8FrameType = 0,u8DataType = 0,u8DataPos = 0;
	u8 u8CtrlCode = 0,u8IdentLen = 0,u8Ident[4],u8MeterId[6],u8FEFlag = TRUE,u8HwPort = 0;
	u8 u8ConvertMethodList[12],u8LenList[12];
	u8 u8PortBaudRate = 0,u8PortParity = 0,u8PortDataBit = 0,u8PortStopBit = 0,u8DestPort = 0,u8PortTimeout = 0;
	u16 i = 0,j = 0,k = 0,u16Pn = 0xFFFF;
	u32 u32NwIdent = 0,u32ReadLen = 0,u32DLT645Identlist[12];
	u32 u32RdStartTick = 0,u32CurrTick = 0,u32BpsCtrl = 0;
	u32* pu32Value = (u32*)(ADDR_MS_ENTRY);

	
	//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl_RT = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RT;

	//err20190611 EDMI使用 实时占用的485端口是否打断其他任务。
	//u8PnNum_EDMI_IsLoad=0表示没打断(未登陆)，否则u8PnNum_EDMI_IsLoad表示打断任务对应的测量点号(已登陆)
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl_485 = NULL;
	MeasurePointStruct stPnPara_Temp;//用于EDMI读测量点的通信参数
	u32 u32BpsCtrl_Temp =0 ;//EDMI读测量点的通信参数

	UARTCtrl_TypeDef * UARTCtrl;//err20190226 增加485-II,485-III抄表口判断 
	
	if((pstRt_Req_Info->PnListNum == 0) || (pstRt_Req_Info->PnListLen == 0))
	{
		return;
	}
	if((pstRt_Req_Info->DataType != DATA_TYPE_RELAY) && (pstRt_Req_Info->DataType != DATA_TYPE_STRUCT))
	{
		if(pstRt_Req_Info->PnListNum != 0)
		{
			pstRt_Req_Info->PnListNum--;
		}
		pstRt_Req_Info->Lock = 0;		
		return;		
	}
	if(pstRt_Req_Info->DataType != DATA_TYPE_RELAY)
	{
		if(pstRt_Req_Info->PnListLen != (8 * pstRt_Req_Info->PnListNum))
		{
			pstRt_Req_Info->PnListNum--;
			pstRt_Req_Info->Lock = 0;
			return;
		}
	}
	if(pstRt_Req_Info->DataType == DATA_TYPE_RELAY)
	{
		//中继任务过来的实时发送数据处理
		MemSet(&stSendReq_Info,0,sizeof(MultiFrameSendReqStruct));
		stSendReq_Info.DataType = pstRt_Req_Info->DataType;
		stSendReq_Info.FrameType = pstRt_Req_Info->FrameType;
		MemCopy(&stSendReq_Info.QCSGFrameInfo,&pstRt_Req_Info->QCSGFrameInfo,sizeof(QCSGFrameInfoStruct));
		stSendReq_Info.DataBuf = pstRt_Res_Info->u8PnFnData;
		stSendReq_Info.PnListNum = 1;		
		stSendReq_Info.SrcTask = TASK_ID_RT_SEND;
		(*pu8Lock) = FUNC_LOCK;
		pstDlt645Frame_Info->u8SendLen = pstRt_Req_Info->Data[15];
		MemCopy(pstDlt645Frame_Info->u8SendBuf,&pstRt_Req_Info->Data[16],pstDlt645Frame_Info->u8SendLen);
		u8DestPort = pstRt_Req_Info->Data[9];
		u8PortBaudRate = pstRt_Req_Info->Data[10];
		u8PortParity = pstRt_Req_Info->Data[11];
		u8PortDataBit = pstRt_Req_Info->Data[12];
		u8PortStopBit = pstRt_Req_Info->Data[13];
		u8PortTimeout = pstRt_Req_Info->Data[14];
		if((u8DestPort != 0) && (u8DestPort != 1) && (u8DestPort != 2))
		{
			(*pu8Lock) = FUNC_UNLOCK;
			pstRt_Req_Info->Lock = 0;
			pstRt_Req_Info->PnListNum--;
			return;
		}
		if(QCSG_PortToHwPort(u8DestPort,&u8HwPort) != TRUE)
		{
			(*pu8Lock) = FUNC_UNLOCK;
			pstRt_Req_Info->Lock = 0;
			pstRt_Req_Info->PnListNum--;
			return;			
		}
		u32RdStartTick = HAL_GetSystemTick();
		pu32Value = (u32*)(ADDR_MS_ENTRY);
		MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
		pstDlt645Frame_Info->u8RevLen = 0;
		RD_GetPn_Bps(u8PortBaudRate,u8PortParity,u8PortDataBit,u8PortStopBit,&u32BpsCtrl);		
		UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,u8PortTimeout);
		while(1)
		{
			//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
			if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
			{			
				pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
				if(pstDlt645Frame_Info->u8RevLen > 0)
				{
					break;
				}
			}
			(*(void(*)())pu32Value[115])();
			u32CurrTick = HAL_GetSystemTick();
			if((u32CurrTick - u32RdStartTick) > 150)//err20190611 为了EDMI表 100增加至150
			{
				break;
			}
		}
		if(pstDlt645Frame_Info->u8RevLen > 0)
		{
			MemCopy(&pstRt_Res_Info->u8PnFnData[0],pstRt_Req_Info->Data,8);
			pstRt_Res_Info->u8PnFnData[8] = pstRt_Req_Info->RelayType;
			pstRt_Res_Info->u8PnFnData[9] = pstDlt645Frame_Info->u8RevLen;
			MemCopy(&pstRt_Res_Info->u8PnFnData[10],pstDlt645Frame_Info->u8RevBuf,pstDlt645Frame_Info->u8RevLen);			
			pstDlt645Frame_Info->u8RevLen += 2;
			pstRt_Res_Info->u8PnFnData[2] = (u8)pstDlt645Frame_Info->u8RevLen ;
			pstRt_Res_Info->u8PnFnData[3] = (u8)(pstDlt645Frame_Info->u8RevLen >> 8);
			stSendReq_Info.DataLen = pstDlt645Frame_Info->u8RevLen + 8;
			u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
			//回到主循环，让上行协议可以发送
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
			(*(void(*)())pu32Value[115])();	
			while(u8Res != NO_ERROR)
			{
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
				u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
				(*(void(*)())pu32Value[115])();	
				u32CurrTick = HAL_GetSystemTick();
				if((u32CurrTick - u32RdStartTick) > 300)
				{
					break;
				}				
			}			
		}
		(*pu8Lock) = FUNC_UNLOCK;
		pstRt_Req_Info->Lock = 0;
		pstRt_Req_Info->PnListNum--;
		return;
	}
	//以下为AFN0C过来的实时数据发送处理
	(*pu8Lock) = FUNC_LOCK;			
	for(i = 0;i < pstRt_Req_Info->PnListNum;i++)
	{
		MemSet(&stSendReq_Info,0,sizeof(MultiFrameSendReqStruct));
		MemSet(pstRt_Res_Info,0,sizeof(QCSG_RTREADMETER_RES_INFO_S));
		stSendReq_Info.DataType = pstRt_Req_Info->DataType;
		stSendReq_Info.FrameType = pstRt_Req_Info->FrameType;
		MemCopy(&stSendReq_Info.QCSGFrameInfo,&pstRt_Req_Info->QCSGFrameInfo,sizeof(QCSGFrameInfoStruct));
		stSendReq_Info.DataBuf = pstRt_Res_Info->u8PnFnData;
		stSendReq_Info.PnListNum = 1;
		stSendReq_Info.SrcTask = TASK_ID_RT_SEND;		
		if(memcmp(&u16Pn,&pstRt_Req_Info->Data[8 * i],2) != 0)
		{
			//如果前后两个测量点一致，则不用拷贝重新读取测量点表号及协议信息
			MemCopy(&u16Pn,&pstRt_Req_Info->Data[8 * i],2);
			
			//#if ((Project/100)==9)
			//	if(u16Pn != 0) continue;
			//#endif
			
