gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
			u32ReadLen = sizeof(MeasurePointStruct);
			if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
			{
				continue;
			}
			if(stPnPara.State == 0)
			{
				continue;
			}
			if(u16Pn != 0)
			{
				if(QCSG_PortToHwPort(stPnPara.PortID,&u8HwPort) != TRUE)
				{
					continue;
				}
				UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(u8HwPort);
				if(UARTCtrl->Function == 0)//err20190619如果是维护口就跳过
				{
					continue;
				}
				RD_GetPn_Bps(stPnPara.PortBaudRate,stPnPara.PortParity,stPnPara.PortDataBit,stPnPara.PortStopBit,&u32BpsCtrl);
			}
			else
			{
				u8HwPort = ACSAMPLEPORT;
				stPnPara.ProtocolType = METER_DLT645_07;
				u32BpsCtrl = 0;
			}
		}
		if(u16Pn == 0)
		{
			u8FEFlag = FALSE;
			//MC(0xaa,(u32)u8MeterId,6);//19-05-28
		}
		else
		{
			u8FEFlag = TRUE;
			//MemCopy(u8MeterId,stPnPara.Addr,6);		
		}
		MemCopy(u8MeterId,stPnPara.Addr,6);
		MemCopy(&u32NwIdent,&pstRt_Req_Info->Data[8 * i + 4],4);
		//统计类数据处理，直接填充数据
		if(QCSG_Check_RDIdent(u32NwIdent) == TRUE)
		{
			MemCopy(&pstRt_Res_Info->u8PnFnData[0],&u16Pn,2);
			pstRt_Res_Info->u8PnFnData[2] = u8DataLen;
			pstRt_Res_Info->u8PnFnData[3] = 0;
			MemCopy(&pstRt_Res_Info->u8PnFnData[4],&u32NwIdent,4);			
			RD_RtStatisticsData(u16Pn,u32NwIdent,pstRt_Res_Info->u8PnFnData,&pstRt_Res_Info->DataLen);
			stSendReq_Info.DataLen = 8 + pstRt_Res_Info->DataLen;
			u32RdStartTick = HAL_GetSystemTick();
			u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
			//回到主循环，让上行协议可以发送
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			
			//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
			
			(*(void(*)())pu32Value[115])();	
			
			while(u8Res != NO_ERROR)
			{
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
				u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
				(*(void(*)())pu32Value[115])();	
				u32CurrTick = HAL_GetSystemTick();
				if((u32CurrTick - u32RdStartTick) > 300)
				{
					break;
				}				
			}
			continue;
		}
		//非统计类数据处理，先将BUF数据附值无效
		if(QCSG_GetDlt645DataLen_By_Ident(0x0C,u32NwIdent,&u8FailLen) != TRUE)
		{
			continue;
		}
		MemCopy(&pstRt_Res_Info->u8PnFnData[0],&u16Pn,2);
		pstRt_Res_Info->u8PnFnData[2] = u8FailLen;
		pstRt_Res_Info->u8PnFnData[3] = 0;
		MemCopy(&pstRt_Res_Info->u8PnFnData[4],&u32NwIdent,4);		
		MemSet(&pstRt_Res_Info->u8PnFnData[8],0xFF,u8FailLen);
		stSendReq_Info.DataLen = 8 + u8FailLen;		
		//if(QCSG_GetDlt645Ident_By_AFN0C0DTable(u32NwIdent,stPnPara.ProtocolType,&u8DLT645IdentNum,u32DLT645Identlist,u8ConvertMethodList,u8LenList) != TRUE)
		if(QCSG_GetDlt645_EDMI_Ident_By_AFN0C0DTable(u32NwIdent,stPnPara.ProtocolType,&u8DLT645IdentNum,u32DLT645Identlist,u8ConvertMethodList,u8LenList) != TRUE)
		{
			//不支持抄读的数据，直接填充0xFF,97协议增加费率字段的需要特殊处理下。
			if(stPnPara.ProtocolType == METER_DLT645_97)
			{
				if((u8ConvertMethodList[0] == PRICE_COV_METHOD) || (u8ConvertMethodList[0] == DEMAND_PRICE_COV_METHOD))
				{
					RD_DLT645Data_To_NwData(u8ConvertMethodList[0],&pstRt_Res_Info->u8PnFnData[8],0,
					&pstRt_Res_Info->u8PnFnData[8],&u8DataLen);
					pstRt_Res_Info->u8PnFnData[2] = u8DataLen;
					pstRt_Res_Info->u8PnFnData[3] = 0;
					stSendReq_Info.DataLen += 1;			
				}
			}
			u32RdStartTick = HAL_GetSystemTick();	
			u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
			//回到主循环，让上行协议可以发送
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
			(*(void(*)())pu32Value[115])();	
			while(u8Res != NO_ERROR)
			{
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
				u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
				(*(void(*)())pu32Value[115])();	
				u32CurrTick = HAL_GetSystemTick();
				if((u32CurrTick - u32RdStartTick) > 300)
				{
					break;
				}				
			}		
			continue;
		}
		//支持的数据标识，准备抄读
		if(stPnPara.ProtocolType == METER_DLT645_97)
		{
			u8IdentLen = 2;
			u8CtrlCode = 0x01;		
		}
		else if(stPnPara.ProtocolType == METER_DLT645_07)
		{
			u8IdentLen = 4;
			u8CtrlCode = 0x11;				
		}
		else if(stPnPara.ProtocolType == METER_EDMI)
		{
			u8IdentLen = 4;


			if(u8HwPort == RS485_1PORT)
			{
				pstRDMeter_Ctrl_485 = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			}
			else if(u8HwPort == RS485_2PORT)
			{
				pstRDMeter_Ctrl_485 = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_II;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			}
			else if(u8HwPort == RS485_3PORT)
			{
				pstRDMeter_Ctrl_485 = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_III;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			}
			else//一般不会发生的情况
			{
				pstRDMeter_Ctrl_485 = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			}
			
			if(pstRDMeter_Ctrl_485->u8PnNum_EDMI_IsLoad == SwitchPnToNum(u16Pn))//当前端口实时要抄读的表已登陆，则直接抄且不需要退出登录。		
			{
				;//不需要登陆，不需要退出。
			}
			else if(pstRDMeter_Ctrl_485->u8PnNum_EDMI_IsLoad == 0)//当前端口没有已登陆测量点
			{
				//直接登陆即可，完成后退出。
				//登陆帧
				QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_Load_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
				MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
				pstDlt645Frame_Info->u8RevLen = 0;	
				u32ReadLen = 0;
				UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{			
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0) break;
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					if((u32CurrTick - u32RdStartTick) > 200) break;
				}//完成发送
			}
			else //当前端口有已登陆测量点，需要先退出登录该测量点。再登陆实时测量点。完成实时任务后需恢复原来状态。
			{
				//退出原来，登陆实时。退出实时，登陆原来
				//读测量点参数
				NAND_ReadMeasurePoint(SwitchNumToPn(pstRDMeter_Ctrl_485->u8PnNum_EDMI_IsLoad),0xE0800002,(u8*)&stPnPara_Temp,&u32ReadLen);
				//得到测量队通信参数
				RD_GetPn_Bps(stPnPara_Temp.PortBaudRate,stPnPara_Temp.PortParity,stPnPara_Temp.PortDataBit,stPnPara_Temp.PortStopBit,&u32BpsCtrl_Temp);

