gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
				//退出登陆帧 原来的测量点
				QCSG_MakeEDMIFrame(stPnPara_Temp.Addr,(u8*)EDMI_UnLoad_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
				MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
				pstDlt645Frame_Info->u8RevLen = 0;	
				u32ReadLen = 0;
				UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl_Temp,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{			
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0) break;
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					if((u32CurrTick - u32RdStartTick) > 200) break;
				}//完成发送

				//登陆帧 实时测量点
				QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_Load_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
				MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
				pstDlt645Frame_Info->u8RevLen = 0;	
				u32ReadLen = 0;
				UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{			
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0) break;
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					if((u32CurrTick - u32RdStartTick) > 200) break;
				}//完成发送
			}
			
		}
		else
		{
			continue;
		}	
		pstRt_Res_Info->DataLen = 8;
		for(j = 0;j < u8DLT645IdentNum;j++)
		{
			if(stPnPara.ProtocolType == METER_DLT645_97)
			{
				u8IdentLen = 2;
				u8CtrlCode = 0x01;		
			}
			if(stPnPara.ProtocolType == METER_DLT645_07)
			{
				u8IdentLen = 4;
				u8CtrlCode = 0x11;				
			}
			else if(stPnPara.ProtocolType == METER_EDMI)
			{
				u8IdentLen = 4;
				//u8CtrlCode = 0x11;				
			}
			MemCopy(u8Ident,&u32DLT645Identlist[j],u8IdentLen);
			if(stPnPara.ProtocolType == METER_EDMI)
			{
				if(QCSG_MakeEDMIFrame_RT(u8MeterId,u32NwIdent,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf)!=TRUE);
				u8DLT645IdentNum = 1;
				//{}
				//发完登录帧再发抄0169帧
				//QCSG_MakeEDMIFrame_Test(1,u8MeterId,u8CtrlCode,u8Ident,u8IdentLen,
				//sizeof(pstDlt645Frame_Info->u8SendBuf),&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf); 
			}
			else
			{
				QCSG_MakeDLT645Frame(u8FEFlag,u8MeterId,u8CtrlCode,u8Ident,u8IdentLen,
            	sizeof(pstDlt645Frame_Info->u8SendBuf),&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
			}
			MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
			pstDlt645Frame_Info->u8RevLen = 0;	
			u32ReadLen = 0;
			UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
			u32RdStartTick = HAL_GetSystemTick();
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			while(1)
			{
			
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
				if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
				{			
					pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
					if(pstDlt645Frame_Info->u8RevLen > 0)
					{
						break;
					}
				}
				(*(void(*)())pu32Value[115])();
				u32CurrTick = HAL_GetSystemTick();
				
				if(stPnPara.ProtocolType == METER_EDMI)
				{
					if((u32CurrTick - u32RdStartTick) > 300)//EDMI表在波特率1200下 响应时间可能超过1s
					{
						break;
					}
				}
				else 
				{
					if((u32CurrTick - u32RdStartTick) > 100)
					{
						break;
					}
				}
			}
			if(pstDlt645Frame_Info->u8RevLen == 0)	//抄不到
			{
				UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{			
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0)
						{
							break;
						}
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					
					if(stPnPara.ProtocolType == METER_EDMI)
					{
						if((u32CurrTick - u32RdStartTick) > 300)//EDMI表在波特率1200下 响应时间可能超过1s
						{
							break;
						}
					}
					else 
					{
						if((u32CurrTick - u32RdStartTick) > 100)
						{
							break;
						}
					}
				}
				if(pstDlt645Frame_Info->u8RevLen == 0)	//重发还是抄不到
				{
					if(stPnPara.ProtocolType == METER_EDMI)
					{
						MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[0]);
						RD_EDMIData_To_NwData(COMMON_COV_METHOD,pstDlt645Frame_Info->u8RevBuf,u8LenList[0],
						&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen],&u8DataLen);
						pstRt_Res_Info->DataLen += u8DataLen;	
					}
					else
					{
						MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[j]);
						RD_DLT645Data_To_NwData(u8ConvertMethodList[j],pstDlt645Frame_Info->u8RevBuf,u8LenList[j],
						&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen],&u8DataLen);
						pstRt_Res_Info->DataLen += u8DataLen;
					}
				}
			}
			if(pstDlt645Frame_Info->u8RevLen != 0)	//接收到数据
			{
				if(stPnPara.ProtocolType == METER_EDMI)
				{
					//转换EDMI的数据帧为原始数据帧
					//err20190709 接收时已经处理好了
					//QCSG_GetEDMIRealFrame(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen);
					
					if(QCSG_EDMIFrameJudge(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen) != TRUE)
					{//判断是否有效帧 无效
						MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[0]);
						RD_EDMIData_To_NwData(COMMON_COV_METHOD,pstDlt645Frame_Info->u8RevBuf,u8LenList[0],
						&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen],&u8DataLen);
						pstRt_Res_Info->DataLen += u8DataLen;
					}
					else 
					{	u8DataLen = 8;
						u8DataPos = 17;//如果下发M<0000FFF0>的方式抄读 则数据内容在第17字节
						RD_EDMIData_To_NwData(u8ConvertMethodList[j],&pstDlt645Frame_Info->u8RevBuf[u8DataPos],u8DataLen,
						&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen],&u8DataLen);
						pstRt_Res_Info->DataLen += u8DataLen;
					}
				}
				else 
				{
					if(QCSG_Dlt645FrameJudge(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen) != TRUE)
					{
						MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[j]);
						RD_DLT645Data_To_NwData(u8ConvertMethodList[j],pstDlt645Frame_Info->u8RevBuf,u8LenList[j],
						&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen],&u8DataLen);
						pstRt_Res_Info->DataLen += u8DataLen;
					}
					else
					{
						u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
						u8DataLen = pstDlt645Frame_Info->u8RevBuf[9];
						if((u8CtrlCode == 0xC1)||(u8CtrlCode == 0xD1))
						{
							MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[j]);
							RD_DLT645Data_To_NwData(u8ConvertMethodList[j],pstDlt645Frame_Info->u8RevBuf,u8LenList[j],
							&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen],&u8DataLen);
							pstRt_Res_Info->DataLen += u8DataLen;
						}
						else
						{
							for(k = 0;k < u8DataLen;k++)
							{
								pstDlt645Frame_Info->u8RevBuf[10 + k] -= 0x33;			
							}				
							if(stPnPara.ProtocolType == METER_DLT645_97)
							{
								u8DataPos = 12;
								u8DataLen -= 2;
							}
							else
							{
								u8DataPos = 14;
								u8DataLen -= 4;
							}
							if(u32NwIdent == 0x0207FF00)
							{
								MemCopy(&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen + 6],&pstDlt645Frame_Info->u8RevBuf[u8DataPos],u8DataLen);
							}
							else
							{
								RD_DLT645Data_To_NwData(u8ConvertMethodList[j],&pstDlt645Frame_Info->u8RevBuf[u8DataPos],u8DataLen,
								&pstRt_Res_Info->u8PnFnData[pstRt_Res_Info->DataLen],&u8DataLen);
							}
							pstRt_Res_Info->DataLen += u8DataLen;
						}
					}
				}
			}
		}
		if((u32NwIdent == 0x0201FF00) || (u32NwIdent == 0x0202FF00) || (u32NwIdent == 0x0207FF00))
		{
			pstRt_Res_Info->u8PnFnData[2] = u8FailLen;
			pstRt_Res_Info->u8PnFnData[3] = 0;		
			stSendReq_Info.DataLen = 8 + u8FailLen;						
		}
		else
		{
			stSendReq_Info.DataLen = pstRt_Res_Info->DataLen;
			pstRt_Res_Info->DataLen -= 8;
			pstRt_Res_Info->u8PnFnData[2] = (u8)pstRt_Res_Info->DataLen;
			pstRt_Res_Info->u8PnFnData[3] = (u8)(pstRt_Res_Info->DataLen >> 8);					
		}
		u32RdStartTick = HAL_GetSystemTick();	
		u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
		//回到主循环，让上行协议可以发送
		pu32Value = (u32*)(ADDR_MS_ENTRY);
		//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
		pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
		(*(void(*)())pu32Value[115])();	
		while(u8Res != NO_ERROR)
		{
			//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
			u8Res = QCSGSingleFrameSendReq(stSendReq_Info.QCSGFrameInfo.Port,&stSendReq_Info);
			(*(void(*)())pu32Value[115])();	
			u32CurrTick = HAL_GetSystemTick();
			if((u32CurrTick - u32RdStartTick) > 300)
			{
				break;
			}				
			
