gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
		}

		if(stPnPara.ProtocolType == METER_EDMI)
		{
			if(pstRDMeter_Ctrl_485->u8PnNum_EDMI_IsLoad == SwitchPnToNum(u16Pn))//当前端口实时要抄读的表已登陆，则直接抄且不需要退出登录。		
			{
				;//不需要登陆，不需要退出。
			}
			else if(pstRDMeter_Ctrl_485->u8PnNum_EDMI_IsLoad == 0)//当前端口没有已登陆测量点
			{
				//直接登陆即可，完成后退出。
				//发退出登录帧
				QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_UnLoad_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
				MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
				pstDlt645Frame_Info->u8RevLen = 0;	
				u32ReadLen = 0;
				UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0) break;
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					if((u32CurrTick - u32RdStartTick) > 200) break;	
				}//发送完成
			}
			else //当前端口有已登陆测量点，需要先退出登录该测量点。再登陆实时测量点。完成实时任务后需恢复原来状态。
			{

				//退出登陆帧 实时测量点
				QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_UnLoad_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
				MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
				pstDlt645Frame_Info->u8RevLen = 0;	
				u32ReadLen = 0;
				UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{			
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0) break;
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					if((u32CurrTick - u32RdStartTick) > 200) break;
				}//完成发送
				
				//登陆帧 原来的测量点
				QCSG_MakeEDMIFrame(stPnPara_Temp.Addr,(u8*)EDMI_Load_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
				MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
				pstDlt645Frame_Info->u8RevLen = 0;	
				u32ReadLen = 0;
				UartPortTxReq(TASK_ID_RT_SEND,u8HwPort,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl_Temp,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl_RT->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8HwPort,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{			
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0) break;
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					if((u32CurrTick - u32RdStartTick) > 200) break;
				}//完成发送
			}	
		}
	}
	(*pu8Lock) = FUNC_UNLOCK;	
	pstRt_Req_Info->Lock = 0;
	pstRt_Req_Info->PnListNum = 0;
}
/**--------------------------------------------------------------------
*功    能:冻结抄表处理
*输入参数:u8ChNo:通道号，pstDlt645Frame_Info:DLT645帧结构体，pstRDMeter_Info：抄表信息结构体，u8FrozenFlag：冻结标志
*输出参数:pu8Lock:锁状态
*返    回:无
--------------------------------------------------------------------**/
void RD_Meter_TDD(u8 u8Cycle,u8 u8ChNo,DLT645_FRAME_S* pstDlt645Frame_Info,QCSG_RDMETER_INFO_S* pstRDMeter_Info,u8 u8FrozenFlag,u8* pu8Lock)
{
	QCSG_RECORD_FROZEN_PN_LIST_S* pstRD_Meter_TD_Pn_List = (QCSG_RECORD_FROZEN_PN_LIST_S*)QCSG_RECORD_FROZEN_PN_LIST;
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = NULL;
    TIME_PARAM_S stFrozenTime;
	RealTimeYYStruct stFrozenYYTime;
	MeasurePointStruct stPnPara;
    u8 u8MeterId[6],u8Ident[4],u8FrameType = 0,u8DataType = 0,u8FEFlag = TRUE,i = 0;
    u8 u8ProtocolType = 0,u8IdentNum = 0,u8IdentLen = 0,u8CtrlCode = 0;
    u16 u16Pn = 0;
	u32 u32RdStartTick = 0,u32CurrTick = 0,u32ReadLen = 0,u32BpsCtrl = 0;
	u32* pu32Value = NULL;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl = NULL;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

	u32 u32NWIdent = 0;
	//u8 pu8DataBuf[60] = {0};
	u8* pu8DataBuf = (u8*)ADDR_DATABUFF;//ybwhz指向数据缓冲区临时存放数据 不能长期占用
	u8 u8DataLen = 0;

	if(pstRDMeter_Info->u16RDMeterIndex >= MAX_PN_NUM2)
	{
		//安全性检查
		return;
	}
	if(pstRDMeter_Info->u16RDMeterIndex >= pstRDMeter_Info->u16PnNum)
	{
		//安全性检查
		return;
	}
	if(u8ChNo == RS485_1PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485I_RAM_FROZEN_DATA_S;
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485II_RAM_FROZEN_DATA_S;
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_II;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485III_RAM_FROZEN_DATA_S;
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_III;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;		
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_JC;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(HAL_GetSystemTime(&stFrozenTime) != TRUE)
	{
		return;
	}
	else
	{
		RealTimeToYYTime(&stFrozenTime,&stFrozenYYTime);
	}
	u16Pn = pstRDMeter_Info->u16PnList[pstRDMeter_Info->u16RDMeterIndex];
	for(i = 0;i < pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum;i++)
	{
		if(pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u16PnList[i] == u16Pn)
		{
			break;
		}
	}
	if(i < pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum)
	{
		pstRDMeter_Info->u16RDMeterIndex++;
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;		
		return;		
	}
	for(i = 0;i < pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum;i++)
	{
		if(pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u16PnList[i] == u16Pn)
		{
			break;
		}
	}
	if(i >= pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum)
	{
		//如果该表本月月冻结没有转存过，则转存标志置起来
		u8FrozenFlag |= TD_M_TYPE;
	}
	if((u8ChNo != ACSAMPLEPORT) && (u16Pn == 0))
	{
		pstRDMeter_Info->u16RDMeterIndex++;
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;		
		return;
	}	
	if(u16Pn == 0)
	{
		u8FEFlag = FALSE;
	}
	if(pstRDMeter_Info->u16RDIdentIndex == 0)
	{
		//抄读数据标识指针为0，说明是该测量点首次进入，读取测量点信息
		u32ReadLen = sizeof(MeasurePointStruct);
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
			return;
		}
		else
		{
			MemCopy(pstRDMeter_Info->u8MeterId,stPnPara.Addr,6);
			pstRDMeter_Info->u8ProtocolType = stPnPara.ProtocolType;
			if(u16Pn == 0)
			{
				pstRDMeter_Info->u8ProtocolType = METER_DLT645_07;
				u32BpsCtrl = 0;
				pstRDMeter_Info->u32BpsCtrl = u32BpsCtrl;
			}
			else
			{
				RD_GetPn_Bps(stPnPara.PortBaudRate,stPnPara.PortParity,stPnPara.PortDataBit,stPnPara.PortStopBit,&u32BpsCtrl);
				pstRDMeter_Info->u32BpsCtrl = u32BpsCtrl;
			}
		}
		if(stPnPara.State == 0)
		{
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
			return;
		}		
	}
	u32BpsCtrl = pstRDMeter_Info->u32BpsCtrl;
	MemCopy(u8MeterId,pstRDMeter_Info->u8MeterId,6);
	u8ProtocolType = pstRDMeter_Info->u8ProtocolType;
    if(u8ProtocolType == METER_DLT645_97)
    {
        u8IdentNum = MAX_FROZEN_RD97_IDENT_NUM;
        u8IdentLen = 2;
        u8CtrlCode = 0x01;
    }
    else if(u8ProtocolType == METER_DLT645_07)
    {
        u8IdentNum = MAX_FROZEN_RD07_IDENT_NUM;
        u8IdentLen = 4;
        u8CtrlCode = 0x11;
    }
	 else if(u8ProtocolType == METER_EDMI)
    {
        u8IdentNum = MAX_FROZEN_EDMI_IDENT_NUM;
        u8IdentLen = 4;
        //u8CtrlCode = 0x11;
    }
    else
    {
		pstRDMeter_Info->u16RDMeterIndex++;
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;
        return;
    }
    if(u8IdentLen == 2)
    {
        MemCopy(u8Ident,&gc_Jc_Rs485_FrozenReadCode_97[pstRDMeter_Info->u16RDIdentIndex],2);
    }
    if(u8IdentLen == 4)
    {
    	if(u8ProtocolType == METER_DLT645_07)
    	{
        	MemCopy(u8Ident,&gc_Jc_Rs485_FrozenReadCode_07[pstRDMeter_Info->u16RDIdentIndex],4);
    	}
		if(u8ProtocolType == METER_EDMI)
	    {
	        MemCopy(u8Ident,&gc_Jc_Rs485_FrozenReadCode_EDMI[pstRDMeter_Info->u16RDIdentIndex],4);
	    }
    }
    if(u8ProtocolType == METER_EDMI)
	{
	    if(QCSG_MakeEDMIFrame(u8MeterId,u8Ident,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf)!=TRUE)
	    {
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;

