gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
			//err20190611 红相表退出登录后清空测量点号###########################################
			pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号存储，用于实时抄表判断
			
			(*pu8Lock) = FUNC_UNLOCK;
		}




	}
	else	
		RD_METER_Dlt645Data_Process(u8Cycle,u8ChNo,&stFrozenTime,u8FrozenFlag,u16Pn,u8MeterId,u8ProtocolType,pstDlt645Frame_Info);
    return;
}
/**--------------------------------------------------------------------
*功    能:曲线抄表处理
*输入参数:u8ChNo:通道号，pstDlt645Frame_Info:DLT645帧结构体，pstRDMeter_Info：抄表信息结构体，u8FrozenFlag：冻结标志
*输出参数:pu8Lock:锁状态
*返    回:无
--------------------------------------------------------------------**/
void RD_Meter_TDC(u8 u8Cycle,u8 u8ChNo,DLT645_FRAME_S* pstDlt645Frame_Info,QCSG_RDMETER_INFO_S* pstRDMeter_Info,u8 u8FrozenFlag,u8* pu8Lock)
{
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = NULL;
    TIME_PARAM_S stFrozenTime;
	MeasurePointStruct stPnPara;
    u8 u8MeterId[6],u8Ident[4],u8FrameType = 0,u8DataType = 0,u8FEFlag = TRUE;
    u8 u8ProtocolType = 0,u8IdentNum = 0,u8IdentLen = 0,u8CtrlCode = 0;
    u16 u16Pn = 0;
	u32 u32RdStartTick = 0,u32CurrTick = 0,u32ReadLen = 0,u32BpsCtrl = 0;
	u32* pu32Value = NULL;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl = NULL;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

	u32 u32NWIdent = 0;
	u8* pu8DataBuf = (u8*)ADDR_DATABUFF;//ybwhz指向数据缓冲区临时存放数据 不能长期占用
	//u8 pu8DataBuf[60] = {0};
	u8 u8DataLen = 0;
					

	if(pstRDMeter_Info->u16RDMeterIndex >= MAX_PN_NUM2)
	{
		//安全性检查
		return;
	}
	if(pstRDMeter_Info->u16RDMeterIndex >= pstRDMeter_Info->u16PnNum)
	{
		//安全性检查
		return;
	}
	if(u8ChNo == RS485_1PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485I_RAM_FROZEN_DATA_S;
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485II_RAM_FROZEN_DATA_S;
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_II;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_RS485III_RAM_FROZEN_DATA_S;
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_III;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_JC_RAM_FROZEN_DATA_S;	
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_JC;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	}
	if(HAL_GetSystemTime(&stFrozenTime) != TRUE)
	{
		return;
	}
	u16Pn = pstRDMeter_Info->u16PnList[pstRDMeter_Info->u16RDMeterIndex];
	if((u8ChNo != ACSAMPLEPORT) && (u16Pn == 0))
	{
		pstRDMeter_Info->u16RDMeterIndex++;
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;		
		return;
	}	
	if(u16Pn == 0)
	{
		u8FEFlag = FALSE;
	}
	if(pstRDMeter_Info->u16RDIdentIndex == 0)
	{
		//抄读数据标识指针为0，说明是该测量点首次进入，读取测量点信息
		u32ReadLen = sizeof(MeasurePointStruct);
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;			
			return;
		}
		else
		{
			MemCopy(pstRDMeter_Info->u8MeterId,stPnPara.Addr,6);
			pstRDMeter_Info->u8ProtocolType = stPnPara.ProtocolType;
			if(u16Pn == 0)
			{
			    //MC(0xaa,(u32)pstRDMeter_Info->u8MeterId,6);//19-05-28
				pstRDMeter_Info->u8ProtocolType = METER_DLT645_07;
				u32BpsCtrl = 0;
				pstRDMeter_Info->u32BpsCtrl = u32BpsCtrl;
			}
			else
			{
				RD_GetPn_Bps(stPnPara.PortBaudRate,stPnPara.PortParity,stPnPara.PortDataBit,stPnPara.PortStopBit,&u32BpsCtrl);
				pstRDMeter_Info->u32BpsCtrl = u32BpsCtrl;
			}
		}
		if(stPnPara.State == 0)
		{
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
			return;
		}
	}
	u32BpsCtrl = pstRDMeter_Info->u32BpsCtrl;
	MemCopy(u8MeterId,pstRDMeter_Info->u8MeterId,6);
	u8ProtocolType = pstRDMeter_Info->u8ProtocolType;
    if(u8ProtocolType == METER_DLT645_97)
    {
        u8IdentNum = MAX_FIXED_RD97_IDENT_NUM;
        u8IdentLen = 2;
        u8CtrlCode = 0x01;
    }
    else if(u8ProtocolType == METER_DLT645_07)
    {
        u8IdentNum = MAX_FIXED_RD07_IDENT_NUM;
        u8IdentLen = 4;
        u8CtrlCode = 0x11;
    }
    else if(u8ProtocolType == METER_EDMI){

        u8IdentNum = MAX_FIXED_EDMI_NUM;
        u8IdentLen = 2;
     }  
    else
    {
		pstRDMeter_Info->u16RDMeterIndex++;
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;			
        return;
    }
    if(u8IdentLen == 2)
    {
    	  if(u8ProtocolType == METER_DLT645_97)
        	 MemCopy(u8Ident,&gc_Jc_Rs485_FixedReadCode_97[pstRDMeter_Info->u16RDIdentIndex],2);
	 	  else if(u8ProtocolType == METER_EDMI)
        	 MemCopy(u8Ident,&EDMI_cmd[pstRDMeter_Info->u16RDIdentIndex].NwCmd,4);
     }
	
    if(u8IdentLen == 4)
    {
        MemCopy(u8Ident,&gc_Jc_Rs485_FixedReadCode_07[pstRDMeter_Info->u16RDIdentIndex],4);
    }

   if(u8ProtocolType == METER_DLT645_97||u8ProtocolType == METER_DLT645_07){

	    if(QCSG_MakeDLT645Frame(u8FEFlag,u8MeterId,u8CtrlCode,u8Ident,u8IdentLen,
	            sizeof(pstDlt645Frame_Info->u8SendBuf),&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf)!=TRUE)
	    {
	        pstRDMeter_Info->u16RDIdentIndex++;
			if(pstRDMeter_Info->u16RDIdentIndex >= u8IdentNum)
			{
				pstRDMeter_Info->u16RDMeterIndex++;
				pstRDMeter_Info->u16RDIdentIndex = 0;
			}
			pstRDMeter_Info->u8FailTimes = 0;			
	        return;
	    }
     }
    else if(u8ProtocolType == METER_EDMI){

		if(QCSG_MakeEDMIFrame(u8MeterId,u8Ident,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf)!=TRUE)
		{
 			pstRDMeter_Info->u16RDIdentIndex++;
			if(pstRDMeter_Info->u16RDIdentIndex >= u8IdentNum)
			{
				pstRDMeter_Info->u16RDMeterIndex++;
				pstRDMeter_Info->u16RDIdentIndex = 0;
				//err20190611 红相表退出登录后清空测量点号###########################################
				pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号清空，用于实时抄表判断
			}
			pstRDMeter_Info->u8FailTimes = 0;			
	        	return;
		}

