gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	}
   
	(*pu8Lock) = FUNC_LOCK;
	MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
	pstDlt645Frame_Info->u8RevLen = 0;	
	UartPortTxReq(TASK_ID_RD_TDC_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
	u32RdStartTick = HAL_GetSystemTick();
	pu32Value = (u32*)(ADDR_MS_ENTRY);
	while(1)
	{	
		//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
		pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
		if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
		{			
			pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
			if(pstDlt645Frame_Info->u8RevLen > 0)
			{
				break;
			}
		}
		(*(void(*)())pu32Value[115])();
		u32CurrTick = HAL_GetSystemTick();
		if(u8ProtocolType == METER_EDMI)
		{
			if((u32CurrTick - u32RdStartTick) > 300)//EDMI表在波特率1200下 响应时间可能超过1s
			{
				break;
			}
		}
		else 
		{
			if((u32CurrTick - u32RdStartTick) > 100)
			{
				break;
			}
		}
	}
	(*pu8Lock) = FUNC_UNLOCK;

	//err20190611 红相表登陆后登记测量点号##################################################################
	if((u8ProtocolType == METER_EDMI) &&(pstRDMeter_Info->u16RDIdentIndex == 0))//第一条登录帧
		pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = SwitchPnToNum(u16Pn);//将当前登录的测量点号存储，用于实时抄表判断

	if(YBWHZ_TEST)
		if(u8ChNo == RS485_1PORT)
		{
			u8 *p8;
			u8 count = 0;
			MC(0, ADDR_YBWHZ_DATABUFF, 64); 
			p8=(u8*)(ADDR_YBWHZ_DATABUFF);
			p8[count++] = 'C';
			p8[count++] = 'U';
			p8[count++] = 'V';
			p8[count++] = ':';
			//p8[count++] = '';
			//p8[count++] = pstRDMeter_Info->u16RDIdentIndex/10%10 +'0';
			//p8[count++] = pstRDMeter_Info->u16RDIdentIndex/1%10 +'0';
			p8[count++] = '*';
			p8[count++] = (pstRDMeter_Info->u16RDIdentIndex+1)/10%10 +'0';
			p8[count++] = (pstRDMeter_Info->u16RDIdentIndex+1)/1%10 +'0';
			p8[count++] = '/';
			p8[count++] = u8IdentNum/10%10 +'0';
			p8[count++] = u8IdentNum/1%10 +'0';
			p8[count++] = '#';
			p8[count++] = '\n';
			QCSG_LogToRS232Port((u32)1,ADDR_YBWHZ_DATABUFF,count);
		}

	if(pstDlt645Frame_Info->u8RevLen == 0)
	{
		pstRDMeter_Info->u8FailTimes++;
		if(pstRDMeter_Info->u8FailTimes >= 2)
		{
			//当前表同一条命令连续失败2次，跳表
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;	
			pstRDMeter_Info->u8FailTimes = 0;	
			pstFrozenData->u32SaveFlag = 1;	
			RD_Alarm_E200002F(FALSE,&stFrozenTime,u16Pn,u8MeterId);	//电能表通讯失败 ARD1
			
			//err20190611 红相表退出登录后清空测量点号###########################################
			if(u8ProtocolType == METER_EDMI)
				pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号清空，用于实时抄表判断
		}
	}
	else
	{
		pstRDMeter_Info->u8FailTimes = 0;
		pstRDMeter_Info->u16RDIdentIndex++;
		if(pstRDMeter_Info->u16RDIdentIndex >= u8IdentNum)
		{
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;	
			pstFrozenData->u32SaveFlag = 1;	

			//err20190611 红相表退出登录后清空测量点号###########################################
			if(u8ProtocolType == METER_EDMI)
				pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号清空，用于实时抄表判断
		}
		RD_Alarm_E200002F(TRUE,&stFrozenTime,u16Pn,u8MeterId);
	}

	
	if(u8ProtocolType == METER_EDMI)
	{
		if(pstDlt645Frame_Info->u8RevLen == 0)
		{
			MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));		
			return;
		}
		
		u32NWIdent = u8Ident[0]+u8Ident[1]*0x100+u8Ident[2]*0x10000+u8Ident[3]*0x1000000;
		
		//转换EDMI的数据帧为原始数据帧
		//err20190713-3 接收时已经处理好了
		//QCSG_GetEDMIRealFrame(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen);
		
		if(QCSG_EDMIFrameJudge(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen) != TRUE)
		{//判断是否有效帧
			if(QCSG_GetDlt645DataLen_By_Ident(0x0D,u32NWIdent,&u8DataLen)== TRUE)//取长度
			{
				//冻结数据直接写到RAM中
				MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32NWIdent,4);
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = u8DataLen;
				pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
				MemSet(&pstFrozenData->u8Data[pstFrozenData->u32DataLen + 6],0xFF,u8DataLen);
				pstFrozenData->u32DataLen += (6 + u8DataLen);
				return;
			}
			else 
			{
				MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));		
				return;
			}
		}
		else 
		{	//u8DataLen = 8;
			//u8DataPos = 17;//如果下发M<0000FFF0>的方式抄读 则数据内容在第17字节-
			//输入长度没有用到，直接传0.
			if((u32NWIdent != 0x0000fffd) && (u32NWIdent != 0x0000fffc))
				RD_EDMIData_To_NwData((u8)get_edmi_method(u32NWIdent),&pstDlt645Frame_Info->u8RevBuf[17],0,
			pu8DataBuf,&u8DataLen);
		}
		RD_METER_EDMIData_Process(u8ChNo,&stFrozenTime,u8FrozenFlag,u16Pn,u8MeterId,u8DataLen,pu8DataBuf,u32NWIdent);

		if(u32NWIdent == EDMI_cmd[MAX_FIXED_EDMI_NUM-1].NwCmd)//最后一个数据标识 完成存储
		{
			(*pu8Lock) = FUNC_LOCK;
			//发退出登录帧
			QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_UnLoad_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
					
			MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
			pstDlt645Frame_Info->u8RevLen = 0;	
			u32ReadLen = 0;
			UartPortTxReq(TASK_ID_RT_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
			u32RdStartTick = HAL_GetSystemTick();
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			while(1)
			{
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
				if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
				{
					pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
					if(pstDlt645Frame_Info->u8RevLen > 0)
					{
						break;
					}
				}
				(*(void(*)())pu32Value[115])();
				u32CurrTick = HAL_GetSystemTick();
				if((u32CurrTick - u32RdStartTick) > 300)
				{	
					break;
				}
			}

			//err20190611 红相表退出登录后清空测量点号###########################################
			pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号存储，用于实时抄表判断
			
			(*pu8Lock) = FUNC_UNLOCK;
		}

		
	}
	else	
		RD_METER_Dlt645Data_Process(u8Cycle,u8ChNo,&stFrozenTime,u8FrozenFlag,u16Pn,u8MeterId,u8ProtocolType,pstDlt645Frame_Info);
	
	return;
}
/**--------------------------------------------------------------------
*功    能:事件抄表处理
*输入参数:u8ChNo:通道号，pstDlt645Frame_Info:DLT645帧结构体，pstRDMeter_Info：抄表信息结构体，u8FrozenFlag：冻结标志
*输出参数:pu8Lock:锁状态
*返    回:无
--------------------------------------------------------------------**/
void RD_Meter_EVENT(u8 u8Cycle,u8 u8ChNo,DLT645_FRAME_S* pstDlt645Frame_Info,QCSG_RDMETER_INFO_S* pstRDMeter_Info,u8 u8FrozenFlag,u8* pu8Lock)
{
    TIME_PARAM_S stFrozenTime;
	MeasurePointStruct stPnPara;
    u8 u8ProtocolType = 0,u8IdentLen = 0,u8CtrlCode = 0,u8EventIdentNum = 0;
    u8 u8MeterId[6],u8Ident[4],u8FrameType = 0,u8DataType = 0,u8FEFlag = TRUE;
    u8 u8IdentNull[4],u8IdentEnd[4];
    u16 u16Pn = 0;
	u32 u32RdStartTick = 0,u32CurrTick = 0,u32ReadLen = 0,u32BpsCtrl = 0;
	u32* pu32Value = NULL;
	u8 u8First_Alarm=0;
	u8 Index = 0;
	u32 u32Ident = 0;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl = NULL;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

	MemSet(u8IdentNull,0,4);
    MemSet(u8IdentEnd,0xFF,4);
	if(pstRDMeter_Info->u16RDMeterIndex >= MAX_PN_NUM2)
	{
		//安全性检查
		return;
	}
	//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	if(u8ChNo == RS485_1PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_II;
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_III;
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_JC;
	}
	//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

	
	if(HAL_GetSystemTime(&stFrozenTime) != TRUE)
	{
		return;
	}
    u8EventIdentNum = MAX_ALARM_IDENT_NUM;
    if(pstRDMeter_Info->u16RDEventIndex >= u8EventIdentNum)
    {
        pstRDMeter_Info->u16RDMeterIndex++;
        pstRDMeter_Info->u16RDEventIndex = 0;
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;
		pstRDMeter_Info->ReadOK_DI_645_07_Num = 0;//err20190411 当前测量点已抄645帧数
		return;
    }
	//err20190411 增加事件记录抄读数据项的判断，防止告警屏蔽字未打开就不去抄读数据项无法生成告警。
	if((gc_stQCSGAlarm_DLT645_Table[pstRDMeter_Info->u16RDEventIndex].u32AlarmIdent & 0x00010000) == 0)//判断为告警数据标识
	{
	    if(QCSG_CheckAlarmConfig(gc_stQCSGAlarm_DLT645_Table[pstRDMeter_Info->u16RDEventIndex].u32AlarmIdent) != TRUE)
	    {
	        pstRDMeter_Info->u16RDEventIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
	        return;
	    }
	}
	else 
	{
		 if(QCSG_CheckEventMask(gc_stQCSGAlarm_DLT645_Table[pstRDMeter_Info->u16RDEventIndex].u32AlarmIdent) != TRUE)
	    {
	        pstRDMeter_Info->u16RDEventIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
	        return;
	    }
	}
	u16Pn = pstRDMeter_Info->u16PnList[pstRDMeter_Info->u16RDMeterIndex];
	if((u8ChNo != ACSAMPLEPORT) && (u16Pn == 0))
	{
		pstRDMeter_Info->u16RDMeterIndex++;
		pstRDMeter_Info->u16RDEventIndex = 0;		
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;		
		pstRDMeter_Info->ReadOK_DI_645_07_Num = 0;//err20190411 当前测量点已抄645帧数
		return;
	}	
	if(u16Pn == 0)
	{
		u8FEFlag = FALSE;
	}

