gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	for(u8First_Alarm=0;u8First_Alarm<MAX_ALARM_IDENT_NUM;u8First_Alarm++)//err 2018-11-1 找出第一个要抄的告警
	{
		if((gc_stQCSGAlarm_DLT645_Table[u8First_Alarm].u32AlarmIdent & 0x00010000) == 0)//判断为告警数据标识
		{
			if(QCSG_CheckAlarmConfig(gc_stQCSGAlarm_DLT645_Table[u8First_Alarm].u32AlarmIdent)==TRUE)//err 2018-11-1 找到了
			break;
		}
		else //事件记录
		{
			if(QCSG_CheckEventMask(gc_stQCSGAlarm_DLT645_Table[u8First_Alarm].u32AlarmIdent)==TRUE)//err 2018-11-1 找到了
			break;
		}
		
	}
	if(u8First_Alarm>=MAX_ALARM_IDENT_NUM) return;//err 2018-11-1 没有告警要抄
	
	//if(pstRDMeter_Info->u16RDEventIndex == 0)
	//err20190510 增加u16RDIdentIndex的判定 为0 才表示是新测量点。
	if((pstRDMeter_Info->u16RDEventIndex == u8First_Alarm) && (pstRDMeter_Info->u16RDIdentIndex == 0) )	//err 2018-11-1 
	{
		pstRDMeter_Info->ReadOK_DI_645_07_Num = 0;//err20190411 测量点首次进入 清已读645数据标识数量
		//抄读数据标识指针为0，说明是该测量点首次进入，读取测量点信息
		u32ReadLen = sizeof(MeasurePointStruct);
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
			pstRDMeter_Info->ReadOK_DI_645_07_Num = 0;//err20190411 当前测量点已抄645帧数
			return;
		}
		else
		{
			MemCopy(pstRDMeter_Info->u8MeterId,stPnPara.Addr,6);
			pstRDMeter_Info->u8ProtocolType = stPnPara.ProtocolType;			
			if(u16Pn == 0)
			{
				pstRDMeter_Info->u8ProtocolType = METER_DLT645_07;
				u32BpsCtrl = 0;
				pstRDMeter_Info->u32BpsCtrl = u32BpsCtrl;
			}
			else
			{
				RD_GetPn_Bps(stPnPara.PortBaudRate,stPnPara.PortParity,stPnPara.PortDataBit,stPnPara.PortStopBit,&u32BpsCtrl);
				pstRDMeter_Info->u32BpsCtrl = u32BpsCtrl;
			}
		}
		if(stPnPara.State == 0)
		{
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
			pstRDMeter_Info->ReadOK_DI_645_07_Num = 0;//err20190411 当前测量点已抄645帧数
			return;
		}
	}
	u32BpsCtrl = pstRDMeter_Info->u32BpsCtrl;
	MemCopy(u8MeterId,pstRDMeter_Info->u8MeterId,6);
	u8ProtocolType = pstRDMeter_Info->u8ProtocolType;
    if(u8ProtocolType == METER_DLT645_97)
    {
        u8IdentLen = 2;
        u8CtrlCode = 0x01;
    }
    else if(u8ProtocolType == METER_DLT645_07)
    {
        u8IdentLen = 4;
        u8CtrlCode = 0x11;
    }
    else
    {			
		pstRDMeter_Info->u16RDMeterIndex++;
		pstRDMeter_Info->u16RDEventIndex = 0;
		pstRDMeter_Info->u16RDIdentIndex = 0;
		pstRDMeter_Info->u8FailTimes = 0;
		pstRDMeter_Info->ReadOK_DI_645_07_Num = 0;//err20190411 当前测量点已抄645帧数
        return;
    }
    if(u8IdentLen == 2)
    {
        MemCopy(u8Ident,&gc_stQCSGAlarm_DLT645_Table[pstRDMeter_Info->u16RDEventIndex].u32Dlt64597Ident[pstRDMeter_Info->u16RDIdentIndex],2);
        if((memcmp(u8Ident,u8IdentNull,2) == 0)||(memcmp(u8Ident,u8IdentEnd,2) == 0))
        {
            pstRDMeter_Info->u16RDEventIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
            return;
        }
    }
    if(u8IdentLen == 4)
    {
        MemCopy(u8Ident,&gc_stQCSGAlarm_DLT645_Table[pstRDMeter_Info->u16RDEventIndex].u32Dlt64507Ident[pstRDMeter_Info->u16RDIdentIndex],4);	
        if((memcmp(u8Ident,u8IdentNull,4) == 0)||(memcmp(u8Ident,u8IdentEnd,4) == 0))
        {
            pstRDMeter_Info->u16RDEventIndex++;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;
            return;
        }
    }
	//比较是否该数据项已抄读过 抄读过则跳过。
	u32Ident = gc_stQCSGAlarm_DLT645_Table[pstRDMeter_Info->u16RDEventIndex].u32Dlt64507Ident[pstRDMeter_Info->u16RDIdentIndex];
	for(Index = 0 ;Index < pstRDMeter_Info->ReadOK_DI_645_07_Num;Index++)
	{
		if(u32Ident == pstRDMeter_Info->ReadOK_DI_645_07[Index])
		{
			pstRDMeter_Info->u16RDIdentIndex++;
			pstRDMeter_Info->u8FailTimes = 0;
       		return;
		}
	}
	
    if(QCSG_MakeDLT645Frame(u8FEFlag,u8MeterId,u8CtrlCode,u8Ident,u8IdentLen,
            sizeof(pstDlt645Frame_Info->u8SendBuf),&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf)!=TRUE)
    {
        pstRDMeter_Info->u16RDIdentIndex++;
		pstRDMeter_Info->u8FailTimes = 0;
        return;
    }
		
	///////////////////////////ybwhz测试///////////////////////////////
		if(YBWHZ_TEST)
		{
			u8 *p8;
			u8 count = 0;
			MC(0, ADDR_YBWHZ_DATABUFF, 64); 
			p8=(u8*)(ADDR_YBWHZ_DATABUFF);
			p8[count++] = 'A';
			p8[count++] = 'M';
			p8[count++] = 'R';
			p8[count++] = ':';
			p8[count++] = pstRDMeter_Info->u16RDMeterIndex/10%10 + '0';
			p8[count++] = pstRDMeter_Info->u16RDMeterIndex/1%10 + '0';
			p8[count++] = '|';
			p8[count++] = 'E';
			p8[count++] = 'T';
			p8[count++] = ':';
			p8[count++] = pstRDMeter_Info->u16RDEventIndex/10%10 + '0';
			p8[count++] = pstRDMeter_Info->u16RDEventIndex/1%10 + '0';
			p8[count++] = '|';
			p8[count++] = 'I';
			p8[count++] = 'D';
			p8[count++] = ':';
			p8[count++] = pstRDMeter_Info->u16RDIdentIndex/10%10 + '0';
			p8[count++] = pstRDMeter_Info->u16RDIdentIndex/1%10 + '0';
			p8[count++] = '#';
			p8[count++] = '\n';
			QCSG_LogToRS232Port((u32)1,ADDR_YBWHZ_DATABUFF,count);
		}
	////////////////////////////ybwhz测试/////////////////////////////



			
	(*pu8Lock) = FUNC_LOCK;
	MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
	pstDlt645Frame_Info->u8RevLen = 0;	
	UartPortTxReq(TASK_ID_RD_EVENT_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
	u32RdStartTick = HAL_GetSystemTick();
	pu32Value = (u32*)(ADDR_MS_ENTRY);
	while(1)
	{
		//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
		pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
		if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
		{			
			pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
			if(pstDlt645Frame_Info->u8RevLen > 0)
			{
				break;
			}
		}
		(*(void(*)())pu32Value[115])();
		u32CurrTick = HAL_GetSystemTick();
		if((u32CurrTick - u32RdStartTick) > 100)
		{
			break;
		}
	}
	(*pu8Lock) = FUNC_UNLOCK;
	if(pstDlt645Frame_Info->u8RevLen > 0)
	{
		pstRDMeter_Info->u8FailTimes = 0;
		RD_METER_Dlt645Data_Process(u8Cycle,u8ChNo,&stFrozenTime,u8FrozenFlag,u16Pn,u8MeterId,u8ProtocolType,pstDlt645Frame_Info);
	}
	else
	{
		pstRDMeter_Info->u8FailTimes++;
		if(pstRDMeter_Info->u8FailTimes >= 2)
		{
			//当前表同一条命令连续失败2次，跳表
			pstRDMeter_Info->u16RDMeterIndex++;
			pstRDMeter_Info->u16RDEventIndex = 0;
			pstRDMeter_Info->u16RDIdentIndex = 0;
			pstRDMeter_Info->u8FailTimes = 0;		
			pstRDMeter_Info->ReadOK_DI_645_07_Num = 0;//err20190411 当前测量点已抄645帧数
		}
		return;		
	}
    pstRDMeter_Info->u16RDIdentIndex++;
	pstRDMeter_Info->ReadOK_DI_645_07[pstRDMeter_Info->ReadOK_DI_645_07_Num] = u32Ident;
	pstRDMeter_Info->ReadOK_DI_645_07_Num++;
    return;
}
/**--------------------------------------------------------------------
*功    能:中继任务抄表处理
*输入参数:u8ChNo:通道号，pstDlt645Frame_Info:DLT645帧结构体，pstRD_Task_Info：任务抄表信息结构体
*输出参数:pu8Lock:锁状态
*返    回:无
--------------------------------------------------------------------**/
void RD_Relay_Task(u8 u8ChNo,DLT645_FRAME_S* pstDlt645Frame_Info,QCSG_RDRELAYTASK_INFO_S* pstRD_Task_Info,u8* pu8Lock)
{
	/*
	 * TODO:中继任务执行次数目前未进行处理。
	 */
	RelayTaskParaStruct* pstRelayTaskParam = NULL;
	ms_Type* pMS_Info = NULL;
    TIME_PARAM_S stLastTime;
    TIME_PARAM_S stCurrTime;
    TIME_PARAM_S stRefTime;
	TIME_PARAM_S stTempTime;
	RealTimeYYStruct stCurrYYTime;
    u8 u8PeriodValue = 0,u8PeriodUnit = 0,u8TaskIndex = 0,u8RelayType = 0,u8FrameType = 0,u8DataType = 0;
	u32 u32RdStartTick = 0,u32CurrTick = 0,u32MaxMallocSize = 0,u32ReadLen = 0,u32BpsCtrl = 0;
	u32 u32RelayTaskIdent = 0xE0000400;
	u32* pu32Value = NULL;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl = NULL;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

    pMS_Info = Get_ms();
	u32MaxMallocSize = pMS_Info->ms_malloc_sizemax();
	if(u32MaxMallocSize < sizeof(RelayTaskParaStruct))
	{
		//动态内存分配不够用，直接返回，此函数无法执行了 
		return;
	}

	//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	if(u8ChNo == RS485_1PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_II;
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_III;
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_JC;
	}
	//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

	
	if(HAL_GetSystemTime(&stCurrTime) != TRUE)
	{
		return;
	}
	if(pstRD_Task_Info->u8RDRelayTaskIndex >= pstRD_Task_Info->u8RelayTaskNum)
    {
        return;
    }
	pstRelayTaskParam = pMS_Info->ms_malloc(sizeof(RelayTaskParaStruct));
    u8TaskIndex = pstRD_Task_Info->u8RDRelayTaskIndex;
	u32RelayTaskIdent |= pstRD_Task_Info->u8RelayTaskList[u8TaskIndex];
	u32ReadLen = sizeof(RelayTaskParaStruct);
	if(NAND_ReadPara(PARA_Task,0,u32RelayTaskIdent,(u8*)pstRelayTaskParam,&u32ReadLen)!= NO_ERROR)
	{
		pstRD_Task_Info->u8RDRelayTaskIndex++;
		pMS_Info->ms_free(pstRelayTaskParam);
		return;
	}
	if(pstRelayTaskParam->Flag != 1)
	{
		pstRD_Task_Info->u8RDRelayTaskIndex++;
		pMS_Info->ms_free(pstRelayTaskParam);
		return;		
	}
	if(TimeValidCheck(&pstRelayTaskParam->ReportTime) != NO_ERROR)
	{
		pstRD_Task_Info->u8RDRelayTaskIndex++;
		pMS_Info->ms_free(pstRelayTaskParam);
		return;		
	}	
	if(TimeValidCheck(&pstRelayTaskParam->SampleTime) != NO_ERROR)
	{
		pstRD_Task_Info->u8RDRelayTaskIndex++;
		pMS_Info->ms_free(pstRelayTaskParam);
		return;		
	}		
    u8PeriodValue = pstRelayTaskParam->SamplePeriod;
	u8PeriodUnit = pstRelayTaskParam->SamplePeriodUnit;
	u8RelayType = pstRelayTaskParam->RelayType;
	MemCopy(&stRefTime,&pstRelayTaskParam->SampleTime,sizeof(TIME_PARAM_S));
	MemCopy(pstDlt645Frame_Info->u8SendBuf,pstRelayTaskParam->Frame,pstRelayTaskParam->Length);
	pstDlt645Frame_Info->u8SendLen = pstRelayTaskParam->Length;
	pMS_Info->ms_free(pstRelayTaskParam);
	MemCopy(&stLastTime,&pstRD_Task_Info->stLastTaskTime[u8TaskIndex],sizeof(TIME_PARAM_S));
	if(TimeValidCheck(&stLastTime) != NO_ERROR)
	{
		RD_Task_LastTimeCalc(&stLastTime,&stCurrTime,&stRefTime,u8PeriodValue,u8PeriodUnit);
		MemCopy(&pstRD_Task_Info->stLastTaskTime[u8TaskIndex],&stLastTime,sizeof(TIME_PARAM_S));
	}
    if(QCSG_Judge_TaskTiming(&stLastTime,&stCurrTime,&stRefTime,u8PeriodValue,u8PeriodUnit) != TRUE)
    {
        pstRD_Task_Info->u8RDRelayTaskIndex++;
		return;
    }
	else
	{
		QCSG_TimerAdd(&stCurrTime,60,&stTempTime);
		RD_Task_LastTimeCalc(&stLastTime,&stTempTime,&stRefTime,u8PeriodValue,u8PeriodUnit);
		MemCopy(&pstRD_Task_Info->stLastTaskTime[u8TaskIndex],&stLastTime,sizeof(TIME_PARAM_S));		
	}
	RD_GetPn_Bps(pstRelayTaskParam->Baud,pstRelayTaskParam->Parity,pstRelayTaskParam->DataBit,pstRelayTaskParam->StopBit,&u32BpsCtrl);
	(*pu8Lock) = FUNC_LOCK;
	/*
	 * TODO:串口特征配置代码，待补充
	 */
	MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
	pstDlt645Frame_Info->u8RevLen = 0;
	UartPortTxReq(TASK_ID_RD_RELAY_TASK_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0501,u32BpsCtrl,1);
	u32RdStartTick = HAL_GetSystemTick();
	pu32Value = (u32*)(ADDR_MS_ENTRY);
	while(1)
	{
		//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
		pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
		if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
		{			
			pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
			if(pstDlt645Frame_Info->u8RevLen > 0)
			{
				break;
			}
		}
		(*(void(*)())pu32Value[115])();
		u32CurrTick = HAL_GetSystemTick();
		if((u32CurrTick - u32RdStartTick) > 100)
		{
			break;
		}
	}
	(*pu8Lock) = FUNC_UNLOCK;
	if(pstDlt645Frame_Info->u8RevLen > 0)
	{
		u32ReadLen = pstDlt645Frame_Info->u8RevLen;
		stCurrYYTime.YearH = 0x20;
		stCurrYYTime.YearL = stCurrTime.u8Year;
		stCurrYYTime.Month = stCurrTime.u8Month;
		stCurrYYTime.Day = stCurrTime.u8Day;
		stCurrYYTime.Hour = stCurrTime.u8Hour;
		stCurrYYTime.Minute = stCurrTime.u8Minute;
		NAND_WriteRelayTask(u8RelayType,u32RelayTaskIdent,&stCurrYYTime,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen);
	}
    MemCopy(&pstRD_Task_Info->stLastTaskTime[u8TaskIndex],&stCurrTime,sizeof(TIME_PARAM_S));
	pstRD_Task_Info->u8RDRelayTaskIndex++;
}
/**--------------------------------------------------------------------
*功    能:普通任务抄表处理
*输入参数:u8ChNo:通道号，pstDlt645Frame_Info:DLT645帧结构体，pstRD_Task_Info：任务抄表信息结构体
*输出参数:pu8Lock:锁状态
*返    回:无
--------------------------------------------------------------------**/
void RD_Common_Task(u8 u8ChNo,DLT645_FRAME_S* pstDlt645Frame_Info,QCSG_RDCOMMONTASK_INFO_S* pstRD_Task_Info,u8* pu8Lock)
{
	NormalTaskParaStruct* pstNormalTaskParam = NULL;
	QCSG_FROZEN_RAM_DATA_S* pstFrozenData = NULL;
	MeasurePointStruct stPnPara;
	ms_Type* pMS_Info = NULL;
    TIME_PARAM_S stLastTime;
    TIME_PARAM_S stCurrTime;
    TIME_PARAM_S stRefTime;
	TIME_PARAM_S stTempTime;
	RealTimeYYStruct stCurrYYTime;
    u8 u8PeriodValue = 0,u8PeriodUnit = 0,u8TaskIndex = 0,i = 0,j = 0,u8FEFlag = TRUE,u8DataLen = 0,u8NwLen = 0;
	u8 u8MeterId[6],u8Ident[4],u8ProtocolType = 0,u8IdentLen = 0,u8CtrlCode = 0,u8FrameType = 0,u8DataType = 0,u8DataPos = 0;
	u8 u8Dlt645IdentNum = 0,u8PnNum = 0,u8FailLen = 0;
	u8 u8ConvertMethodList[12],u8LenList[12],u8FrozenDataLenPos = 0,u8FrozenDataPos = 0;
	u16 u16Pn = 0;
	u16 u16PnList[MAX_PN_NUM2];
	u32 u32NwIdent = 0;
	u32 u32Dlt645Identlist[12];
	u32 u32RdStartTick = 0,u32CurrTick = 0,u32MaxMallocSize = 0,u32ReadLen = 0,u32BpsCtrl = 0;
	u32 u32CommonTaskIdent = 0xE0000300;
	u32* pu32Value = NULL;

	u32 Temp1;//err20190527 冻结数据处理
	
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl = NULL;//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

	pMS_Info = Get_ms();
	u32MaxMallocSize = pMS_Info->ms_malloc_sizemax();
	if(u32MaxMallocSize < sizeof(NormalTaskParaStruct))
	{
		//动态内存分配不够用，直接返回，此函数无法执行了 
		return;
	}

	//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
	if(u8ChNo == RS485_1PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_II;
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_III;
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstRDMeter_Ctrl = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_JC;
	}
	//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)

	
	if(HAL_GetSystemTime(&stCurrTime) != TRUE)
	{
		return;
	}
    if(pstRD_Task_Info->u8RDCommonTaskIndex >= pstRD_Task_Info->u8CommonTaskNum)
    {
        return;
    }
	if(u8ChNo == RS485_1PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_COMMTASK_RS485I_RAM_DATA_S;
	}
	if(u8ChNo == RS485_2PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_COMMTASK_RS485II_RAM_DATA_S;
	}
	if(u8ChNo == RS485_3PORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_COMMTASK_RS485III_RAM_DATA_S;
	}
	if(u8ChNo == ACSAMPLEPORT)
	{
		pstFrozenData = (QCSG_FROZEN_RAM_DATA_S*)QCSG_COMMTASK_JC_RAM_DATA_S;	
	}
	u8TaskIndex = pstRD_Task_Info->u8RDCommonTaskIndex;
	u32CommonTaskIdent |= pstRD_Task_Info->u8CommonTaskList[u8TaskIndex];
    if((pstRD_Task_Info->u8RDMeterIndex == 0)&&(pstRD_Task_Info->u8RDCommonTaskIdentIndex == 0))
    {
		//抄表指针和抄表数据标识指针都为0,读取任务信息
		pstNormalTaskParam = pMS_Info->ms_malloc(sizeof(NormalTaskParaStruct));
		u32ReadLen = sizeof(NormalTaskParaStruct);
		if(NAND_ReadPara(PARA_Task,0,u32CommonTaskIdent,(u8*)pstNormalTaskParam,&u32ReadLen)!= NO_ERROR)
		{
			pstRD_Task_Info->u8RDCommonTaskIndex++;
			pstRD_Task_Info->u8RDMeterIndex = 0;
			pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
			pstFrozenData->u32DataLen = 0;
			pMS_Info->ms_free(pstNormalTaskParam);
			return;
		}
		if(pstNormalTaskParam->Flag != 1)
		{
			pstRD_Task_Info->u8RDCommonTaskIndex++;
			pstRD_Task_Info->u8RDMeterIndex = 0;
			pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
			pstFrozenData->u32DataLen = 0;
			pMS_Info->ms_free(pstNormalTaskParam);
			return;			
		}
		if(TimeValidCheck(&pstNormalTaskParam->ReportTime) != NO_ERROR)
		{
			pstRD_Task_Info->u8RDCommonTaskIndex++;
			pstRD_Task_Info->u8RDMeterIndex = 0;
			pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
			pstFrozenData->u32DataLen = 0;
			pMS_Info->ms_free(pstNormalTaskParam);
			return;						
		}
		if(TimeValidCheck(&pstNormalTaskParam->SampleTime) != NO_ERROR)
		{
			pstRD_Task_Info->u8RDCommonTaskIndex++;
			pstRD_Task_Info->u8RDMeterIndex = 0;
			pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
			pstFrozenData->u32DataLen = 0;
			pMS_Info->ms_free(pstNormalTaskParam);
			return;						
		}
		u8PeriodValue = pstNormalTaskParam->SamplePeriod;
		u8PeriodUnit = pstNormalTaskParam->SamplePeriodUnit;	
		//提取测量点到抄读结构体中
		pstRD_Task_Info->u8PnNum = 0;
		for(i = 0;i < pstNormalTaskParam->DANum;i++)
		{
			u8PnNum = SplitPnToList(pstNormalTaskParam->DA[i],u16PnList,PN_CHECK_ENABLE);
			if((u8PnNum + pstRD_Task_Info->u8PnNum) >= MAX_PN_NUM2)
			{
				u8PnNum = MAX_PN_NUM2 - pstRD_Task_Info->u8PnNum;
				MemCopy((u8*)&pstRD_Task_Info->u16PnList[pstRD_Task_Info->u8PnNum],(u8*)u16PnList,u8PnNum*2);
				pstRD_Task_Info->u8PnNum = MAX_PN_NUM2;
				break;
			}
			else
			{
				MemCopy((u8*)&pstRD_Task_Info->u16PnList[pstRD_Task_Info->u8PnNum],(u8*)u16PnList,u8PnNum*2);
				pstRD_Task_Info->u8PnNum += u8PnNum;
			}
		}
		MemCopy(&stRefTime,&pstNormalTaskParam->SampleTime,sizeof(TIME_PARAM_S));
		pstRD_Task_Info->u8RDCommonTaskIdentNum = pstNormalTaskParam->DataIDNum;
		MemCopy((u8*)pstRD_Task_Info->u8RDTaskIdentList,(u8*)pstNormalTaskParam->DataID,pstNormalTaskParam->DataIDNum * 4);
		pMS_Info->ms_free(pstNormalTaskParam);
        //抄表指针和抄表数据标识指针都为0，说明是新任务判断时间是否到
		MemCopy(&stLastTime,&pstRD_Task_Info->stLastTaskTime[u8TaskIndex],sizeof(TIME_PARAM_S));
		if(TimeValidCheck(&stLastTime) != NO_ERROR)
		{
			RD_Task_LastTimeCalc(&stLastTime,&stCurrTime,&stRefTime,u8PeriodValue,u8PeriodUnit);
			MemCopy(&pstRD_Task_Info->stLastTaskTime[u8TaskIndex],&stLastTime,sizeof(TIME_PARAM_S));
		}
        if(QCSG_Judge_TaskTiming(&stLastTime,&stCurrTime,&stRefTime,u8PeriodValue,u8PeriodUnit) != TRUE)
        {
            //时间未到
            pstRD_Task_Info->u8RDCommonTaskIndex++;
            pstRD_Task_Info->u8RDMeterIndex = 0;
            pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
			pstFrozenData->u32DataLen = 0;
            return;
        }
		else
		{
			//时间到，抄表指针和抄表数据标识指针都为0，说明是首次开始此任务抄读，更新上一次任务执行时间
			QCSG_TimerAdd(&stCurrTime,60,&stTempTime);
			RD_Task_LastTimeCalc(&stLastTime,&stTempTime,&stRefTime,u8PeriodValue,u8PeriodUnit);
			MemCopy(&pstRD_Task_Info->stLastTaskTime[u8TaskIndex],&stLastTime,sizeof(TIME_PARAM_S));			
		}
    }
    if(pstRD_Task_Info->u8RDCommonTaskIdentIndex >= pstRD_Task_Info->u8RDCommonTaskIdentNum)
    {
        //一个测量点所有任务标识都抄读完成，更换测量点抄读
        pstRD_Task_Info->u8RDMeterIndex++;
        pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
		pstFrozenData->u32DataLen = 0;
		return;
    }
	if(pstRD_Task_Info->u8RDMeterIndex >= pstRD_Task_Info->u8PnNum)
    {
        //任务所有测量点都抄读完成,更换任务抄读
        pstRD_Task_Info->u8RDCommonTaskIndex++;
        pstRD_Task_Info->u8RDMeterIndex = 0;
        pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
		pstFrozenData->u32DataLen = 0;
        return;
    }
	u16Pn = pstRD_Task_Info->u16PnList[pstRD_Task_Info->u8RDMeterIndex];
	if(u16Pn == 0)
	{
		pstRD_Task_Info->u32BpsCtrl = 0;
		u8FEFlag = FALSE;
	}
	if(pstRD_Task_Info->u8RDCommonTaskIdentIndex == 0)
	{
		//抄表数据标识指针为0，说明是新表抄读，读取测量点相关参数
		MemSet(pstFrozenData,0,sizeof(QCSG_FROZEN_RAM_DATA_S));
		if(u16Pn != 0)
		{
			u32ReadLen = sizeof(MeasurePointStruct);
			if(NAND_ReadMeasurePoint(u16Pn,0xE0800002,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
			{
				pstRD_Task_Info->u8RDMeterIndex++;
				pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
				return;
			}
			else
			{
				MemCopy(pstRD_Task_Info->u8MeterId,stPnPara.Addr,6);		
				pstRD_Task_Info->u8ProtocolType = stPnPara.ProtocolType;
				pstRD_Task_Info->u8MeterPort = stPnPara.PortID;
				RD_GetPn_Bps(stPnPara.PortBaudRate,stPnPara.PortParity,stPnPara.PortDataBit,stPnPara.PortStopBit,&u32BpsCtrl);
				pstRD_Task_Info->u32BpsCtrl = u32BpsCtrl;
			}
			if(stPnPara.State == 0)
			{
				pstRD_Task_Info->u8RDMeterIndex++;
				pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
				return;
			}
			//判断测量点是否在函数传入的端口下
			if((u16Pn != 0)&&(u8ChNo == ACSAMPLEPORT))
			{
				pstRD_Task_Info->u8RDMeterIndex++;
				pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
				return;			
			}
			if((pstRD_Task_Info->u8MeterPort == 0)&&(u8ChNo != RS485_1PORT))
			{
				pstRD_Task_Info->u8RDMeterIndex++;
				pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
				return;			
			}
			if((pstRD_Task_Info->u8MeterPort == 1)&&(u8ChNo != RS485_2PORT))
			{
				pstRD_Task_Info->u8RDMeterIndex++;
				pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
				return;			
			}
			if((pstRD_Task_Info->u8MeterPort == 2)&&(u8ChNo != RS485_3PORT))
			{
				pstRD_Task_Info->u8RDMeterIndex++;
				pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
				return;			
			}
		}
		else
		{
			if(u8ChNo != ACSAMPLEPORT)
			{
				pstRD_Task_Info->u8RDMeterIndex++;
				pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
				return;			
			}
			GetACSampleAddr(pstRD_Task_Info->u8MeterId);
			//MC(0xaa,(u32)pstRD_Task_Info->u8MeterId,6);//19-05-28,由于存在被485口修改的情况，改成使用广播下发 
			pstRD_Task_Info->u8ProtocolType = METER_DLT645_07;			
		}
	}
	u32BpsCtrl = pstRD_Task_Info->u32BpsCtrl;
	MemCopy(u8MeterId,pstRD_Task_Info->u8MeterId,6);
	u8ProtocolType = pstRD_Task_Info->u8ProtocolType;	
	u32NwIdent = pstRD_Task_Info->u8RDTaskIdentList[pstRD_Task_Info->u8RDCommonTaskIdentIndex];
    if(u8ProtocolType == METER_DLT645_97)
    {
        u8IdentLen = 2;
        u8CtrlCode = 0x01;
    }
    else if(u8ProtocolType == METER_DLT645_07)
    {
        u8IdentLen = 4;
        u8CtrlCode = 0x11;
    }
	else if(u8ProtocolType == METER_EDMI)
	{
		u8IdentLen = 4;
	}
    else
    {
		pstRD_Task_Info->u8RDMeterIndex++;
		pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
		pstFrozenData->u32DataLen = 0;
        return;
    }
	if((QCSG_GetDlt645DataLen_By_Ident(0x0C,u32NwIdent,&u8FailLen) == TRUE) 
	 ||(QCSG_GetDlt645DataLen_By_Ident(0x0D,u32NwIdent,&u8FailLen) == TRUE))
	{
		//需要覆盖所有需要抄读的数据标识
		pstFrozenData->u8Data[pstFrozenData->u32DataLen + 4] = u8FailLen;
		pstFrozenData->u8Data[pstFrozenData->u32DataLen + 5] = 0;
	}
	else
	{
		return;
	}
	MemCopy(&pstFrozenData->u8Data[pstFrozenData->u32DataLen],&u32NwIdent,4);
	u8FrozenDataPos = pstFrozenData->u32DataLen + 6;
	u8FrozenDataLenPos = pstFrozenData->u32DataLen + 4;
	u8NwLen = 0;	
	//南网数据标识到645数据标识转换
	if(QCSG_GetDlt645_EDMI_Ident_By_AFN0C0DTable(u32NwIdent,u8ProtocolType,&u8Dlt645IdentNum,u32Dlt645Identlist,u8ConvertMethodList,u8LenList) != TRUE)
	{
		//表格中找不到，说明目前不支持抄读
		MemSet(&pstFrozenData->u8Data[u8FrozenDataPos],0xFF,u8FailLen);
		pstFrozenData->u32DataLen = pstFrozenData->u32DataLen + 6 + u8FailLen;
		pstRD_Task_Info->u8RDCommonTaskIdentIndex++;
		if(pstRD_Task_Info->u8RDCommonTaskIdentIndex >= pstRD_Task_Info->u8RDCommonTaskIdentNum)
		{
			//换表抄读，将上一个表的数据存储
			pstRD_Task_Info->u8RDMeterIndex++;
			pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
			//pstFrozenData->u32DataLen = 0;
			stCurrYYTime.YearH = 0x20;
			stCurrYYTime.YearL = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Year;
			stCurrYYTime.Month = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Month;
			stCurrYYTime.Day = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Day;
			stCurrYYTime.Hour = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Hour;
			stCurrYYTime.Minute = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Minute;
			NAND_WriteNormalTask(u8MeterId,0,u32CommonTaskIdent,&stCurrYYTime,pstFrozenData->u8Data,&pstFrozenData->u32DataLen);

			if(u8ProtocolType == METER_EDMI)//红相表完成抄读 退出登录
			{
				(*pu8Lock) = FUNC_LOCK;
				//发退出登录帧
				QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_UnLoad_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
						
