gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
				MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
				pstDlt645Frame_Info->u8RevLen = 0;	
				u32ReadLen = 0;
				UartPortTxReq(TASK_ID_RT_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
				u32RdStartTick = HAL_GetSystemTick();
				pu32Value = (u32*)(ADDR_MS_ENTRY);
				while(1)
				{
					//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
					pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
					if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
					{
						pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
						if(pstDlt645Frame_Info->u8RevLen > 0)
						{
							break;
						}
					}
					(*(void(*)())pu32Value[115])();
					u32CurrTick = HAL_GetSystemTick();
					if((u32CurrTick - u32RdStartTick) > 200)
					{	
						break;
					}
				}

				//err20190611 红相表退出登录后清空测量点号###########################################
				pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号存储，用于实时抄表判断
				
				(*pu8Lock) = FUNC_UNLOCK;
			}

		}
		return;
	}
//err20190527 尝试处理冻结数据
//	if((u8Dlt645IdentNum == 1) && (u8ConvertMethodList[0]==TAKE_PRICE_DATA_COV_METHOD))//只有一个冻结数据
//	{
//		u8ConvertMethodList[1] = (u32Dlt645Identlist[0] & 0x000000FF);//第几个费率
//		u8ConvertMethodList[2] = u8LenList[0];//单条数据长度
//	}

	if(u8ProtocolType == METER_EDMI)//判断为红相表
	{
		if(pstRD_Task_Info->u8RDCommonTaskIdentIndex == 0)//第一次抄该表 需要先登录
		{
			(*pu8Lock) = FUNC_LOCK;
			//登陆帧
			QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_Load_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);

			//QCSG_MakeEDMIFrame_Test(0,u8MeterId,u8CtrlCode,u8Ident,u8IdentLen,
			//sizeof(pstDlt645Frame_Info->u8SendBuf),&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);	

			MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
			pstDlt645Frame_Info->u8RevLen = 0;	
			u32ReadLen = 0;
			UartPortTxReq(TASK_ID_RT_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
			u32RdStartTick = HAL_GetSystemTick();
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			while(1)
			{
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
				if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
				{			
					pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
					if(pstDlt645Frame_Info->u8RevLen > 0)
					{
						break;
					}
				}
				(*(void(*)())pu32Value[115])();
				u32CurrTick = HAL_GetSystemTick();
				
				
				if((u32CurrTick - u32RdStartTick) > 300)
				{	
					break;
				}
			}

			//err20190611 红相表登陆后登记测量点号##################################################################
			pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = SwitchPnToNum(u16Pn);//将当前登录的测量点号存储，用于实时抄表判断
			
			(*pu8Lock) = FUNC_UNLOCK;

		}
	}

	
	for(i = 0;i< u8Dlt645IdentNum;i++)
	{
		MemCopy(u8Ident,&u32Dlt645Identlist[i],u8IdentLen);
		if(u8ProtocolType == METER_EDMI)
		{
			if(QCSG_MakeEDMIFrame_RT(u8MeterId,u32NwIdent,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf)!=TRUE);
			u8Dlt645IdentNum = 1;
			//发完登录帧再发抄0169帧
			//QCSG_MakeEDMIFrame_Test(1,u8MeterId,u8CtrlCode,u8Ident,u8IdentLen,
			//sizeof(pstDlt645Frame_Info->u8SendBuf),&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf); 
		}
		else
		{
			if(QCSG_MakeDLT645Frame(u8FEFlag,u8MeterId,u8CtrlCode,u8Ident,u8IdentLen,
	            sizeof(pstDlt645Frame_Info->u8SendBuf),&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf)!=TRUE)
			{
				continue;
			}
		}
		(*pu8Lock) = FUNC_LOCK;
		MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
		pstDlt645Frame_Info->u8RevLen = 0;
		UartPortTxReq(TASK_ID_RD_COMMON_TASK_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
		u32RdStartTick = HAL_GetSystemTick();
		pu32Value = (u32*)(ADDR_MS_ENTRY);
		while(1)
		{
			//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
			pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
			if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
			{			
				pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
				if(pstDlt645Frame_Info->u8RevLen > 0)
				{
					break;
				}
			}
			(*(void(*)())pu32Value[115])();
			u32CurrTick = HAL_GetSystemTick();
			if(u8ProtocolType == METER_EDMI)
			{
				if((u32CurrTick - u32RdStartTick) > 300)//EDMI表在波特率1200下 响应时间可能超过1s
				{
					break;
				}
			}
			else 
			{
				if((u32CurrTick - u32RdStartTick) > 100)
				{
					break;
				}
			}
		}
		if(pstDlt645Frame_Info->u8RevLen == 0)
		{
			UartPortTxReq(TASK_ID_RD_COMMON_TASK_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
			u32RdStartTick = HAL_GetSystemTick();
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			while(1)
			{
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
				if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
				{			
					pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
					if(pstDlt645Frame_Info->u8RevLen > 0)
					{
						break;
					}
				}
				(*(void(*)())pu32Value[115])();
				u32CurrTick = HAL_GetSystemTick();
				if(u8ProtocolType == METER_EDMI)
				{
					if((u32CurrTick - u32RdStartTick) > 300)//EDMI表在波特率1200下 响应时间可能超过1s
					{
						break;
					}
				}
				else 
				{
					if((u32CurrTick - u32RdStartTick) > 100)
					{
						break;
					}
				}
			}
			if(pstDlt645Frame_Info->u8RevLen == 0)
			{
				MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[i]);
				RD_DLT645Data_To_NwData(u8ConvertMethodList[i],pstDlt645Frame_Info->u8RevBuf,u8LenList[i],
				&pstFrozenData->u8Data[u8FrozenDataPos],&u8DataLen);
				u8FrozenDataPos += u8DataLen;
				pstFrozenData->u32DataLen += u8DataLen;	
			}						
		}
		(*pu8Lock) = FUNC_UNLOCK;
		if(pstDlt645Frame_Info->u8RevLen != 0)
		{
			if(u8ProtocolType == METER_EDMI)
			{//红相表
				//转换EDMI的数据帧为原始数据帧
				//err20190713-3 接收时已经处理好了
				//QCSG_GetEDMIRealFrame(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen);
				
				if(QCSG_EDMIFrameJudge(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen) != TRUE)
				{//判断是否有效帧
					MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[j]);
					RD_EDMIData_To_NwData(u8ConvertMethodList[0],pstDlt645Frame_Info->u8RevBuf,u8LenList[j],
					&pstFrozenData->u8Data[u8FrozenDataPos],&u8DataLen);
					pstFrozenData->u32DataLen += u8DataLen;
				}
				else 
				{	u8DataLen = 8;
					u8DataPos = 17;//如果下发M<0000FFF0>的方式抄读 则数据内容在第17字节
					RD_EDMIData_To_NwData(u8ConvertMethodList[j],&pstDlt645Frame_Info->u8RevBuf[u8DataPos],u8DataLen,
					&pstFrozenData->u8Data[u8FrozenDataPos],&u8DataLen);
					pstFrozenData->u32DataLen += u8DataLen;
				}
			}
			else 
			{//645表
				if(QCSG_Dlt645FrameJudge(pstDlt645Frame_Info->u8RevBuf,&pstDlt645Frame_Info->u8RevLen) != TRUE)
				{
					MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[i]);
					RD_DLT645Data_To_NwData(u8ConvertMethodList[i],pstDlt645Frame_Info->u8RevBuf,u8LenList[i],
					&pstFrozenData->u8Data[u8FrozenDataPos],&u8DataLen);
					u8FrozenDataPos += u8DataLen;
					pstFrozenData->u32DataLen += u8DataLen;		
				}
				else
				{
					u8CtrlCode = pstDlt645Frame_Info->u8RevBuf[8];
					u8DataLen = pstDlt645Frame_Info->u8RevBuf[9];
					if((u8CtrlCode == 0xC1)||(u8CtrlCode == 0xD1))
					{
						MemSet(pstDlt645Frame_Info->u8RevBuf,0xFF,u8LenList[i]);
						RD_DLT645Data_To_NwData(u8ConvertMethodList[i],pstDlt645Frame_Info->u8RevBuf,u8LenList[i],
						&pstFrozenData->u8Data[u8FrozenDataPos],&u8DataLen);
						u8FrozenDataPos += u8DataLen;
						pstFrozenData->u32DataLen += u8DataLen;	
					}
					else
					{
						for(j = 0;j < u8DataLen;j++)
						{
							pstDlt645Frame_Info->u8RevBuf[10 + j] -= 0x33;			
						}		
						if(pstRD_Task_Info->u8ProtocolType == METER_DLT645_97)
						{
							u8DataPos = 12;
							u8DataLen -= 2;
						}
						else
						{
							u8DataPos = 14;
							u8DataLen -= 4;
						}
						if(u8ConvertMethodList[i] == TAKE_PRICE_DATA_COV_METHOD)//冻结数据特殊处理
						{
							Temp1 = (u32NwIdent & 0x000000FF);
							Temp1 *= u8LenList[i]/5;
							MR((u32)&pstFrozenData->u8Data[u8FrozenDataPos], (u32)&pstDlt645Frame_Info->u8RevBuf[u8DataPos + Temp1], u8LenList[i]/5);
							u8DataLen = u8LenList[i]/5;
						}
						else 
						{
							RD_DLT645Data_To_NwData(u8ConvertMethodList[i],&pstDlt645Frame_Info->u8RevBuf[u8DataPos],u8DataLen,
							&pstFrozenData->u8Data[u8FrozenDataPos],&u8DataLen);		
						}
						u8FrozenDataPos += u8DataLen;
						pstFrozenData->u32DataLen += u8DataLen;	
					}
				}
			}
		}
		u8NwLen += u8DataLen;
	}
	if((u32NwIdent == 0x0201FF00) || (u32NwIdent == 0x0202FF00) || (u32NwIdent == 0x0207FF00))
	{
		//特殊处理
		pstFrozenData->u8Data[u8FrozenDataLenPos] = u8FailLen;
		pstFrozenData->u8Data[u8FrozenDataLenPos + 1] = 0;	
	}
	else
	{
		pstFrozenData->u8Data[u8FrozenDataLenPos] = u8NwLen;
		pstFrozenData->u8Data[u8FrozenDataLenPos + 1] = 0;
	}
	pstFrozenData->u32DataLen += 6;
	pstRD_Task_Info->u8RDCommonTaskIdentIndex++;
	if(pstRD_Task_Info->u8RDCommonTaskIdentIndex >= pstRD_Task_Info->u8RDCommonTaskIdentNum)
	{
		//换表抄读，将上一个表的数据存储
		pstRD_Task_Info->u8RDMeterIndex++;
		pstRD_Task_Info->u8RDCommonTaskIdentIndex = 0;
		stCurrYYTime.YearH = 0x20;
		stCurrYYTime.YearL = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Year;
		stCurrYYTime.Month = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Month;
		stCurrYYTime.Day = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Day;
		stCurrYYTime.Hour = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Hour;
		stCurrYYTime.Minute = pstRD_Task_Info->stLastTaskTime[u8TaskIndex].u8Minute;
		NAND_WriteNormalTask(u8MeterId,0,u32CommonTaskIdent,&stCurrYYTime,pstFrozenData->u8Data,&pstFrozenData->u32DataLen);	
		pstFrozenData->u32DataLen = 0;


		if(u8ProtocolType == METER_EDMI)//红相表完成抄读 退出登录
		{
			(*pu8Lock) = FUNC_LOCK;
			//发退出登录帧
			QCSG_MakeEDMIFrame(u8MeterId,(u8*)EDMI_UnLoad_Fram,&pstDlt645Frame_Info->u8SendLen,pstDlt645Frame_Info->u8SendBuf);
					
			MemSet(pstDlt645Frame_Info->u8RevBuf,0,sizeof(pstDlt645Frame_Info->u8RevBuf));
			pstDlt645Frame_Info->u8RevLen = 0;	
			u32ReadLen = 0;
			UartPortTxReq(TASK_ID_RT_SEND,u8ChNo,pstDlt645Frame_Info->u8SendBuf,pstDlt645Frame_Info->u8SendLen,0x0301,u32BpsCtrl,1);
			u32RdStartTick = HAL_GetSystemTick();
			pu32Value = (u32*)(ADDR_MS_ENTRY);
			while(1)
			{
				//err20190227 增加加锁超时时间，防止因以太网链接中OS重启导致的锁死状态(堆栈被清空后无法跳出挂起点)
				pstRDMeter_Ctrl->u32LockTimeOutTick = HAL_GetSystemTick();
				if(UartPortRxReq(u8ChNo,pstDlt645Frame_Info->u8RevBuf,&u32ReadLen,&u8FrameType,&u8DataType) == NO_ERROR)
				{
					pstDlt645Frame_Info->u8RevLen = (u8)u32ReadLen;
					if(pstDlt645Frame_Info->u8RevLen > 0)
					{
						break;
					}
				}
				(*(void(*)())pu32Value[115])();
				u32CurrTick = HAL_GetSystemTick();
				if((u32CurrTick - u32RdStartTick) > 200)
				{	
					break;
				}
			}

