gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
			//err20190611 红相表退出登录后清空测量点号###########################################
			pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号存储，用于实时抄表判断
			
			(*pu8Lock) = FUNC_UNLOCK;
		}
		
	}
}
/**--------------------------------------------------------------------
*功    能:抄表处理
*输入参数:u8ChNo:抄表通道,pu8Lock:锁，pstRD_Meter_Info：抄表结构体
*输出参数:pstRD_Meter_Info：抄表结构体
*返    回:无
--------------------------------------------------------------------**/
void RD_Meter_Process(u8 u8Cycle,u8 u8ChNo,QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl,DLT645_FRAME_S* pstDlt645Frame_Info,QCSG_RDMETER_INFO_S* pstRD_Meter_Info,QCSG_RDRELAYTASK_INFO_S* pstRD_RelayTask_Info,QCSG_RDCOMMONTASK_INFO_S* pstRD_CommonTask_Info)
{
    u8 u8FrozenFlag = 0;                           
	u32 u32Tick = 0;
	
	UartRxChCtrlStruct* UartRxChCtrl;//err20190402 抄表以太网重启超时
	UartTaskCtrlStruct* pUTask;
			
	if((pstRDMeter_Ctrl->u8Lock != FUNC_LOCK)&&(pstRDMeter_Ctrl->u8Lock != FUNC_UNLOCK))
	{
		//锁只有这两种状态，若出现第三种状态，说明外挂RAM出现错误，此时初始化传入的相关全局变量
		MemSet(pstRDMeter_Ctrl,0,sizeof(QCSG_RDMETER_CTRL_S));
		MemSet(pstDlt645Frame_Info,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRD_Meter_Info,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRD_RelayTask_Info,0,sizeof(QCSG_RDRELAYTASK_INFO_S));
		MemSet(pstRD_CommonTask_Info,0,sizeof(QCSG_RDCOMMONTASK_INFO_S));
		return;
	}
	if((pstRDMeter_Ctrl->u8Rdm_Sem & 0xC0) != 0)
	{
		//抄表状态高2位不存在意义，若出现，说明外挂RAM出现错误，此时初始化传入的相关全局变量
		MemSet(pstRDMeter_Ctrl,0,sizeof(QCSG_RDMETER_CTRL_S));
		MemSet(pstDlt645Frame_Info,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRD_Meter_Info,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRD_RelayTask_Info,0,sizeof(QCSG_RDRELAYTASK_INFO_S));
		MemSet(pstRD_CommonTask_Info,0,sizeof(QCSG_RDCOMMONTASK_INFO_S));
		return;
	}
	if(pstRD_Meter_Info->u16PnNum > MAX_PN_NUM2)
	{
		//最大测量点数量为8，若大于8，说明外挂RAM出现错误，此时初始化传入的相关全局变量
		MemSet(pstRDMeter_Ctrl,0,sizeof(QCSG_RDMETER_CTRL_S));
		MemSet(pstDlt645Frame_Info,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRD_Meter_Info,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRD_RelayTask_Info,0,sizeof(QCSG_RDRELAYTASK_INFO_S));
		MemSet(pstRD_CommonTask_Info,0,sizeof(QCSG_RDCOMMONTASK_INFO_S));
		return;
	}
	if(pstRD_Meter_Info->u16RDMeterIndex > pstRD_Meter_Info->u16PnNum)
	{
		//抄表指针，最大值为pstRD_Meter_Info->u16PnNum，若大于，说明外挂RAM出现错误，此时初始化传入的相关全局变量
		MemSet(pstRDMeter_Ctrl,0,sizeof(QCSG_RDMETER_CTRL_S));
		MemSet(pstDlt645Frame_Info,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRD_Meter_Info,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRD_RelayTask_Info,0,sizeof(QCSG_RDRELAYTASK_INFO_S));
		MemSet(pstRD_CommonTask_Info,0,sizeof(QCSG_RDCOMMONTASK_INFO_S));
		return;		
	}
	if(pstRD_RelayTask_Info->u8RDRelayTaskIndex > pstRD_RelayTask_Info->u8RelayTaskNum)
	{
		//中继抄读指针，最大值为pstRD_RelayTask_Info->u8RelayTaskNum，若大于，说明外挂RAM出现错误，此时初始化传入的相关全局变量
		MemSet(pstRDMeter_Ctrl,0,sizeof(QCSG_RDMETER_CTRL_S));
		MemSet(pstDlt645Frame_Info,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRD_Meter_Info,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRD_RelayTask_Info,0,sizeof(QCSG_RDRELAYTASK_INFO_S));
		MemSet(pstRD_CommonTask_Info,0,sizeof(QCSG_RDCOMMONTASK_INFO_S));
		return;
	}
	if(pstRD_CommonTask_Info->u8RDCommonTaskIndex > pstRD_CommonTask_Info->u8CommonTaskNum)
	{
		//任务抄读指针，最大值为pstRD_CommonTask_Info->u8CommonTaskNum，若大于，说明外挂RAM出现错误，此时初始化传入的相关全局变量
		MemSet(pstRDMeter_Ctrl,0,sizeof(QCSG_RDMETER_CTRL_S));
		MemSet(pstDlt645Frame_Info,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRD_Meter_Info,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRD_RelayTask_Info,0,sizeof(QCSG_RDRELAYTASK_INFO_S));
		MemSet(pstRD_CommonTask_Info,0,sizeof(QCSG_RDCOMMONTASK_INFO_S));
		return;	
	}			
	u32Tick = HAL_GetSystemTick();
    if(pstRDMeter_Ctrl->u8Lock == FUNC_LOCK)
    {
    	if(u32Tick - pstRDMeter_Ctrl->u32LockTimeOutTick >=350)//err20190226 加锁超时时间3.5s
		{
			pstRDMeter_Ctrl->u8Lock = FUNC_UNLOCK;//超时解锁

			//err20190402 加锁超时后清除串口接收缓冲区数据，防止下一次进入读取到错误的数据。
			//如果不做处理，现象为补抄当前超时帧，跳过下一个数据标识直接抄下下个数据标识。
			UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(u8ChNo);//err20190402
			if(UartRxChCtrl->Empty != BUFFER_EMPTY)
			{
				UartRxChCtrl->Empty = BUFFER_EMPTY;
				UartRxChCtrl->FrameLen = 0;
			
				pUTask = (UartTaskCtrlStruct*)GetUartTaskCtrl(u8ChNo);
				if(pUTask != NULL)
				{
					pUTask->Flag |= UART_FLAG_RX_BUF_READ_DONE;
				}
			}
			///////////////////////////ybwhz测试///////////////////////////////
		if(YBWHZ_TEST)
		{
			u8 *p8;
			u8 count = 0;
			MC(0, ADDR_YBWHZ_DATABUFF, 64); 
			p8=(u8*)(ADDR_YBWHZ_DATABUFF);
			p8[count++] = u8ChNo/10%10 + '0';
			p8[count++] = u8ChNo/1%10 + '0';
			p8[count++] = ':';
			p8[count++] = 'U';
			p8[count++] = 'N';
			p8[count++] = 'L';
			p8[count++] = 'O';
			p8[count++] = 'C';
			p8[count++] = 'K';
			p8[count++] = pstRD_Meter_Info->u16RDMeterIndex/10%10 + '0';
			p8[count++] = pstRD_Meter_Info->u16RDMeterIndex/1%10 + '0';
			p8[count++] = '|';
			p8[count++] = 'E';
			p8[count++] = 'T';
			p8[count++] = ':';
			p8[count++] = pstRD_Meter_Info->u16RDEventIndex/10%10 + '0';
			p8[count++] = pstRD_Meter_Info->u16RDEventIndex/1%10 + '0';
			p8[count++] = '|';
			p8[count++] = 'I';
			p8[count++] = 'D';
			p8[count++] = ':';
			p8[count++] = pstRD_Meter_Info->u16RDIdentIndex/10%10 + '0';
			p8[count++] = pstRD_Meter_Info->u16RDIdentIndex/1%10 + '0';

			p8[count++] = '#';
			p8[count++] = '\n';
			QCSG_LogToRS232Port((u32)1,ADDR_YBWHZ_DATABUFF,count);
		}
	////////////////////////////ybwhz测试/////////////////////////////
		}
		else 
        	return;
    }
	if(pstRD_Meter_Info->u16PnNum == 0)
	{
		pstRDMeter_Ctrl->u8Rdm_Sem = 0;
		return;
	}

#if ((Project/100)==9)
	if(pstRDMeter_Ctrl->u8PB_Task_Lock == TASK_JZQ_LOCK)//配变 假设集中器任务正在执行，则等待集中器任务执行完成。
	{
		return;
	}
#endif
	/*
     * TODO:曲线抄表处理
     */
    if((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_TDC_SEM) != 0)
    {
        //曲线抄表处理，抄表周期到触发
		u8FrozenFlag = TD_C_TYPE;
		RD_Meter_TDC(u8Cycle,u8ChNo,pstDlt645Frame_Info,pstRD_Meter_Info,u8FrozenFlag,&pstRDMeter_Ctrl->u8Lock);
		if(pstRD_Meter_Info->u16RDMeterIndex >= pstRD_Meter_Info->u16PnNum)
		{
			//抄读完成，清相关标识及变量
			pstRDMeter_Ctrl->u8Rdm_Sem &= (~RD_METER_TDC_SEM);
			pstRD_Meter_Info->u16RDMeterIndex = 0;
			pstRD_Meter_Info->u16RDIdentIndex = 0;

