gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
			//err20190611 红相表退出登录后清空测量点号###########################################
			//if(u8ProtocolType == METER_EDMI)
			pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号清空，用于实时抄表判断
		}
		return;
    }
	/*
     * TODO:事件抄表处理，跟曲线抄读一起触发
     */
    if((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_EVENT_SEM) != 0)
    {
		//曲线抄读完成后再进行事件抄读，避免事件抄读打乱公用的pstRD_Meter_Info全局变量
		u8FrozenFlag = 0;
		RD_Meter_EVENT(u8Cycle,u8ChNo,pstDlt645Frame_Info,pstRD_Meter_Info,u8FrozenFlag,&pstRDMeter_Ctrl->u8Lock);
		if(pstRD_Meter_Info->u16RDMeterIndex >= pstRD_Meter_Info->u16PnNum)
		{
			//抄读完成，清相关标识及变量
			pstRDMeter_Ctrl->u8Rdm_Sem &= (~RD_METER_EVENT_SEM);
			pstRD_Meter_Info->u16RDMeterIndex = 0;
			pstRD_Meter_Info->u16RDIdentIndex = 0;			
			pstRD_Meter_Info->u16RDEventIndex = 0;
		}
        return;
    }
    if((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_TDD_SEM) != 0)
    {
		//曲线抄读以及事件抄读完成后再进行日冻结抄读，避免日冻结抄读打乱公用的pstRD_Meter_Info全局变量
		if((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_TDM_SEM) != 0)
		{
			u8FrozenFlag = TD_D_TYPE | TD_M_TYPE;
		}
		else
		{
			u8FrozenFlag = TD_D_TYPE;
		}
		RD_Meter_TDD(u8Cycle,u8ChNo,pstDlt645Frame_Info,pstRD_Meter_Info,u8FrozenFlag,&pstRDMeter_Ctrl->u8Lock);
		if(pstRD_Meter_Info->u16RDMeterIndex >= pstRD_Meter_Info->u16PnNum)
		{
			//抄读完成，清相关标识及变量
			pstRDMeter_Ctrl->u8Rdm_Sem &= (~RD_METER_TDD_SEM);
			pstRDMeter_Ctrl->u8Rdm_Sem &= (~RD_METER_TDM_SEM);
			pstRD_Meter_Info->u16RDMeterIndex = 0;
			pstRD_Meter_Info->u16RDIdentIndex = 0;
			
			//err20190611 红相表退出登录后清空测量点号###########################################
			//if(u8ProtocolType == METER_EDMI)
			pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号清空，用于实时抄表判断
		}
		return;
    }
    /*
     * TODO:中继任务抄表处理,1min触发
     */
    if((pstRDMeter_Ctrl->u8Rdm_Sem & RD_RELAY_TASK_SEM) != 0)
    {
        RD_Relay_Task(u8ChNo,pstDlt645Frame_Info,pstRD_RelayTask_Info,&pstRDMeter_Ctrl->u8Lock);
        if(pstRD_RelayTask_Info->u8RDRelayTaskIndex >= pstRD_RelayTask_Info->u8RelayTaskNum)
        {
            //抄读完成，清相关标识及变量
            pstRDMeter_Ctrl->u8Rdm_Sem &= (~RD_RELAY_TASK_SEM);
            pstRD_RelayTask_Info->u8RDRelayTaskIndex = 0;
        }
        return;
    }
    /*
     * TODO:普通任务抄表处理，1min触发
     */
    if((pstRDMeter_Ctrl->u8Rdm_Sem & RD_COMMON_TASK_SEM) != 0)
    {
        RD_Common_Task(u8ChNo,pstDlt645Frame_Info,pstRD_CommonTask_Info,&pstRDMeter_Ctrl->u8Lock);
        if(pstRD_CommonTask_Info->u8RDCommonTaskIndex >= pstRD_CommonTask_Info->u8CommonTaskNum)
        {
            //抄读完成，清相关标识及变量
            pstRDMeter_Ctrl->u8Rdm_Sem &= (~RD_COMMON_TASK_SEM);
            pstRD_CommonTask_Info->u8RDCommonTaskIndex = 0;
			pstRD_CommonTask_Info->u8RDMeterIndex = 0;
			pstRD_CommonTask_Info->u8RDCommonTaskIdentIndex = 0;

			//err20190611 红相表退出登录后清空测量点号###########################################
			pstRDMeter_Ctrl->u8PnNum_EDMI_IsLoad = 0;//将当前登录的测量点号存储，用于实时抄表判断
        }
        return;
    }
	
#if ((Project/100)==9)
	if(((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_TDC_SEM) == 0)
		 &&((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_TDD_SEM) == 0)
		 &&((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_TDM_SEM) == 0)
		 &&((pstRDMeter_Ctrl->u8Rdm_Sem & RD_METER_EVENT_SEM) == 0)
		 &&((pstRDMeter_Ctrl->u8Rdm_Sem & RD_RELAY_TASK_SEM) == 0)
		 &&((pstRDMeter_Ctrl->u8Rdm_Sem & RD_COMMON_TASK_SEM) == 0))
		{
			if(pstRDMeter_Ctrl->u8PB_Task_Lock == TASK_FK_LOCK)//若负控任务锁住，则判断任务执行完成后解锁
			pstRDMeter_Ctrl->u8PB_Task_Lock = TASK_PB_UNLOCK;
		}
#endif
}
/**--------------------------------------------------------------------
*功    能:更新通道抄表周期
*输入参数:u8ChNo
*输出参数:pu8Period
*返    回:无
--------------------------------------------------------------------**/
void RD_Update_Period(u8 u8ChNo,u8* pu8Period)
{
	AMRChTimeStruct stRDChParam;
	ResultEnum Res = NO_ERROR;
	u32 u32ReadLen = 0;
	switch(u8ChNo)
	{
		case RS485_1PORT:
			u32ReadLen = sizeof(AMRChTimeStruct);
			Res = NAND_ReadPara(PARA_AMR,0,0xE0000200,(u8*)&stRDChParam,&u32ReadLen);
			break;
		case RS485_2PORT:
			u32ReadLen = sizeof(AMRChTimeStruct);
			Res = NAND_ReadPara(PARA_AMR,0,0xE0000201,(u8*)&stRDChParam,&u32ReadLen);
			break;
		case RS485_3PORT:
			u32ReadLen = sizeof(AMRChTimeStruct);
			Res = NAND_ReadPara(PARA_AMR,0,0xE0000202,(u8*)&stRDChParam,&u32ReadLen);
			break;
		default:
			Res = ERROR_InvalidData;
			break;
	}
	if(Res == NO_ERROR)
	{
		if(stRDChParam.PeriodUnit >= 1)
		{
			//抄表周期大于1小时，对于负控来说不合理，默认15min
			(*pu8Period) = 15;
		}
		else
		{
			if(stRDChParam.Period >= 60)
			{
				//抄表周期大于1小时，对于负控来说不合理，默认15min
				(*pu8Period) = 15;
			}
			else
			{
				(*pu8Period) = stRDChParam.Period;
			}				
		}
	}
	else
	{
		//取抄表周期信息，若失败，默认15min
		(*pu8Period) = 15;
	}	
	return;
}
/**--------------------------------------------------------------------
*功    能:更新通道抄表触发消息
*输入参数:u8Period
*输出参数:pstRdMeter_Ctrl
*返    回:无
--------------------------------------------------------------------**/
void RD_Update_RDSem(u8 u8Period,QCSG_RDMETER_CTRL_S* pstRdMeter_Ctrl,QCSG_RDMETER_INFO_S* pstRdMeter_Info)
{
	TIME_PARAM_S stSysCurrTime;
	u8 u8Minute = 0;
	#if(TEST_ON == 1)//交采刷新时间修改为30s一次
		u8 u8Second = 0;
	#endif
	
	HAL_GetSystemTime(&stSysCurrTime);
	u8Minute = QCSG_BCD2HEX(stSysCurrTime.u8Minute);

	if(stSysCurrTime.u8Minute != pstRdMeter_Ctrl->stSysTime_Back.u8Minute)
	{
		//任务抄读触发
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_RELAY_TASK_SEM;
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_COMMON_TASK_SEM;
	}

//err20180801 台体 交采时间修改为30s一次 防止失压晚报
#if(TEST_ON == 1)//交采刷新时间修改为30s一次
	u8Second = QCSG_BCD2HEX(stSysCurrTime.u8Second);
	if(u8Period == 1)//说明为交采
	{
		if((u8Second == 0 || u8Second == 30 ) && (stSysCurrTime.u8Second != pstRdMeter_Ctrl->stSysTime_Back.u8Second))
		{
			//曲线及事件抄读触发
			pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_TDC_SEM;
			pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_EVENT_SEM;
		}
	}
	else if(((u8Period != 0) && (u8Minute % u8Period) == 0) && (stSysCurrTime.u8Minute != pstRdMeter_Ctrl->stSysTime_Back.u8Minute))
	{
		//曲线及事件抄读触发
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_TDC_SEM;
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_EVENT_SEM;
	}

#else
	if(((u8Period != 0) && (u8Minute % u8Period) == 0) && (stSysCurrTime.u8Minute != pstRdMeter_Ctrl->stSysTime_Back.u8Minute))
	{
		//曲线及事件抄读触发
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_TDC_SEM;
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_EVENT_SEM;
	}
#endif
#if defined(FKGA43_CL3200_TEST)
	if((stSysCurrTime.u8Hour == 0) && (stSysCurrTime.u8Minute == 0x01) && (stSysCurrTime.u8Minute != pstRdMeter_Ctrl->stSysTime_Back.u8Minute))
#else
	if((stSysCurrTime.u8Hour == 0) && (stSysCurrTime.u8Minute == 0x10) && (stSysCurrTime.u8Minute != pstRdMeter_Ctrl->stSysTime_Back.u8Minute))
#endif	
	{
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_TDD_SEM;
	}
	if((stSysCurrTime.u8Hour != 0) && (stSysCurrTime.u8Hour != pstRdMeter_Ctrl->stSysTime_Back.u8Hour))
	{
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_TDD_SEM;
	}
	if(stSysCurrTime.u8Month != pstRdMeter_Ctrl->stSysTime_Back.u8Month)
	{
		pstRdMeter_Ctrl->u8Rdm_Sem |= RD_METER_TDM_SEM;
	}
	MemCopy(&pstRdMeter_Ctrl->stSysTime_Back,&stSysCurrTime,sizeof(TIME_PARAM_S));

#if ((Project/100)==9)
	if(((pstRdMeter_Ctrl->u8Rdm_Sem & RD_METER_TDC_SEM) != 0)
	 ||((pstRdMeter_Ctrl->u8Rdm_Sem & RD_METER_TDD_SEM) != 0)
	 ||((pstRdMeter_Ctrl->u8Rdm_Sem & RD_METER_TDM_SEM) != 0)
	 ||((pstRdMeter_Ctrl->u8Rdm_Sem & RD_METER_EVENT_SEM) != 0)
	 ||((pstRdMeter_Ctrl->u8Rdm_Sem & RD_RELAY_TASK_SEM) != 0)
	 ||((pstRdMeter_Ctrl->u8Rdm_Sem & RD_COMMON_TASK_SEM) != 0))
	{
		if(pstRdMeter_Ctrl->u8PB_Task_Lock == TASK_PB_UNLOCK)
		pstRdMeter_Ctrl->u8PB_Task_Lock = TASK_FK_LOCK;
	}
#endif
		
