gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
}
/**--------------------------------------------------------------------
*功    能:抄表处理，各通道抄表处理统一集中在此函数中
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void RD_Meter_Task(void)
{
#if ((Project/100)==3) || ((Project/100)==9)	
	ResultEnum Res = NO_ERROR;
	u8 u8Period = 0,i = 0;
	u16 u16PnNum = 0;
	u32 u32Tick = 0,u32ReadLen = 0;

	//UartRxChCtrlStruct* UartRxChCtrl;//err20190402 抄表以太网重启超时
	//UartTaskCtrlStruct* pUTask;
#endif

	UARTCtrl_TypeDef * UARTCtrl;//err20190226 增加485-II,485-III抄表口判断

#if !defined(FKGA43_CL3200_TEST)
	u32* pu32PowerUpFlag = (u32*)QCSG_RDMETER_POWER_UP_FLAG;
	u32* pu32Flag_Day = (u32*)QCSG_POWER_DOWN_DAY_FLAG;
	u32* pu32Flag_Month = (u32*)QCSG_POWER_DOWN_MONTH_FLAG;
#endif
	TIME_PARAM_S* pstSysBackTime = (TIME_PARAM_S*)QCSG_GLOBAL_TIME;
	TIME_PARAM_S stSysCurrTime,stTempTime;
	
	RS485PortParaStruct stRs485PortParam;
	//抄表任务用到的锁及消息等信息的控制结构体
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl_RS485I = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_I;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl_RS485II = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_II;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl_RS485III = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RS485_III;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl_JC = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_JC;
	QCSG_RDMETER_CTRL_S* pstRDMeter_Ctrl_RT = (QCSG_RDMETER_CTRL_S*)QCSG_RDMETER_CTRL_RT;
	//DLT645组帧结构体
	DLT645_FRAME_S* pstDlt645_Frame_RS485I = (DLT645_FRAME_S*)QCSG_DLT645_FRAME_RS485_I;
	DLT645_FRAME_S* pstDlt645_Frame_RS485II = (DLT645_FRAME_S*)QCSG_DLT645_FRAME_RS485_II;
	DLT645_FRAME_S* pstDlt645_Frame_RS485III = (DLT645_FRAME_S*)QCSG_DLT645_FRAME_RS485_III;
	DLT645_FRAME_S* pstDlt645_Frame_JC = (DLT645_FRAME_S*)QCSG_DLT645_FRAME_JC;
	DLT645_FRAME_S* pstDlt645_Frame_RT = (DLT645_FRAME_S*)QCSG_DLT645_FRAME_RT;
	//抄表信息结构体
	QCSG_RDMETER_INFO_S* pstRDMeter_Info_RS485I = (QCSG_RDMETER_INFO_S*)QCSG_RDMETER_INFO_RS485_I;
	QCSG_RDMETER_INFO_S* pstRDMeter_Info_RS485II = (QCSG_RDMETER_INFO_S*)QCSG_RDMETER_INFO_RS485_II;
	QCSG_RDMETER_INFO_S* pstRDMeter_Info_RS485III = (QCSG_RDMETER_INFO_S*)QCSG_RDMETER_INFO_RS485_III;
	QCSG_RDMETER_INFO_S* pstRDMeter_Info_JC = (QCSG_RDMETER_INFO_S*)QCSG_RDMETER_INFO_JC;
	//中继任务结构体
	QCSG_RDRELAYTASK_INFO_S* pstRDRelayTask_Info_RS485I = (QCSG_RDRELAYTASK_INFO_S*)QCSG_RDRELAYTASK_INFO_RS485_I;
	QCSG_RDRELAYTASK_INFO_S* pstRDRelayTask_Info_RS485II = (QCSG_RDRELAYTASK_INFO_S*)QCSG_RDRELAYTASK_INFO_RS485_II;
	QCSG_RDRELAYTASK_INFO_S* pstRDRelayTask_Info_RS485III = (QCSG_RDRELAYTASK_INFO_S*)QCSG_RDRELAYTASK_INFO_RS485_III;
	QCSG_RDRELAYTASK_INFO_S* pstRDRelayTask_Info_JC = (QCSG_RDRELAYTASK_INFO_S*)QCSG_RDRELAYTASK_INFO_JC;
	//普通任务结构体
	QCSG_RDCOMMONTASK_INFO_S* pstRDCommonTask_Info_RS485I = (QCSG_RDCOMMONTASK_INFO_S*)QCSG_RDCOMMONTASK_INFO_RS485_I;
	QCSG_RDCOMMONTASK_INFO_S* pstRDCommonTask_Info_RS485II = (QCSG_RDCOMMONTASK_INFO_S*)QCSG_RDCOMMONTASK_INFO_RS485_II;
	QCSG_RDCOMMONTASK_INFO_S* pstRDCommonTask_Info_RS485III = (QCSG_RDCOMMONTASK_INFO_S*)QCSG_RDCOMMONTASK_INFO_RS485_III;
	QCSG_RDCOMMONTASK_INFO_S* pstRDCommonTask_Info_JC = (QCSG_RDCOMMONTASK_INFO_S*)QCSG_RDCOMMONTASK_INFO_JC;
	QCSG_RDCOMMONTASK_INFO_S* pstRDCommonTask_Info_Public = (QCSG_RDCOMMONTASK_INFO_S*)QCSG_RDCOMMONTASK_INFO_PUBLIC;

	//冻结数据测量点记录结构体
	QCSG_RECORD_FROZEN_PN_LIST_S* pstRD_Meter_TD_Pn_List = (QCSG_RECORD_FROZEN_PN_LIST_S*)QCSG_RECORD_FROZEN_PN_LIST;
	//控制任务电量结构体
	QCSG_MONTH_ENERGY_LIST_S* pst_Month_Energy_List = (QCSG_MONTH_ENERGY_LIST_S*)QCSG_MONTH_ENERGY_LIST_CTRL;
	//LCD电量结构体
	QCSG_DAY_ENERGY_LIST_S* pst_Day_Energy_List_Lcd = (QCSG_DAY_ENERGY_LIST_S*)QCSG_DAY_ENERGY_LIST_LCD;
	QCSG_MONTH_ENERGY_LIST_S* pst_Month_Energy_List_Lcd = (QCSG_MONTH_ENERGY_LIST_S*)QCSG_MONTH_ENERGY_LIST_LCD;
	
	if((pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u8PnNum > MAX_PN_NUM2) || (pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u8PnNum > MAX_PN_NUM2))
	{
		MemSet(pstRD_Meter_TD_Pn_List,0,sizeof(QCSG_RECORD_FROZEN_PN_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM2;i++)
	{
		if(QCSG_BCDCheck((u8*)&pstRD_Meter_TD_Pn_List->st_TD_D_PnList.u16PnList[i],1) != TRUE)
		{
			MemSet(pstRD_Meter_TD_Pn_List,0,sizeof(QCSG_RECORD_FROZEN_PN_LIST_S));
			break;
		}
		if(QCSG_BCDCheck((u8*)&pstRD_Meter_TD_Pn_List->st_TD_M_PnList.u16PnList[i],1) != TRUE)
		{
			MemSet(pstRD_Meter_TD_Pn_List,0,sizeof(QCSG_RECORD_FROZEN_PN_LIST_S));
			break;
		}
	}
	RD_LcdData_Refresh();	
	u32Tick = HAL_GetSystemTick();
	HAL_GetSystemTime(&stSysCurrTime);
	if(stSysCurrTime.u8Day != pstSysBackTime->u8Day)
	{
		//跨日
		MemSet(&pstRD_Meter_TD_Pn_List->st_TD_D_PnList,0,sizeof(QCSG_FROZEN_PN_LIST_S));
		MemCopy(&stTempTime,&stSysCurrTime,sizeof(TIME_PARAM_S));
		QCSG_DecOneDay(&stTempTime);
#if !defined(FKGA43_CL3200_TEST)
		if((stTempTime.u8Day == pstSysBackTime->u8Day) && (stSysCurrTime.u8Minute == 0))
		{
			//正常跨日，转存统计数据及清除内存中的统计数据
			RD_TDStatisticsDataSave(&stSysCurrTime);
			RD_ClearTDStatisticsData(1);	
		}	
		else
		{
			if((*pu32PowerUpFlag) == 0)
			{
				RD_ClearTDStatisticsData(0);
			}
			else
			{
				RD_ClearTDStatisticsData(1);
			}
		}
		RD_ClearAlarmData();
		//清除全局变量
		(*pu32Flag_Day) = 0;
#endif
#if defined(FKGA43_CL3200_TEST)
		if(stTempTime.u8Day == pstSysBackTime->u8Day)
		{
			RD_TDStatisticsDataSave(&stSysCurrTime);
		}			
		RD_ClearTDStatisticsData(1);	
		RD_ClearAlarmData();		
#endif
		MemSet(pstRDMeter_Ctrl_RS485I,0,sizeof(QCSG_RDMETER_CTRL_S) - 8);
		MemSet(pstRDMeter_Ctrl_RS485II,0,sizeof(QCSG_RDMETER_CTRL_S) - 8);
		MemSet(pstRDMeter_Ctrl_RS485III,0,sizeof(QCSG_RDMETER_CTRL_S) - 8);
		MemSet(pstDlt645_Frame_RS485I,0,sizeof(DLT645_FRAME_S));
		MemSet(pstDlt645_Frame_RS485II,0,sizeof(DLT645_FRAME_S));
		MemSet(pstDlt645_Frame_RS485III,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRDMeter_Info_RS485I,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRDMeter_Info_RS485II,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRDMeter_Info_RS485III,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRDRelayTask_Info_RS485I,0,sizeof(QCSG_RDRELAYTASK_INFO_S)-2048);//err20190528 处理冻结数据问题
		MemSet(pstRDRelayTask_Info_RS485II,0,sizeof(QCSG_RDRELAYTASK_INFO_S)-2048);//err20190528 处理冻结数据问题
		MemSet(pstRDRelayTask_Info_RS485III,0,sizeof(QCSG_RDRELAYTASK_INFO_S)-2048);//err20190528 处理冻结数据问题
		MemSet(pstRDCommonTask_Info_RS485I,0,sizeof(QCSG_RDCOMMONTASK_INFO_S) -256);//err20190528 处理冻结数据问题
		MemSet(pstRDCommonTask_Info_RS485II,0,sizeof(QCSG_RDCOMMONTASK_INFO_S)-256);//err20190528 处理冻结数据问题
		MemSet(pstRDCommonTask_Info_RS485III,0,sizeof(QCSG_RDCOMMONTASK_INFO_S)-256);//err20190528 处理冻结数据问题
		QCSG_UpdatePnList(0x00,MAX_PN_NUM2,pstRDMeter_Info_RS485I->u16PnList,&pstRDMeter_Info_RS485I->u16PnNum);
		QCSG_UpdatePnList(0x01,MAX_PN_NUM2,pstRDMeter_Info_RS485II->u16PnList,&pstRDMeter_Info_RS485II->u16PnNum);		
		QCSG_UpdatePnList(0x02,MAX_PN_NUM2,pstRDMeter_Info_RS485III->u16PnList,&pstRDMeter_Info_RS485III->u16PnNum);
		MemSet(pstRDMeter_Ctrl_JC,0,sizeof(QCSG_RDMETER_CTRL_S) - 8);
		MemSet(pstRDMeter_Ctrl_RT,0,sizeof(QCSG_RDMETER_CTRL_S) - 8);
		MemSet(pstDlt645_Frame_JC,0,sizeof(DLT645_FRAME_S));
		MemSet(pstRDMeter_Info_JC,0,sizeof(QCSG_RDMETER_INFO_S));
		MemSet(pstRDRelayTask_Info_JC,0,sizeof(QCSG_RDRELAYTASK_INFO_S)-2048);//err20190528 处理冻结数据问题
		MemSet(pstRDCommonTask_Info_JC,0,sizeof(QCSG_RDCOMMONTASK_INFO_S)-256);//err20190528 处理冻结数据问题
		MemSet(pst_Day_Energy_List_Lcd,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));
		
