gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/ReadMeter_Task.c
	}
	if(stSysCurrTime.u8Month != pstSysBackTime->u8Month)
	{
		//跨月
		MemSet(&pstRD_Meter_TD_Pn_List->st_TD_M_PnList,0,sizeof(QCSG_FROZEN_PN_LIST_S));
		MemSet(pst_Month_Energy_List,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));
		MemSet(pst_Month_Energy_List_Lcd,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));
		MemCopy(&stTempTime,&stSysCurrTime,sizeof(TIME_PARAM_S));
		QCSG_DecOneMonth(&stTempTime);
#if !defined(FKGA43_CL3200_TEST)
		if((stTempTime.u8Month == pstSysBackTime->u8Month) && (stSysCurrTime.u8Minute == 0))
		{
			RD_TMStatisticsDataSave(&stSysCurrTime);
			RD_ClearTMStatisticsData(1);	
		}		
		else
		{
			if((*pu32PowerUpFlag) == 0)
			{
				RD_ClearTMStatisticsData(0);
			}
			else
			{
				RD_ClearTMStatisticsData(1);
			}
		}
		(*pu32Flag_Month) = 0;
#endif
#if defined(FKGA43_CL3200_TEST)
		if(stTempTime.u8Month == pstSysBackTime->u8Month)
		{
			RD_TMStatisticsDataSave(&stSysCurrTime);
		}			
		RD_ClearTMStatisticsData(1);			
#endif
	}
#if !defined(FKGA43_CL3200_TEST)
	(*pu32PowerUpFlag) = 1;
#endif
	MemCopy(pstSysBackTime,&stSysCurrTime,sizeof(TIME_PARAM_S));
	if(pstRDMeter_Ctrl_RT->u8Lock == FUNC_LOCK)
	{//实时任务到，各通道的抄表任务都暂停，等待实时任务完成
		if(u32Tick - pstRDMeter_Ctrl_RT->u32LockTimeOutTick >=350)//err20190226 加锁超时时间3.5s
		{
			pstRDMeter_Ctrl_RT->u8Lock = FUNC_UNLOCK;//超时解锁

			//err20190402 加锁超时后清除串口接收缓冲区数据，防止下一次进入读取到错误的数据。
			//如果不做处理，现象为补抄当前超时帧，跳过下一个数据标识直接抄下下个数据标识。
			//实时任务暂时不处理，不确定端口号
			/*UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(u8ChNo);//err20190402
			if(UartRxChCtrl->Empty != BUFFER_EMPTY)
			{
				UartRxChCtrl->Empty = BUFFER_EMPTY;
				UartRxChCtrl->FrameLen = 0;
			
				pUTask = (UartTaskCtrlStruct*)GetUartTaskCtrl(u8ChNo);
				if(pUTask != NULL)
				{
					pUTask->Flag |= UART_FLAG_RX_BUF_READ_DONE;
				}
			}*/
			///////////////////////////ybwhz测试///////////////////////////////
		if(YBWHZ_TEST)
		{
			u8 *p8;
			u8 count = 0;
			MC(0, ADDR_YBWHZ_DATABUFF, 64); 
			p8=(u8*)(ADDR_YBWHZ_DATABUFF);
			p8[count++] = 'R';
			p8[count++] = 'T';
			p8[count++] = ':';
			p8[count++] = 'U';
			p8[count++] = 'N';
			p8[count++] = 'L';
			p8[count++] = 'O';
			p8[count++] = 'C';
			p8[count++] = 'K';
			p8[count++] = '#';
			p8[count++] = '\n';
			QCSG_LogToRS232Port((u32)1,ADDR_YBWHZ_DATABUFF,count);
		}
	////////////////////////////ybwhz测试/////////////////////////////
		}
		else 
		{
			return;
		}
	}
	if((pstRDMeter_Ctrl_JC->u8Lock == FUNC_UNLOCK)&&(pstRDMeter_Ctrl_RS485I->u8Lock == FUNC_UNLOCK)
		&&(pstRDMeter_Ctrl_RS485II->u8Lock == FUNC_UNLOCK)&&(pstRDMeter_Ctrl_RS485III->u8Lock == FUNC_UNLOCK))
	{
		//其他定时抄表任务完成后再进行实时任务抄读
		RD_Meter_RT(pstDlt645_Frame_RT,&pstRDMeter_Ctrl_RT->u8Lock);
	}
	MemSet(&stRs485PortParam,0xFF,sizeof(RS485PortParaStruct));

	//JC抄表处理
	if(u32Tick - pstRDMeter_Ctrl_JC->u32ReadPortParamTick >= 6000)		//60s
	{
		// 1min更新一次JC端口的中继任务列表，全部端口的普通任务列表
		QCSG_UpdateRelayTaskList(ACSAMPLEPORT,pstRDRelayTask_Info_JC);
		QCSG_UpdateCommonTaskList(pstRDCommonTask_Info_Public);
		pstRDCommonTask_Info_RS485I->u8CommonTaskNum = pstRDCommonTask_Info_Public->u8CommonTaskNum;
		MemCopy(pstRDCommonTask_Info_RS485I->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskNum);
		pstRDCommonTask_Info_RS485II->u8CommonTaskNum = pstRDCommonTask_Info_Public->u8CommonTaskNum;
		MemCopy(pstRDCommonTask_Info_RS485II->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskNum);
		pstRDCommonTask_Info_RS485III->u8CommonTaskNum = pstRDCommonTask_Info_Public->u8CommonTaskNum;
		MemCopy(pstRDCommonTask_Info_RS485III->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskNum);		

		RD_Alarm_E2000038_PN();		
		pstRDCommonTask_Info_JC->u8CommonTaskNum = pstRDCommonTask_Info_Public->u8CommonTaskNum;
		MemCopy(pstRDCommonTask_Info_JC->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskList,pstRDCommonTask_Info_Public->u8CommonTaskNum);
		
		
		pstRDMeter_Ctrl_JC->u32ReadPortParamTick = u32Tick;
	}
	u8Period = 1;
	//获取抄表消息
	RD_Update_RDSem(u8Period,pstRDMeter_Ctrl_JC,pstRDMeter_Info_JC);
	//抄表处理		
	pstRDMeter_Info_JC->u16PnList[0] = 0;
	pstRDMeter_Info_JC->u16PnNum = 1;
	if(u32Tick >= 3000)
	{
		//JC 上电30s后再进行抄读，避免交采相关数据没有刷新导致统计出错的情况
		RD_Meter_Process(u8Period,ACSAMPLEPORT,pstRDMeter_Ctrl_JC,pstDlt645_Frame_JC,pstRDMeter_Info_JC,pstRDRelayTask_Info_JC,pstRDCommonTask_Info_JC);		
	}


	//第一路RS485抄表处理
	if(u32Tick - pstRDMeter_Ctrl_RS485I->u32ReadPortParamTick >= 6000)
	{
		//更新第一路RS485抄表周期，目前基于10msTick,为1min
		RD_Update_Period(RS485_1PORT,&pstRDMeter_Ctrl_RS485I->u8Rd_Period);
		//更新测量点列表
		u16PnNum = pstRDMeter_Info_RS485I->u16PnNum;
		if(u16PnNum != 0)
		{
			if(((pstRDMeter_Ctrl_RS485I->u8Rdm_Sem & RD_METER_TDC_SEM) == 0)
			 &&((pstRDMeter_Ctrl_RS485I->u8Rdm_Sem & RD_METER_TDD_SEM) == 0)
			 &&((pstRDMeter_Ctrl_RS485I->u8Rdm_Sem & RD_METER_EVENT_SEM) == 0))
			{
				
				//此时无周期抄表任务，更新测量点列表
				pstRDMeter_Info_RS485I->u16PnNum = 0;
				MemSet(pstRDMeter_Info_RS485I->u16PnList,0,sizeof(pstRDMeter_Info_RS485I->u16PnList));
				QCSG_UpdatePnList(0x00,MAX_PN_NUM2,pstRDMeter_Info_RS485I->u16PnList,&pstRDMeter_Info_RS485I->u16PnNum);	
			}	
		}
		else
		{
			//没有记录的测量点信息
			pstRDMeter_Info_RS485I->u16PnNum = 0;
			MemSet(pstRDMeter_Info_RS485I->u16PnList,0,sizeof(pstRDMeter_Info_RS485I->u16PnList));
			QCSG_UpdatePnList(0x00,MAX_PN_NUM2,pstRDMeter_Info_RS485I->u16PnList,&pstRDMeter_Info_RS485I->u16PnNum);				
		}	
		if(u16PnNum != pstRDMeter_Info_RS485I->u16PnNum)
		{
			//测量点变化，立即进行日冻结数据补抄，之前抄读过测量点此时只是重新查询一次
			pstRDMeter_Ctrl_RS485I->u8Rdm_Sem |= RD_METER_TDD_SEM;
			if(stSysCurrTime.u8Day == 0x01)
			{
				pstRDMeter_Ctrl_RS485I->u8Rdm_Sem |= RD_METER_TDM_SEM;				
			}			
		}
		//更新中继任务列表
		QCSG_UpdateRelayTaskList(0,pstRDRelayTask_Info_RS485I);
		pstRDMeter_Ctrl_RS485I->u32ReadPortParamTick = u32Tick;
	}
	u8Period = pstRDMeter_Ctrl_RS485I->u8Rd_Period;
#if defined(FKGA43_CL3200_TEST)
	//过CL3200南网台体，抄表周期固定为2，为了产生告警。
	if(u8Period < 5)
	u8Period = 2;									
#endif
	//获取抄表消息
	RD_Update_RDSem(u8Period,pstRDMeter_Ctrl_RS485I,pstRDMeter_Info_RS485I);
	//抄表处理
	RD_Meter_Process(u8Period,RS485_1PORT,pstRDMeter_Ctrl_RS485I,pstDlt645_Frame_RS485I,pstRDMeter_Info_RS485I,pstRDRelayTask_Info_RS485I,pstRDCommonTask_Info_RS485I);
	
	//第二路RS485抄表处理
	if(u32Tick - pstRDMeter_Ctrl_RS485II->u32ReadPortParamTick >= 6000)
	{
		//读取第二路RS485功能，若是抄表RS485则调用抄表函数,目前基于10msTick,为1min
		u32ReadLen = sizeof(RS485PortParaStruct);
		Res = NAND_ReadPara(PARA_RS485Port,0,0xE0000A01,(u8*)&stRs485PortParam,&u32ReadLen);
		Refresh485PortFunction(RS485_2PORT, &stRs485PortParam);//刷新485端口参数 1min
		if((Res == NO_ERROR)&&(stRs485PortParam.Function == 00))
		{	
			//更新抄表周期			
			RD_Update_Period(RS485_2PORT,&pstRDMeter_Ctrl_RS485II->u8Rd_Period);
			//更新测量点列表
			u16PnNum = pstRDMeter_Info_RS485II->u16PnNum;
			if(u16PnNum != 0)
			{
				if(((pstRDMeter_Ctrl_RS485II->u8Rdm_Sem & RD_METER_TDC_SEM) == 0)
				 &&((pstRDMeter_Ctrl_RS485II->u8Rdm_Sem & RD_METER_TDD_SEM) == 0)
				 &&((pstRDMeter_Ctrl_RS485II->u8Rdm_Sem & RD_METER_EVENT_SEM) == 0))
				{
					//此时无周期抄表任务，更新测量点列表					
					pstRDMeter_Info_RS485II->u16PnNum = 0;
					MemSet(pstRDMeter_Info_RS485II->u16PnList,0,sizeof(pstRDMeter_Info_RS485II->u16PnList));
					QCSG_UpdatePnList(0x01,MAX_PN_NUM2,pstRDMeter_Info_RS485II->u16PnList,&pstRDMeter_Info_RS485II->u16PnNum);		
				}
			}
			else
			{
				//没有记录的测量点信息
				pstRDMeter_Info_RS485II->u16PnNum = 0;
				MemSet(pstRDMeter_Info_RS485II->u16PnList,0,sizeof(pstRDMeter_Info_RS485II->u16PnList));
				QCSG_UpdatePnList(0x01,MAX_PN_NUM2,pstRDMeter_Info_RS485II->u16PnList,&pstRDMeter_Info_RS485II->u16PnNum);				
			}
			if(u16PnNum != pstRDMeter_Info_RS485II->u16PnNum)
			{
				//测量点变化，立即进行日冻结数据补抄，之前抄读过测量点此时只是重新查询一次
				pstRDMeter_Ctrl_RS485II->u8Rdm_Sem |= RD_METER_TDD_SEM;
				if(stSysCurrTime.u8Day == 0x01)
				{
					pstRDMeter_Ctrl_RS485II->u8Rdm_Sem |= RD_METER_TDM_SEM;				
				}
			}
			//更新中继任务列表
			QCSG_UpdateRelayTaskList(1,pstRDRelayTask_Info_RS485II);
		}
		pstRDMeter_Ctrl_RS485II->u32ReadPortParamTick = u32Tick;
	}
	
	
	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
	if(UARTCtrl->Function == 1)
	{
		u8Period = pstRDMeter_Ctrl_RS485II->u8Rd_Period;
		//获取抄表消息
		RD_Update_RDSem(u8Period,pstRDMeter_Ctrl_RS485II,pstRDMeter_Info_RS485II);
		//抄表处理		
		RD_Meter_Process(u8Period,RS485_2PORT,pstRDMeter_Ctrl_RS485II,pstDlt645_Frame_RS485II,pstRDMeter_Info_RS485II,pstRDRelayTask_Info_RS485II,pstRDCommonTask_Info_RS485II);
	}



	
	//第三路RS485抄表处理
	MemSet(&stRs485PortParam,0xFF,sizeof(RS485PortParaStruct));
	if(u32Tick - pstRDMeter_Ctrl_RS485III->u32ReadPortParamTick >= 6000)
	{
		//读取第三路RS485功能，若是抄表RS485则调用抄表函数,目前基于10msTick,为1min
		u32ReadLen = sizeof(RS485PortParaStruct);
		Res = NAND_ReadPara(PARA_RS485Port,0,0xE0000A02,(u8*)&stRs485PortParam,&u32ReadLen);
		Refresh485PortFunction(RS485_3PORT, &stRs485PortParam);				//刷新485端口参数 1min
		if((Res == NO_ERROR)&&(stRs485PortParam.Function == 00))
		{
			//更新抄表周期
			RD_Update_Period(RS485_3PORT,&pstRDMeter_Ctrl_RS485III->u8Rd_Period);
			//更新测量点列表
			u16PnNum = pstRDMeter_Info_RS485III->u16PnNum;	
			if(u16PnNum != 0)
			{
				if(((pstRDMeter_Ctrl_RS485III->u8Rdm_Sem & RD_METER_TDC_SEM) == 0)
				 &&((pstRDMeter_Ctrl_RS485III->u8Rdm_Sem & RD_METER_TDD_SEM) == 0)
				 &&((pstRDMeter_Ctrl_RS485III->u8Rdm_Sem & RD_METER_EVENT_SEM) == 0))
				{
					//此时无周期抄表任务，更新测量点列表					
					pstRDMeter_Info_RS485III->u16PnNum = 0;
					MemSet(pstRDMeter_Info_RS485III->u16PnList,0,sizeof(pstRDMeter_Info_RS485III->u16PnList));
					QCSG_UpdatePnList(0x02,MAX_PN_NUM2,pstRDMeter_Info_RS485III->u16PnList,&pstRDMeter_Info_RS485III->u16PnNum);		
				}	
			}
			else
			{
				//没有记录的测量点信息
				pstRDMeter_Info_RS485III->u16PnNum = 0;
				MemSet(pstRDMeter_Info_RS485III->u16PnList,0,sizeof(pstRDMeter_Info_RS485III->u16PnList));
				QCSG_UpdatePnList(0x02,MAX_PN_NUM2,pstRDMeter_Info_RS485III->u16PnList,&pstRDMeter_Info_RS485III->u16PnNum);					
			}	
			if(u16PnNum != pstRDMeter_Info_RS485III->u16PnNum)
			{
				//测量点变化，立即进行日冻结数据补抄，之前抄读过测量点此时只是重新查询一次
				pstRDMeter_Ctrl_RS485III->u8Rdm_Sem |= RD_METER_TDD_SEM;
				if(stSysCurrTime.u8Day == 0x01)
				{
					pstRDMeter_Ctrl_RS485III->u8Rdm_Sem |= RD_METER_TDM_SEM;				
				}
			}
			//更新中继任务列表
			QCSG_UpdateRelayTaskList(2,pstRDRelayTask_Info_RS485III);
		}
		pstRDMeter_Ctrl_RS485III->u32ReadPortParamTick = u32Tick;
	}
	
	UARTCtrl = (UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_3PORT);
	if(UARTCtrl->Function == 1)
	{
		u8Period = pstRDMeter_Ctrl_RS485III->u8Rd_Period;
		//获取抄表消息
		RD_Update_RDSem(u8Period,pstRDMeter_Ctrl_RS485III,pstRDMeter_Info_RS485III);
		//抄表处理
		RD_Meter_Process(u8Period,RS485_3PORT,pstRDMeter_Ctrl_RS485III,pstDlt645_Frame_RS485III,pstRDMeter_Info_RS485III,pstRDRelayTask_Info_RS485III,pstRDCommonTask_Info_RS485III);
	}
}
#endif
/************************ (C) COPYRIGHT M***********************END OF FILE****/
